//G01INTDL  JOB 1,'G01INTDL',MSGCLASS=A,MSGLEVEL=(1,1)
//INIT      EXEC PGM=IEHDASDR,PARM='N=1'
//SYSPRINT  DD SYSOUT=A
//SYSIN     DD *
  ANALYZE   TODD=149,VTOC=1,EXTENT=29,NEWVOLID=FDLB67
/*
//
