//G02DALC  JOB MSGLEVEL=1
//VOL       EXEC PGM=IEFBR14
//DLIBVOL   DD DISP=OLD,UNIT=3350,VOL=(PRIVATE,RETAIN,SER=FDLB67)
//GENVOL    DD DISP=OLD,UNIT=3330,VOL=(PRIVATE,RETAIN,SER=DLIBA1)
//*-----------------------------------------------------------------***
//*    Allocate the DLIB data sets.                                 ***
//*-----------------------------------------------------------------***
//ALLOC   EXEC PGM=IEFBR14
//*
//OACMDLIB  DD DSN=SYS1.ACMDLIB,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,10),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAGENLIB  DD DSN=SYS1.AGENLIB,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(6,,30),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAISPMAC  DD DSN=SYS1.AISPMAC,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(1,,8),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAMACLIB  DD DSN=SYS1.AMACLIB,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(15,,45),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAMODGEN  DD DSN=SYS1.AMODGEN,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(32,,50),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSA0    DD DSN=SYS1.AOSA0,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(2,,38),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSBB    DD DSN=SYS1.AOSBB,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,10),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSB0    DD DSN=SYS1.AOSB0,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(2,,20),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSB3    DD DSN=SYS1.AOSB3,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(4,,70),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSCA    DD DSN=SYS1.AOSCA,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,10),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSCD    DD DSN=SYS1.AOSCD,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(5,,43),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSCE    DD DSN=SYS1.AOSCE,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,15),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSC2    DD DSN=SYS1.AOSC2,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,4),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSC5    DD DSN=SYS1.AOSC5,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(2,,43),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSC6    DD DSN=SYS1.AOSC6,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,10),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSD0    DD DSN=SYS1.AOSD0,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(6,,150),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSD7    DD DSN=SYS1.AOSD7,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,15),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSD8    DD DSN=SYS1.AOSD8,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(2,,35),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSG0    DD DSN=SYS1.AOSG0,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,17),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOST4    DD DSN=SYS1.AOST4,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,9),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOSU0    DD DSN=SYS1.AOSU0,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(9,,90),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS0A    DD DSN=SYS1.AOS0A,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,21),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS00    DD DSN=SYS1.AOS00,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,11),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS03    DD DSN=SYS1.AOS03,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,15),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS04    DD DSN=SYS1.AOS04,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,12),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS05    DD DSN=SYS1.AOS05,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,8),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS06    DD DSN=SYS1.AOS06,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,25),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS07    DD DSN=SYS1.AOS07,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,22),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS11    DD DSN=SYS1.AOS11,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,15),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS12    DD DSN=SYS1.AOS12,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(3,,45),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS20    DD DSN=SYS1.AOS20,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,32),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS21    DD DSN=SYS1.AOS21,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(6,,100),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS22    DD DSN=SYS1.AOS22,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(2,,55),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS23    DD DSN=SYS1.AOS23,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(3,,75),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS26    DD DSN=SYS1.AOS26,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(3,,75),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAOS29    DD DSN=SYS1.AOS29,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,11),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAPARMLI  DD DSN=SYS1.APARMLIB,
//             DCB=(RECFM=F,LRECL=80,BLKSIZE=80),
//             SPACE=(CYL,(1,,5),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OAPROCLI  DD DSN=SYS1.APROCLIB,
//             DCB=(RECFM=F,LRECL=80,BLKSIZE=80),
//             SPACE=(CYL,(1,,6),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OARMTMAC  DD DSN=SYS1.ARMTMAC,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(12,,13),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OASAMPLI  DD DSN=SYS1.ASAMPLIB,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(5,,8),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OATCAMMA  DD DSN=SYS1.ATCAMMAC,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(4,,20),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OATSOMAC  DD DSN=SYS1.ATSOMAC,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(1,,7),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OA3790MA  DD DSN=SYS1.A3790MAC,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(8,,17),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OA3790MO  DD DSN=SYS1.A3790MOD,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(4,,36),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OSMPACDS  DD DSN=SYS1.SMPACDS,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(12,,1500),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OSNAACDS  DD DSN=SYS1.SNAACDS,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800),
//             SPACE=(CYL,(1,,75),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.DLIBVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//*-----------------------------------------------------------------***
//*    Uncatalog the DLIB data sets and the SYS1.OBJPDSx data       ***
//*    sets from the VS1 6.0 starter system's system catalog.       ***
//*    Note that if the data sets have not previously been          ***
//*    cataloged, this step will get a return code of 8,            ***
//*    which is normal.                                             ***
//*-----------------------------------------------------------------***
//*
//UNCATLG EXEC PGM=IEHPROGM
//SYSPRINT  DD SYSOUT=A
//GENVOL    DD DISP=OLD,VOL=(PRIVATE,RETAIN,REF=*.VOL.GENVOL)
//SYSIN     DD *
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.ACMDLIB
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AGENLIB
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AISPMAC
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AMACLIB
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AMODGEN
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSA0
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSBB
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSB0
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSB3
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSCA
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSCD
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSCE
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSC2
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSC5
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSC6
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSD0
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSD7
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSD8
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSG0
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOST4
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOSU0
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS0A
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS00
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS03
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS04
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS05
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS06
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS07
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS11
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS12
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS20
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS21
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS22
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS23
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS26
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AOS29
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.APARMLIB
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.APROCLIB
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.ARMTMAC
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.ASAMPLIB
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.ATCAMMAC
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.ATSOMAC
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.AUSERSVC
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.A3790MAC
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.A3790MOD
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.SMPACDS
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.SNAACDS
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.OBJPDS1
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.OBJPDS2
 UNCATLG CVOL=3330=DLIBA1,DSNAME=SYS1.OBJPDS3
/*
//*
//*-----------------------------------------------------------------***
//*    Catalog the DLIB data sets and the SYS1.OBJPDSx data sets    ***
//*    in the VS1 6.0 starter system's system catalog.              ***
//*-----------------------------------------------------------------***
//CATLG   EXEC PGM=IEHPROGM
//SYSPRINT  DD SYSOUT=A
//GENVOL    DD DISP=OLD,VOL=(PRIVATE,RETAIN,REF=*.VOL.GENVOL)
//SYSIN     DD *
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.ACMDLIB
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AGENLIB
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AISPMAC
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AMACLIB
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AMODGEN
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSA0
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSBB
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSB0
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSB3
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSCA
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSCD
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSCE
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSC2
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSC5
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSC6
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSD0
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSD7
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSD8
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSG0
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOST4
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOSU0
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS0A
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS00
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS03
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS04
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS05
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS06
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS07
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS11
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS12
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS20
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS21
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS22
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS23
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS26
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AOS29
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.APARMLIB
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.APROCLIB
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.ARMTMAC
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.ASAMPLIB
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.ATCAMMAC
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.ATSOMAC
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.AUSERSVC
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.A3790MAC
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.A3790MOD
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.SMPACDS
 CATLG CVOL=3330=DLIBA1,VOL=3350=FDLB67,DSNAME=SYS1.SNAACDS
 CATLG CVOL=3330=DLIBA1,VOL=3350=FGEN67,DSNAME=SYS1.OBJPDS1
 CATLG CVOL=3330=DLIBA1,VOL=3350=FGEN67,DSNAME=SYS1.OBJPDS2
 CATLG CVOL=3330=DLIBA1,VOL=3350=FGEN67,DSNAME=SYS1.OBJPDS3
/*
//*
//*-----------------------------------------------------------------***
//*    List the starter system's system catalog.                    ***
//*-----------------------------------------------------------------***
//LISTCTLG EXEC PGM=IEHLIST
//SYSPRINT  DD SYSOUT=A
//GENVOL    DD DISP=OLD,VOL=(PRIVATE,RETAIN,REF=*.VOL.GENVOL)
//SYSIN     DD *
 LISTCTLG VOL=3330=DLIBA1
/*
//
