//G03LDDLB  JOB 1,'Load-DLIBs',CLASS=A,MSGCLASS=A,COND=(0,NE)
//*
//*********************************************************************
//*                                                                 ***
//*    Job:      G03LDDLB                                           ***
//*    Product:  VS1 6.7.                                           ***
//*    Purpose:  Load VS1 DLIBs from tape.                          ***
//*    Run on:   Generating system                                  ***
//*    Update:   2021/03/09                                         ***
//*                                                                 ***
//*********************************************************************
//*
//*-----------------------------------------------------------------***
//*    Load the DLIBS from tape.                                    ***
//*-----------------------------------------------------------------***
//LOAD   EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=A
//SYSUT3   DD UNIT=SYSDA,SPACE=(TRK,(90,90))
//SYSUT4   DD UNIT=SYSDA,SPACE=(TRK,(90,90))
//IACMDLIB DD DISP=OLD,DSN=VS1DL67.ACMDLIB,
//            LABEL=(1,SL,EXPDT=98000),
//            UNIT=TAPE,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAGENLIB DD DISP=OLD,DSN=VS1DL67.AGENLIB,
//            LABEL=(2,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAISPMAC DD DISP=OLD,DSN=VS1DL67.AISPMAC,
//            LABEL=(3,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAMACLIB DD DISP=OLD,DSN=VS1DL67.AMACLIB,
//            LABEL=(4,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAMODGEN DD DISP=OLD,DSN=VS1DL67.AMODGEN,
//            LABEL=(5,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSA0   DD DISP=OLD,DSN=VS1DL67.AOSA0,
//            LABEL=(6,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSBB   DD DISP=OLD,DSN=VS1DL67.AOSBB,
//            LABEL=(7,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSB0   DD DISP=OLD,DSN=VS1DL67.AOSB0,
//            LABEL=(8,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSB3   DD DISP=OLD,DSN=VS1DL67.AOSB3,
//            LABEL=(9,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSCA   DD DISP=OLD,DSN=VS1DL67.AOSCA,
//            LABEL=(10,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSCD   DD DISP=OLD,DSN=VS1DL67.AOSCD,
//            LABEL=(11,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSCE   DD DISP=OLD,DSN=VS1DL67.AOSCE,
//            LABEL=(12,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSC2   DD DISP=OLD,DSN=VS1DL67.AOSC2,
//            LABEL=(13,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSC5   DD DISP=OLD,DSN=VS1DL67.AOSC5,
//            LABEL=(14,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSC6   DD DISP=OLD,DSN=VS1DL67.AOSC6,
//            LABEL=(15,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSD0   DD DISP=OLD,DSN=VS1DL67.AOSD0,
//            LABEL=(16,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSD7   DD DISP=OLD,DSN=VS1DL67.AOSD7,
//            LABEL=(17,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSD8   DD DISP=OLD,DSN=VS1DL67.AOSD8,
//            LABEL=(18,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSG0   DD DISP=OLD,DSN=VS1DL67.AOSG0,
//            LABEL=(19,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOST4   DD DISP=OLD,DSN=VS1DL67.AOST4,
//            LABEL=(20,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOSU0   DD DISP=OLD,DSN=VS1DL67.AOSU0,
//            LABEL=(21,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS0A   DD DISP=OLD,DSN=VS1DL67.AOS0A,
//            LABEL=(22,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS00   DD DISP=OLD,DSN=VS1DL67.AOS00,
//            LABEL=(23,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS03   DD DISP=OLD,DSN=VS1DL67.AOS03,
//            LABEL=(24,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS04   DD DISP=OLD,DSN=VS1DL67.AOS04,
//            LABEL=(25,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS05   DD DISP=OLD,DSN=VS1DL67.AOS05,
//            LABEL=(26,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS06   DD DISP=OLD,DSN=VS1DL67.AOS06,
//            LABEL=(27,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS07   DD DISP=OLD,DSN=VS1DL67.AOS07,
//            LABEL=(28,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS11   DD DISP=OLD,DSN=VS1DL67.AOS11,
//            LABEL=(29,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS12   DD DISP=OLD,DSN=VS1DL67.AOS12,
//            LABEL=(30,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS20   DD DISP=OLD,DSN=VS1DL67.AOS20,
//            LABEL=(31,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS21   DD DISP=OLD,DSN=VS1DL67.AOS21,
//            LABEL=(32,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS22   DD DISP=OLD,DSN=VS1DL67.AOS22,
//            LABEL=(33,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS23   DD DISP=OLD,DSN=VS1DL67.AOS23,
//            LABEL=(34,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS26   DD DISP=OLD,DSN=VS1DL67.AOS26,
//            LABEL=(35,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAOS29   DD DISP=OLD,DSN=VS1DL67.AOS29,
//            LABEL=(36,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAPARMLI DD DISP=OLD,DSN=VS1DL67.APARMLIB,
//            LABEL=(37,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IAPROCLI DD DISP=OLD,DSN=VS1DL67.APROCLIB,
//            LABEL=(38,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IARMTMAC DD DISP=OLD,DSN=VS1DL67.ARMTMAC,
//            LABEL=(39,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IASAMPLI DD DISP=OLD,DSN=VS1DL67.ASAMPLIB,
//            LABEL=(40,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IATCAMMA DD DISP=OLD,DSN=VS1DL67.ATCAMMAC,
//            LABEL=(41,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IATSOMAC DD DISP=OLD,DSN=VS1DL67.ATSOMAC,
//            LABEL=(42,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IA3790MA DD DISP=OLD,DSN=VS1DL67.A3790MAC,
//            LABEL=(43,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//IA3790MO DD DISP=OLD,DSN=VS1DL67.A3790MOD,
//            LABEL=(44,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//ISMPACDS DD DISP=OLD,DSN=VS1DL67.SMPACDS,
//            LABEL=(45,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//ISNAACDS DD DISP=OLD,DSN=VS1DL67.SNAACDS,
//            LABEL=(46,SL,EXPDT=98000),
//            UNIT=AFF=IACMDLIB,VOL=(PRIVATE,RETAIN,SER=ZDLF67)
//OACMDLIB DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.ACMDLIB
//OAGENLIB DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AGENLIB
//OAISPMAC DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AISPMAC
//OAMACLIB DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AMACLIB
//OAMODGEN DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AMODGEN
//OAOSA0   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSA0
//OAOSBB   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSBB
//OAOSB0   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSB0
//OAOSB3   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSB3
//OAOSCA   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSCA
//OAOSCD   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSCD
//OAOSCE   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSCE
//OAOSC2   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSC2
//OAOSC5   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSC5
//OAOSC6   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSC6
//OAOSD0   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSD0
//OAOSD7   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSD7
//OAOSD8   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSD8
//OAOSG0   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSG0
//OAOST4   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOST4
//OAOSU0   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOSU0
//OAOS0A   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS0A
//OAOS00   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS00
//OAOS03   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS03
//OAOS04   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS04
//OAOS05   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS05
//OAOS06   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS06
//OAOS07   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS07
//OAOS11   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS11
//OAOS12   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS12
//OAOS20   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS20
//OAOS21   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS21
//OAOS22   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS22
//OAOS23   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS23
//OAOS26   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS26
//OAOS29   DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.AOS29
//OAPARMLI DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.APARMLIB
//OAPROCLI DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.APROCLIB
//OARMTMAC DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.ARMTMAC
//OASAMPLI DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.ASAMPLIB
//OATCAMMA DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.ATCAMMAC
//OATSOMAC DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.ATSOMAC
//OA3790MA DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.A3790MAC
//OA3790MO DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.A3790MOD
//OSMPACDS DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.SMPACDS
//OSNAACDS DD DISP=SHR,UNIT=SYSDA,VOL=SER=FDLB67,DSN=SYS1.SNAACDS
//SYSIN    DD *
 COPY INDD=IACMDLIB,OUTDD=OACMDLIB
 COPY INDD=IAGENLIB,OUTDD=OAGENLIB
 COPY INDD=IAISPMAC,OUTDD=OAISPMAC
 COPY INDD=IAMACLIB,OUTDD=OAMACLIB
 COPY INDD=IAMODGEN,OUTDD=OAMODGEN
 COPY INDD=IAOSA0,OUTDD=OAOSA0
 COPY INDD=IAOSBB,OUTDD=OAOSBB
 COPY INDD=IAOSB0,OUTDD=OAOSB0
 COPY INDD=IAOSB3,OUTDD=OAOSB3
 COPY INDD=IAOSCA,OUTDD=OAOSCA
 COPY INDD=IAOSCD,OUTDD=OAOSCD
 COPY INDD=IAOSCE,OUTDD=OAOSCE
 COPY INDD=IAOSC2,OUTDD=OAOSC2
 COPY INDD=IAOSC5,OUTDD=OAOSC5
 COPY INDD=IAOSC6,OUTDD=OAOSC6
 COPY INDD=IAOSD0,OUTDD=OAOSD0
 COPY INDD=IAOSD7,OUTDD=OAOSD7
 COPY INDD=IAOSD8,OUTDD=OAOSD8
 COPY INDD=IAOSG0,OUTDD=OAOSG0
 COPY INDD=IAOST4,OUTDD=OAOST4
 COPY INDD=IAOSU0,OUTDD=OAOSU0
 COPY INDD=IAOS0A,OUTDD=OAOS0A
 COPY INDD=IAOS00,OUTDD=OAOS00
 COPY INDD=IAOS03,OUTDD=OAOS03
 COPY INDD=IAOS04,OUTDD=OAOS04
 COPY INDD=IAOS05,OUTDD=OAOS05
 COPY INDD=IAOS06,OUTDD=OAOS06
 COPY INDD=IAOS07,OUTDD=OAOS07
 COPY INDD=IAOS11,OUTDD=OAOS11
 COPY INDD=IAOS12,OUTDD=OAOS12
 COPY INDD=IAOS20,OUTDD=OAOS20
 COPY INDD=IAOS21,OUTDD=OAOS21
 COPY INDD=IAOS22,OUTDD=OAOS22
 COPY INDD=IAOS23,OUTDD=OAOS23
 COPY INDD=IAOS26,OUTDD=OAOS26
 COPY INDD=IAOS29,OUTDD=OAOS29
 COPY INDD=IAPARMLI,OUTDD=OAPARMLI
 COPY INDD=IAPROCLI,OUTDD=OAPROCLI
 COPY INDD=IARMTMAC,OUTDD=OARMTMAC
 COPY INDD=IASAMPLI,OUTDD=OASAMPLI
 COPY INDD=IATCAMMA,OUTDD=OATCAMMA
 COPY INDD=IATSOMAC,OUTDD=OATSOMAC
 COPY INDD=IA3790MA,OUTDD=OA3790MA
 COPY INDD=IA3790MO,OUTDD=OA3790MO
 COPY INDD=ISMPACDS,OUTDD=OSMPACDS
 COPY INDD=ISNAACDS,OUTDD=OSNAACDS
/*
//
