//G05RALC   JOB 1,'G05RALC',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//*********************************************************************
//*                                                                 ***
//*    Job:      G05RALC                                            ***
//*    Product:  VS1 6.7.                                           ***
//*    Purpose:  Allocate data sets on new VS1 6.7 sysres volume.   ***
//*    Run on:   Generating system                                  ***
//*    Update:   2021/04/08                                         ***
//*                                                                 ***
//*********************************************************************
//*
//*-----------------------------------------------------------------***
//*    Specify volser of sysres volume.                             ***
//*-----------------------------------------------------------------***
//VOL     EXEC PGM=IEFBR14
//RESVOL    DD DISP=OLD,UNIT=3350,VOL=(PRIVATE,RETAIN,SER=FGEN67)
//*
//*-----------------------------------------------------------------***
//*    Allocate the sysres data sets.                               ***
//*-----------------------------------------------------------------***
//ALLOC   EXEC PGM=IEFBR14
//*
//SYSCTLG   DD DSN=SYSCTLG,
//             SPACE=(CYL,(8),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//MCAT      DD DSN=SYS1.MCAT.FILLER,
//             SPACE=(CYL,(10),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//BRODCAST  DD DSN=SYS1.BRODCAST,
//             SPACE=(CYL,(1),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//DCMLIB    DD DSN=SYS1.DCMLIB,
//             SPACE=(CYL,(1,,36),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//IMAGELIB  DD DSN=SYS1.IMAGELIB,
//             DCB=(RECFM=U,BLKSIZE=7294),
//             SPACE=(CYL,(1,,36),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//LINKLIB   DD DSN=SYS1.LINKLIB,
//             DCB=(RECFM=U,BLKSIZE=19069),
//             SPACE=(CYL,(30,,255),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//* ---- Note that SYS1.LOGREC is allocated and cataloged
//* ---- during the execution of sysgen stage 2
//*LOGREC    DD DSN=SYS1.LOGREC,
//*             SPACE=(CYL,(1),,CONTIG),
//*             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//*             DISP=(NEW,KEEP,DELETE)
//*
//MACLIB    DD DSN=SYS1.MACLIB,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(25,,75),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//MANX      DD DSN=SYS1.MANX,
//             SPACE=(CYL,(3),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//MANY      DD DSN=SYS1.MANY,
//             SPACE=(CYL,(3),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//NUCLEUS   DD DSN=SYS1.NUCLEUS,
//             SPACE=(CYL,(5,,5),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OBJPDS1  DD  DSN=SYS1.OBJPDS1,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200),
//             SPACE=(CYL,(5,,9),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OBJPDS2  DD  DSN=SYS1.OBJPDS2,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200),
//             SPACE=(CYL,(1,,6),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//OBJPDS3  DD  DSN=SYS1.OBJPDS3,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3200),
//             SPACE=(CYL,(3,,6),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//PARMLIB   DD DSN=SYS1.PARMLIB,
//             DCB=(RECFM=F,LRECL=80,BLKSIZE=80),
//             SPACE=(CYL,(2,,36),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//PROCLIB   DD DSN=SYS1.PROCLIB,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(7,,72),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//RMTMAC    DD DSN=SYS1.RMTMAC,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(11,,36),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//SAMPLIB   DD DSN=SYS1.SAMPLIB,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(7,,40),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//SVCLIB    DD DSN=SYS1.SVCLIB,
//             DCB=(DSORG=PO,RECFM=U,BLKSIZE=2048),
//             SPACE=(CYL,(11,,265),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//SYSJOBQE  DD DSN=SYS1.SYSJOBQE,
//             SPACE=(CYL,(4),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//SYSPOOL   DD DSN=SYS1.SYSPOOL,
//             SPACE=(CYL,(75),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//SYSWADS   DD DSN=SYS1.SYSWADS,
//             SPACE=(CYL,(4),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//TELCMLIB  DD DSN=SYS1.TELCMLIB,
//             DCB=(RECFM=U,BLKSIZE=19069),
//             SPACE=(CYL,(3,,36),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//UADS      DD DSN=SYS1.UADS,
//             SPACE=(CYL,(1,,30),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//VTAMLIB   DD DSN=SYS1.VTAMLIB,
//             DCB=(RECFM=U,BLKSIZE=19069),
//             SPACE=(CYL,(5,,75),,CONTIG),
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//*-----------------------------------------------------------------***
//*    Catalog the sysres data sets and the DLIB data sets in       ***
//*    the CVOL catalog just created on the new sysres.  Note       ***
//*    that SYS1.LOGREC will be cataloged in the new system's       ***
//*    catalog by stage 2.                                          ***
//*-----------------------------------------------------------------***
//CATLG   EXEC PGM=IEHPROGM
//SYSPRINT  DD SYSOUT=A
//RESVOL    DD DISP=OLD,VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL)
//SYSIN     DD *
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.BRODCAST
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.DCMLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.IMAGELIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.LINKLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.MACLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.MANX
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.MANY
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.NUCLEUS
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.OBJPDS1
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.OBJPDS2
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.OBJPDS3
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.PARMLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.PROCLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.RMTMAC
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.SAMPLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.SVCLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.SYSJOBQE
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.SYSPOOL
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.SYSWADS
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.TELCMLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.UADS
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.VTAMLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.ACMDLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AGENLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AISPMAC
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AMACLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AMODGEN
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSA0
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSBB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSB0
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSB3
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSCA
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSCD
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSCE
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSC2
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSC5
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSC6
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSD0
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSD7
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSD8
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSG0
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOST4
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOSU0
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS0A
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS00
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS03
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS04
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS05
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS06
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS07
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS11
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS12
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS20
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS21
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS22
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS23
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS26
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AOS29
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.APARMLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.APROCLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.ARMTMAC
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.ASAMPLIB
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.ATCAMMAC
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.ATSOMAC
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.AUSERSVC
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.A3790MAC
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.A3790MOD
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.SMPACDS
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.SMPACRQ
 CATLG   CVOL=3350=FGEN67,VOL=3350=FDLB67,DSNAME=SYS1.SNAACDS
/*
//*
//*-----------------------------------------------------------------***
//*    List the VTOC and catalog on the new sysres.                 ***
//*-----------------------------------------------------------------***
//LIST    EXEC PGM=IEHLIST
//SYSPRINT  DD SYSOUT=A
//RESVOL    DD DISP=OLD,VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL)
//SYSIN     DD *
  LISTVTOC     VOL=3350=FGEN67
  LISTVTOC     VOL=3350=FGEN67,FORMAT
  LISTCTLG     VOL=3350=FGEN67
/*
//
//*  XXX 2021/03/09 @kl think about whether smp goes here
//
//SMPCDS    DD DSN=SYS1.SMPCDS,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(25,,2000),,CONTIG),
//*            /*FREE TRK=694, DIR=1999*/
//             UNIT=3350,
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//SMPCRQ    DD DSN=SYS1.SMPCRQ,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(5,,350),,CONTIG),
//             UNIT=3350,
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//SMPMTS    DD DSN=SYS1.SMPMTS,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(5,,50),,CONTIG),
//             UNIT=3350,
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//SMPSTS    DD DSN=SYS1.SMPSTS,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(5,,50),,CONTIG),
//             UNIT=3350,
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
//*
//SMPSCDS   DD DSN=SYS1.SMPSCDS,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=6160),
//             SPACE=(CYL,(2,,75),,CONTIG),
//             UNIT=3350,
//             VOL=(PRIVATE,RETAIN,REF=*.VOL.RESVOL),
//             DISP=(NEW,KEEP,DELETE)
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.SMPCDS
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.SMPCRQ
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.SMPMTS
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.SMPSCDS
 CATLG   CVOL=3350=FGEN67,VOL=3350=FGEN67,DSNAME=SYS1.SMPSTS
