//HLOPL1F  JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),REGION=128K
//HELOWRLD EXEC PL1LFCLG
//PL1L.SYSLIN DD UNIT=SYSDA
//PL1L.SYSIN DD *
     HELLO: PROCEDURE OPTIONS(MAIN);   
        PUT FILE(SYSPRINT) LIST('HOLA'); 
     END;                        
//LKED.SYSLIB  DD DSN=SYS1.PL1LIB,DISP=SHR          
//LKED.SYSUT1  DD UNIT=SYSDA,VOL=SER=FGEN67
//LKED.SYSLMOD DD DSNAME=&&GOSET(GO),DISP=(MOD,PASS),
//             UNIT=3350,VOL=SER=FGEN67,
//             SPACE=(TRK,(15,,1),RLSE)
//GO.STEPLIB   DD DSN=SYS1.PL1LIB,DISP=SHR          
//