//HLOASMF JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),REGION=128K
//HELLO   EXEC ASMFCLG
//ASM.SYSUT1 DD VOL=SER=WORK73
//ASM.SYSUT2 DD VOL=SER=WORK73
//ASM.SYSUT3 DD VOL=SER=WORK73
//ASM.SYSGO  DD VOL=SER=WORK73
//*ASM.SYSPUNCH DD UNIT=SYSDA,VOL=SER=WORK73,SPACE=(80,(200,50))
//ASM.SYSIN DD *
HELLO    CSECT
         USING HELLO,15
         SAVE (14,12)
         WTO 'HELLO WORLD VS/ASSEMBLER'
         RETURN (14,12),RC=0
         END
//         
//*LKED.SYSUT1 DD  UNIT=SYSDA,VOL=SER=WORK73
//*GO.OUTPUT   DD  SYSOUT=A
//*GO.SYSPRINT DD  SYSOUT=A
//