//IPASLNK JOB  CLASS=A,MSGLEVEL=(1,1),REGION=512K
//PASLINK EXEC PGM=IEWL,PARM='MAP,NCAL'
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSLMOD  DD  DSN=STANFORD.PASCAL.LOAD,DISP=(NEW,CATLG),
//             UNIT=3350,VOL=SER=FGEN67,
//             SPACE=(TRK,(15,,1),RLSE)
//SYSPRINT DD  SYSOUT=A
//OBJECT   DD  DSN=STANFORD.PASCAL.LIB,DISP=SHR
//SYSLIN   DD  *
  INCLUDE OBJECT(PASMON0,PASOBJ)
  NAME PASCAL
  INCLUDE OBJECT(PASMON0,ASMPOBJ)
  NAME ASMPCODE
  INCLUDE OBJECT(PASMON,PASSNAP)
  LIBRARY ($MAINBLK)
  ALIAS $PASENT
  NAME PASCMON
  INCLUDE OBJECT(PASMON0,PASPROF)
  NAME PASPROF
//
