//SMBAS     JOB   'SAMPLE BASIC 360 2.2',MSGCLASS=A,MSGLEVEL=(1,1) 
//BASIC360 EXEC   PGM=BASIC360 00020000
//STEPLIB DD DSN=SYS2.BASIC360.LOADLIB,DISP=SHR
//        DD DSN=SYS2.BASIC360.PLI,DISP=SHR 
//        DD DSN=SYS1.PL1LIB,DISP=SHR 
//SYSPRINT DD   SYSOUT=A 
//SYSIN DD *
10 REM
20 PRINT "DEMO PROGRAM FOR BASIC/360"
30 REM DEMOS FOR..NEXT, PRINT, AND FUNCTIONS
40 REM
50 FOR I=1 TO 10
60 PRINT I,I*I,SQR(I),ABS(I)
70 NEXT I
80 PRINT
90 REM
100 PRINT
110 LET J=1
120 PRINT J,J*J,SQR(J)
130 LET J=J+1
140 IF J<=10 THEN 120
150 REM
160 END
/*
//