//IPASPR   JOB 'JAY MOSELEY',CLASS=A,MSGCLASS=A
//STEP1   EXEC PGM=IEBUPDTE,REGION=1024K
//*
//* ***************************************************************** *
//* CREATE PASCAL PROCEDURE IN SYS1.PROCLIB                           *
//* ***************************************************************** *
//*
//SYSUT1   DD  DSN=SYS1.PROCLIB,DISP=OLD
//SYSUT2   DD  DSN=SYS1.PROCLIB,DISP=OLD
//SYSPRINT DD  SYSOUT=A
//SYSIN    DD  DATA,DLM='><'
./ ADD NAME=PASCAL,LIST=ALL
./ NUMBER NEW1=01,INCR=05
//PASCAL   PROC GOTIME=10
//*
//*   STEP ONE:  COMPILE THE SOURCE PROGRAM
//*
//COMPILE  EXEC PGM=PASCAL,COND=(0,LT)
//STEPLIB  DD DSN=STANFORD.PASCAL.LOAD,DISP=SHR
//OUTPUT   DD SYSOUT=A
//PRD      DD DSN=STANFORD.PASCAL.LIB(PASMSG),DISP=SHR
//PRR      DD DSN=&&PCODE,UNIT=SYSDA,DCB=RECFM=VB,
//            SPACE=(TRK,(20,5),RLSE),DISP=(,PASS)
//QRR      DD DSN=&&TABLES,UNIT=SYSDA,DCB=RECFM=VB,
//            SPACE=(TRK,(5,2),RLSE),DISP=(,PASS)
//*
//*   STEP TWO:  (POST) PROCESS THE P_CODE
//*
//POSTPROC EXEC PGM=ASMPCODE,COND=(0,LT)
//STEPLIB  DD DSN=STANFORD.PASCAL.LOAD,DISP=SHR
//INPUT    DD DSN=*.COMPILE.PRR,DISP=(OLD,DELETE)
//PRD      DD DSN=*.COMPILE.QRR,DISP=(OLD,PASS)
//OUTPUT   DD SYSOUT=A
//PRR      DD DSN=&&OBJECT,UNIT=SYSDA,DCB=RECFM=FB,
//            SPACE=(TRK,(10,5),RLSE),DISP=(,PASS)
//*
//*    STEP THREE:  LOAD AND GO
//*
//GO       EXEC PGM=LOADER,COND=(0,LT),PARM='//TIME=&GOTIME'
//STEPLIB  DD DSN=STANFORD.PASCAL.LOAD,DISP=SHR  (NEEDED FOR K+ ONLY)
//SYSLIN   DD DSN=*.POSTPROC.PRR,DISP=(OLD,DELETE)
//SYSLOUT  DD SYSOUT=A
//SYSLIB   DD DSN=SYS1.FORTLIB,DISP=SHR
//         DD DSN=STANFORD.PASCAL.LOAD,DISP=SHR
//PRD      DD DUMMY
//QRD      DD DSN=*.COMPILE.QRR,DISP=(OLD,DELETE)
//QRR      DD UNIT=SYSDA,SPACE=(TRK,(2,2))
//FT06F001 DD SYSOUT=A
//OUTPUT   DD SYSOUT=A
./ ENDUP
><
//
