//IPAS     JOB CLASS=A,MSGLEVEL=(1,1)
//* ***************************************************************** *
//* RELOAD PASCAL OBJECT/SOURCE LIBRARIES                             *
//* ***************************************************************** *
//RELOAD  EXEC PGM=IEBCOPY,REGION=1024K
//SYSPRINT DD  SYSOUT=A
//TAPEIN1  DD  DSN=STANFORD.PASCAL.LIB,DISP=(OLD,KEEP),
//             UNIT=TAPE,VOL=(PRIVATE,RETAIN,SER=000901),
//             LABEL=(1,SL)
//TAPEIN2  DD  DSN=STANFORD.PASCAL.TEST.LIB,DISP=(OLD,KEEP),
//             UNIT=AFF=TAPEIN1,VOL=(PRIVATE,RETAIN,SER=000901),
//             LABEL=(2,SL)
//OBJLIB   DD  DSN=STANFORD.PASCAL.LIB,DISP=(NEW,CATLG),
//             UNIT=3350,VOL=SER=FGEN67,SPACE=(TRK,(24,,1)),
//             DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=3120)
//SRCLIB   DD  DSN=STANFORD.PASCAL.TEST.LIB,DISP=(NEW,CATLG),
//             UNIT=3350,VOL=SER=FGEN67,SPACE=(TRK,(117,,2)),
//             DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=3120)
//SYSUT3   DD  UNIT=SYSDA,SPACE=(80,(60,45)),DISP=(NEW,DELETE)
//SYSIN    DD  *
  COPY INDD=TAPEIN1,OUTDD=OBJLIB
  COPY INDD=TAPEIN2,OUTDD=SRCLIB
/*
//
