//SYS3LNK JOB 1,'SOFTWARE',MSGLEVEL=(1,1),CLASS=A,MSGCLASS=A
//S0     EXEC PGM=IEFBR14
//DD1     DD  DSNAME=SYS3.LINKLIB,DISP=(MOD,DELETE),SPACE=(TRK,1),     X
//            UNIT=SYSDA
//DD2     DD  DSNAME=SYS3.JCLLIB,DISP=(MOD,DELETE),SPACE=(TRK,1),      X
//            UNIT=SYSDA
//DD3     DD  DSNAME=SYS3.COPYLIB,DISP=(MOD,DELETE),SPACE=(TRK,1),     X
//            UNIT=SYSDA
//DD4     DD  DSNAME=SYS2.RDRFILE,DISP=(MOD,DELETE),SPACE=(TRK,1),     X
//            UNIT=SYSDA
//S1     EXEC PGM=IEFBR14
//UT1     DD  DSNAME=SYS3.LINKLIB,DISP=(,CATLG,DELETE),                X
//             SPACE=(CYL,(20,1,40)),UNIT=SYSDA,                       X
//             DCB=(DSORG=PO,RECFM=U,BLKSIZE=19069),                   X
//             VOL=SER=PERM73
//UT2     DD  DSNAME=SYS3.JCLLIB,DISP=(,CATLG,DELETE),                 X
//             SPACE=(CYL,(5,1,20)),UNIT=SYSDA,                        X
//             DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=6160),          X
//             VOL=SER=PERM73
//UT3     DD  DSNAME=SYS3.COPYLIB,DISP=(,CATLG,DELETE),                X
//             SPACE=(CYL,(5,1,20)),UNIT=SYSDA,                        X
//             DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=6160),          X
//             VOL=SER=PERM73
//RDR      DD  DSNAME=SYS2.RDRFILE,DISP=(,CATLG,DELETE),               X
//             SPACE=(CYL,(1,1)),UNIT=SYSDA,                           X
//             DCB=(DSORG=PS,RECFM=FB,BLKSIZE=80,LRECL=80),            X
//             VOL=SER=PERM73
//S2      EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=Z
//SYSUT3   DD UNIT=SYSDA,SPACE=(TRK,(90,90))
//SYSUT4   DD UNIT=SYSDA,SPACE=(TRK,(90,90))
//ISYS3LIB DD DISP=(OLD,PASS),DSN=VTPV37.LINKLIB.AWS,                  X
//            LABEL=(1,SL,EXPDT=98000),                                X
//            UNIT=TAPE,VOL=(PRIVATE,RETAIN,SER=000001)
//I3JCLLIB DD DISP=(OLD,PASS),DSN=VTPV37.JCLLIB.AWS,                   X
//            LABEL=(2,SL,EXPDT=98000),                                X
//            UNIT=AFF=ISYS3LIB,VOL=(PRIVATE,RETAIN,SER=000001)
//I3CPYLIB DD DISP=(OLD,KEEP),DSN=VTPV37.COPYLIB.AWS,                  X
//            LABEL=(3,SL,EXPDT=98000),                                X
//            UNIT=AFF=ISYS3LIB,VOL=(PRIVATE,RETAIN,SER=000001)
//OSYS3LIB DD DISP=SHR,UNIT=SYSDA,VOL=SER=PERM73,DSN=SYS3.LINKLIB
//O3JCLLIB DD DISP=SHR,UNIT=SYSDA,VOL=SER=PERM73,DSN=SYS3.JCLLIB
//O3CPYLIB DD DISP=SHR,UNIT=SYSDA,VOL=SER=PERM73,DSN=SYS3.COPYLIB
//SYSIN    DD *
 COPY INDD=ISYS3LIB,OUTDD=OSYS3LIB,LIST=NO
 COPY INDD=I3JCLLIB,OUTDD=O3JCLLIB,LIST=NO
 COPY INDD=I3CPYLIB,OUTDD=O3CPYLIB,LIST=NO
/*
//S2      EXEC PGM=IEBUPDTE,PARM=NEW
//SYSPRINT DD SYSOUT=Z,OUTLIM=0
//SYSUT1   DD DSN=SYS1.MACLIB,DISP=OLD
//SYSUT2   DD DSN=SYS1.MACLIB,DISP=OLD
//SYSIN    DD *
./   ADD NAME=$SBA
         MACRO
&NAME    $SBA
         GBLB  &SET
         GBLC  &SBA(64)
         LCLA  &INDEX1,&INDEX2
         LCLA  &RC
         LCLC  &R,&C,&ATRIB
         LCLC  &SBA1,&SBA2
         AIF   (&SET).GEN
&SBA(01) SETC  '40'
&SBA(02) SETC  'C1'
&SBA(03) SETC  'C2'
&SBA(04) SETC  'C3'
&SBA(05) SETC  'C4'
&SBA(06) SETC  'C5'
&SBA(07) SETC  'C6'
&SBA(08) SETC  'C7'
&SBA(09) SETC  'C8'
&SBA(10) SETC  'C9'
&SBA(11) SETC  '4A'
&SBA(12) SETC  '4B'
&SBA(13) SETC  '4C'
&SBA(14) SETC  '4D'
&SBA(15) SETC  '4E'
&SBA(16) SETC  '4F'
&SBA(17) SETC  '50'
&SBA(18) SETC  'D1'
&SBA(19) SETC  'D2'
&SBA(20) SETC  'D3'
&SBA(21) SETC  'D4'
&SBA(22) SETC  'D5'
&SBA(23) SETC  'D6'
&SBA(24) SETC  'D7'
&SBA(25) SETC  'D8'
&SBA(26) SETC  'D9'
&SBA(27) SETC  '5A'
&SBA(28) SETC  '5B'
&SBA(29) SETC  '5C'
&SBA(30) SETC  '5D'
&SBA(31) SETC  '5E'
&SBA(32) SETC  '5F'
&SBA(33) SETC  '60'
&SBA(34) SETC  '61'
&SBA(35) SETC  'E2'
&SBA(36) SETC  'E3'
&SBA(37) SETC  'E4'
&SBA(38) SETC  'E5'
&SBA(39) SETC  'E6'
&SBA(40) SETC  'E7'
&SBA(41) SETC  'E8'
&SBA(42) SETC  'E9'
&SBA(43) SETC  '6A'
&SBA(44) SETC  '6B'
&SBA(45) SETC  '6C'
&SBA(46) SETC  '6D'
&SBA(47) SETC  '6E'
&SBA(48) SETC  '6F'
&SBA(49) SETC  'F0'
&SBA(50) SETC  'F1'
&SBA(51) SETC  'F2'
&SBA(52) SETC  'F3'
&SBA(53) SETC  'F4'
&SBA(54) SETC  'F5'
&SBA(55) SETC  'F6'
&SBA(56) SETC  'F7'
&SBA(57) SETC  'F8'
&SBA(58) SETC  'F9'
&SBA(59) SETC  '7A'
&SBA(60) SETC  '7B'
&SBA(61) SETC  '7C'
&SBA(62) SETC  '7D'
&SBA(63) SETC  '7E'
&SBA(64) SETC  '7F'
&SET     SETB  (1)
.GEN     ANOP  ,
&R       SETC  '&SYSLIST(1,1)'
&C       SETC  '&SYSLIST(1,2)'
&ATRIB   SETC  '&SYSLIST(1,3)'
&RC      SETA  ((&R-1)*80)+(&C-1)
&INDEX1  SETA  (&RC/64+1)
&SBA1    SETC  '&SBA(&INDEX1)'
&INDEX2  SETA  (&RC-((&INDEX1-1)*64)+1)
&SBA2    SETC  '&SBA(&INDEX2)'
         AIF   ('&ATRIB' EQ 'B').BRIGHT
         AIF   ('&ATRIB' EQ 'N').NORMAL
         AIF   ('&ATRIB' EQ 'U').UNPROT
         AIF   ('&ATRIB' EQ 'UB').UNPBRI
         DC    X'11&SBA1&SBA2'         SIN ATRIBUTO
         MEXIT ,
.NORMAL  ANOP
         DC    X'11&SBA1&SBA2',X'1DF0' START FIELD,PROT SKIP NORMAL
         MEXIT ,
.BRIGHT  ANOP
         DC    X'11&SBA1&SBA2',X'1DF8' START FIELD,PROT SKIP BRIGHT
         MEXIT ,
.UNPROT  ANOP
         DC    X'11&SBA1&SBA2',X'1D40' START FIELD,UNPROT NORMAL
         MEXIT ,
.UNPBRI  ANOP
         DC    X'11&SBA1&SBA2',X'1DC8' START FIELD,UNPROT BRIGHT
         MEXIT ,
         MEND
./   ENDUP
/*
//S3      EXEC PGM=IEBUPDTE,PARM=NEW
//SYSPRINT DD SYSOUT=Z,OUTLIM=0
//SYSUT2   DD DSN=SYS1.PROCLIB,DISP=OLD
//SYSIN    DD DATA,DLM=##
./ ADD NAME=ASML
//ASM    PROC SOUT='A',
//             MAC='SYS1.MACLIB',
//             MBR=NONAME,
//             AC='AC=0',
//             UNT=SYSDA
//ASM     EXEC PGM=IFOX00,PARM=OBJ,REGION=2048K
//SYSLIB   DD  DSN=&MAC,DISP=SHR,DCB=BLKSIZE=32720
//         DD  DSN=SYS1.AMODGEN,DISP=SHR
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=&UNT,SPACE=(CYL,(25,5))
//SYSUT2   DD  DSN=&&SYSUT2,UNIT=&UNT,SPACE=(CYL,(25,5))
//SYSUT3   DD  DSN=&&SYSUT3,UNIT=&UNT,SPACE=(CYL,(25,5))
//SYSTERM  DD  SYSOUT=&SOUT
//SYSPRINT DD  SYSOUT=&SOUT,DCB=BLKSIZE=1089
//SYSPUNCH DD  DUMMY
//SYSGO    DD  DSN=&&OBJSET,UNIT=&UNT,SPACE=(80,(200,50)),             X
//             DISP=(MOD,PASS)
//LKED    EXEC PGM=IEWL,PARM='XREF,LIST,SIZE=(150000,17024),&AC',      X
//           REGION=2048K,COND=(8,LT,ASM)
//SYSLIB   DD  DSN=SYS3.LINKLIB,DISP=SHR
//SYSLIN   DD  DSN=&&OBJSET,DISP=(OLD,DELETE)
//SYSLMOD  DD  DSN=SYS3.LINKLIB(&MBR),DISP=SHR
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=&UNT,SPACE=(1024,(50,20))
//SYSTERM  DD  SYSOUT=&SOUT
//SYSPRINT DD  SYSOUT=&SOUT
./ ADD NAME=COBL
//COBL    PROC MBR=NONAME,PRM=SUPMAP,SOUT=A
//COB     EXEC PGM=IKFCBL00,REGION=150K,                               X
//        PARM='NODECK,LOAD,LIB,SIZE=512K,BUF=124K,&PRM'
//STEPLIB  DD DSN=SYS2.LINKLIB,DISP=SHR
//SYSPRINT DD SYSOUT=&SOUT
//SYSUT1   DD UNIT=SYSDA,SPACE=(460,(700,100))
//SYSUT2   DD UNIT=SYSDA,SPACE=(460,(700,100))
//SYSUT3   DD UNIT=SYSDA,SPACE=(460,(700,100))
//SYSUT4   DD UNIT=SYSDA,SPACE=(460,(700,100))
//SYSLIN   DD DSN=&&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                X
//            SPACE=(80,(500,100))
//SYSLIB   DD DSN=SYS3.COPYLIB,DISP=SHR
//SYSPUNCH DD DUMMY,DCB=BLKSIZE=80
//LKED    EXEC PGM=HEWL,PARM='LIST,XREF,LET,SIZE=(150000,17024)',      X
//         COND=(5,LT,COB),REGION=128K
//SYSLIN   DD DSN=&&LOADSET,DISP=(OLD,DELETE)
//         DD DDNAME=SYSIN
//SYSLMOD  DD DSN=SYS3.LINKLIB(&MBR),DISP=SHR
//SYSLIB   DD DSN=SYS3.LINKLIB,DISP=SHR
//         DD DSN=SYS1.COBLIB,DISP=SHR
//SYSUT1   DD UNIT=SYSDA,SPACE=(1024,(50,20))
//SYSPRINT DD SYSOUT=&SOUT
./ ADD NAME=VAL
//VAL     PROC SOUT='A',                                               X
//             MAC='SYS1.MACLIB',                                      X
//             MBR=NONAME,                                             X
//             UNT=SYSDA
//ASM     EXEC PGM=IFOX00,PARM=DECK,REGION=2048K
//SYSLIB   DD  DSN=&MAC,DISP=SHR,DCB=BLKSIZE=32720
//         DD  DISP=SHR,DSN=SYS1.AMODGEN
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=&UNT,SPACE=(1700,(600,100))
//SYSUT2   DD  DSN=&&SYSUT2,UNIT=&UNT,SPACE=(1700,(300,50))
//SYSUT3   DD  DSN=&&SYSUT3,UNIT=&UNT,SPACE=(1700,(300,50))
//SYSTERM  DD  SYSOUT=&SOUT
//SYSPRINT DD  SYSOUT=&SOUT,DCB=BLKSIZE=1089
//SYSGO    DD  DUMMY
//SYSPUNCH DD  DSN=&&OBJSET,UNIT=&UNT,SPACE=(80,(1200,150)),           X
//             DISP=(MOD,PASS)
//LKED    EXEC PGM=IEWL,PARM=(XREF,LET,LIST),REGION=2048K,             X
//             COND=(8,LT,ASM)
//SYSLIB   DD  DSN=SYS3.LINKLIB,DISP=SHR
//SYSLIN   DD  DSN=&&OBJSET,DISP=(OLD,DELETE)
//SYSLMOD  DD  DSN=SYS3.LINKLIB(&MBR),DISP=SHR
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=&UNT,SPACE=(1024,(50,20))
//SYSTERM  DD  SYSOUT=&SOUT
//SYSPRINT DD  SYSOUT=&SOUT
./ ADD NAME=VCL
//VCL      PROC SOUT='A',
//             MBR=NONAME,
//             UNT=SYSDA,
//             IDX=SYS3,
//             CMDPARM='NOLIST',
//             CBLPARM='SUPMAP'
//CMD     EXEC PGM=VTP$CMDF,PARM='&CMDPARM'
//STEPLIB  DD  DSN=&IDX..LINKLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=&SOUT
//SYSPUNCH DD  UNIT=&UNT,DISP=(,PASS),
//             DCB=BLKSIZE=1600,
//             SPACE=(80,(500,100))
//COB     EXEC PGM=IKFCBL00,
//             REGION=1024K,
//             PARM='NODECK,LOAD,LIB,SIZE=512K,BUF=124K,&CBLPARM'
//STEPLIB  DD  DSN=SYS2.LINKLIB,DISP=SHR
//SYSIN    DD  DISP=(OLD,DELETE),DSN=*.CMD.SYSPUNCH
//SYSPRINT DD  SYSOUT=&SOUT
//SYSLIB   DD  DSN=&IDX..COPYLIB,DISP=SHR
//SYSLIN   DD  DISP=(,PASS),UNIT=&UNT,SPACE=(80,(500,100))
//SYSUT1   DD  UNIT=&UNT,SPACE=(460,(700,100))
//SYSUT2   DD  UNIT=&UNT,SPACE=(460,(700,100))
//SYSUT3   DD  UNIT=&UNT,SPACE=(460,(700,100))
//SYSUT4   DD  UNIT=&UNT,SPACE=(460,(700,100))
//SYSPUNCH DD  DUMMY
//LKED    EXEC PGM=IEWL,
//             COND=(4,LT,COB),
//             PARM='XREF,LIST,LET,MAP',
//             REGION=1024K
//SYSLIN   DD  DISP=(OLD,DELETE),DSN=*.COB.SYSLIN
//SYSLMOD  DD  DSN=&IDX..LINKLIB(&MBR),DISP=SHR
//SYSLIB   DD  DSN=&IDX..LINKLIB,DISP=SHR
//         DD  DISP=SHR,DSN=SYS1.COBLIB
//SYSUT1   DD  UNIT=&UNT,SPACE=(1024,(50,20))
//SYSPRINT DD  SYSOUT=&SOUT
./ ADD NAME=VMAP
//VMAP    PROC SOUT='A',
//             UNT=SYSDA,
//             UPD=IEBUPDTE,
//             LIB='SYS3.COPYLIB'
//MAP     EXEC PGM=VTP$BMS
//STEPLIB  DD  DSN=SYS3.LINKLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=&SOUT
//SYSPUNCH DD  UNIT=&UNT,DISP=(,PASS),
//             DCB=BLKSIZE=1600,
//             SPACE=(80,(500,100))
//UPD     EXEC PGM=&UPD,PARM=NEW,REGION=1024K
//STEPLIB  DD  DSN=SYS3.LINKLIB,DISP=SHR
//SYSIN    DD  DISP=(OLD,DELETE),DSN=*.MAP.SYSPUNCH
//SYSUT2   DD  DSN=&LIB,DISP=SHR
//SYSPRINT DD  SYSOUT=&SOUT
./ ADD NAME=VTP
//VTP     PROC LIDX=SYS3,DIDX=U000
//TP      EXEC PGM=VTP$000,TIME=1440
//STEPLIB  DD  DSN=&LIDX..LINKLIB,DISP=SHR
//STEPCAT  DD  DSN=SYS1.FGEN67.CATALOG,DISP=SHR
//TPFILE00 DD  DSN=&DIDX..TPLOG.FILE,DISP=SHR
//TPFILE01 DD  DSN=U000.SECURITY.FILE,DISP=SHR
//SYSPRINT DD  DSN=&STATS,DISP=(,PASS),UNIT=SYSDA,
//             DCB=BLKSIZE=121,SPACE=(TRK,5)
//TPLIN10  DD  UNIT=0C0
//TPLIN11  DD  UNIT=0C1
//DD1      DD  UNIT=SYSDA,VOL=SER=FGEN67,DISP=OLD
//DD2      DD  UNIT=SYSDA,VOL=SER=PERM73,DISP=OLD
//DD3      DD  UNIT=SYSDA,VOL=SER=FDLB67,DISP=OLD
//DD4      DD  UNIT=SYSDA,VOL=SER=WORK61,DISP=OLD
//DD5      DD  UNIT=SYSDA,VOL=SER=DLIBA1,DISP=OLD
//*
//* YOU CAN ADD ADDITIONAL VOLUMN USING DD6-DD18
//*
//SYSUDUMP DD  SYSOUT=A
//SYSLIST  DD  SYSOUT=A
//SYSTATS  DD  SYSOUT=A
//SYSUDUMP DD  SYSOUT=A
//JCL      DD  DSN=SYS2.RDRFILE,DISP=SHR
//CL      EXEC PGM=IEFBR14
//CLDD     DD  DSN=&STATS,DISP=(OLD,DELETE,DELETE)
./ ADD NAME=VTPUTIL
//UTL     EXEC PGM=VTPUTIL
//STEPLIB  DD  DSN=SYS3.LINKLIB,DISP=SHR
//FILE00   DD  DSN=U000.TPLOG.FILE,DISP=SHR
//TPTS00   DD  DSN=U000.TEMP.STORE.FILE,DISP=SHR
//SYSOUT   DD  SYSOUT=A
//SYSPRINT DD  SYSOUT=A
./ ENDUP
/*
##
