//HLOASMF JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),REGION=128K
//HELLO   EXEC ASMFCLG
//ASM.SYSUT1 DD UNIT=SYSDA
//ASM.SYSUT2 DD UNIT=SYSDA
//ASM.SYSUT3 DD UNIT=SYSDA
//ASM.SYSIN DD *
HELLO    CSECT
         USING HELLO,15
         SAVE (14,12)
         WTO 'HELLO WORLD ASSEMBLER-F'
         RETURN (14,12),RC=0
         END
//LKED.SYSUT1 DD  UNIT=SYSDA
//GO.OUTPUT   DD  SYSOUT=A
//GO.SYSPRINT DD  SYSOUT=A
//