//HLOFORT  JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//FORTH    EXEC FORTHCLG,REGION.FORT=256K
//FORT.SYSLIN DD UNIT=SYSDA
//FORT.SYSABEND DD SYSOUT=A
//FORT.SYSIN DD *
C HELLO WORLD, WE HOPE
      WRITE(6,10)
   10 FORMAT(22H HELLO WORLD FORTRAN H)
      STOP
      END
/*
//
