//SYSGEN JOB  1,'SYSTEM GENERATION'
//SG1 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IGF201)
//SYSIN DD *
         PRINT ON,NODATA
 IORMSCOM 1,1,0,0,250,SECT=C
     END
/*
//SG2 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQGM01)
//SYSIN DD *
         PRINT ON,NODATA
         IEAQGM N,N,N,0,1
         END
/*
//SG3 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQPRT0)
//SYSIN DD *
         PRINT ON,NODATA
         IEAQPR N,N,N
         END
/*
//SG4 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAATR00)
//SYSIN DD *
         PRINT ON,NODATA
         IEAQTR 100,0
         END
/*
//SG5 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEFQMSGV)
//SYSIN DD *
         PRINT ON,NODATA
 SGIEF0QM 12,60,60,2,50
 END
/*
//SG6 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQAT00)
//SYSIN DD *
     PRINT  ON,NODATA
 IEAQAT NOSLICE,4,TTIME,FPREGS,1
    END
/*
//SG7 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQCH00)
//SYSIN DD *
     PRINT  ON,NODATA
 IEAQCH NOSLICE,4,1
    END
/*
//SG8 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQET00)
//SYSIN DD *
     PRINT  ON,NODATA
 IEAQET NOSLICE,1
         END
/*
//SG9 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQBK00)
//SYSIN DD *
         PRINT ON,NODATA
        IEAQBK 5,QTAM,                                        XXXXXXXXXXXXXXX
               ,                                              XXXXXXXXXX
               (0,0,                                            XXXXXXXX
               0,0,                                             XXXXXXXX
               0,0,                                             XXXXXXXX
               0,0,                                             XXXXXXXX
               0,0,                                             XXXXXXXX
               0,0,                                             XXXXXXXX
               0,0,                                             XXXXXXXX
               0),0,         MP65                               XXXXXXXX
               1,                      19022                    XXXXXXXXX
               FLAG=226,FLAGB=0,           20071                  XXXXXXXXXX
               PATCH=YES,RPS=YES,WARN=0
         END
/*
//SG10 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IGC018)
//SYSIN DD *
         PRINT ON,NODATA
 SGIEC0DT NO,YES,0,TYPE=(1,0,0,0,0,0,0,0,1)
         END
/*
//SG11 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEEVIPL)
//SYSIN DD *
         PRINT ON,NODATA
 SGIEE00V 00C,,,00E,,,INIT,,,L,10,0,1,100
 END
/*
//SG12 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEE3203D)
//SYSIN DD *
         PRINT ON,NODATA
 SGIEE0VR 1,0,0,1,0
 END
/*
//SG13 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEECVUCM)
//SYSIN DD *
         PRINT ON,NODATA
IEEUCMC CSECT
 IEECUCM (01F,01F),(01,01),(WAXA,WAXN),U,REPLY=20,BUFFERS=100
         END
/*
//SG14 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEACVTPC)
//SYSIN DD *
         PRINT ON,NODATA
 IEACVTPC   I,02,46,C,0,1,0
 END
/*
//SG15 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IFBCTA00)
//SYSIN DD *
         PRINT ON,NODATA
 SGIFC000 1220000000000000
 END
/*
//SG16 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEFSGOPT)
//SYSIN DD *
         PRINT ON,NODATA
    SGIEF002  0,0,0,0,0,0,0,0,0,0,0,                                   X
               0,0,1,0,1,0,0,0,0,0,2
    END
/*
//SG17 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEFYRCDS)
//SYSIN DD *
         PRINT ON,NODATA
 SGIEF060 NE=(0000000000000000000,                                     X
               000000000000000000,                             XXXXXXXXXXXXXXXX
               00000000000)                                           X
    END
/*
//SG18 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(UCSIMAGE)
//SYSIN DD *
         PRINT ON,NODATA
 SGIEC0UC  (AN,D,                                          XXXXXXXXXXXXXXXXX
               PN,D,                                        XXXXXXXXXXXXXXXX
               TN,D)
         END
/*
//SG19 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEWLM128)
//SYSIN DD *
         PRINT ON,NODATA
 TITLE 'IEWLMDEF   F128  EDITOR DEFAULT SIZE PARAMETERS '
         SGIEW001  VAL1=131072,VAL2=18432,DPVAL=131072
         IHBRELNO
         END
/*
//SG20 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEK201)
//SYSIN DD *
         PRINT ON,NODATA
         SGIEK001   OPTN=0,MAP=0,TYPE=1,PNCH=0,OBLST=0,CODE=0,         *
               SRLST=1,LINCNT=50,SZE=204800,ID=0,EDIT=0,XREF=0
         END
/*
//SG21 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEY201)
//SYSIN DD *
         PRINT ON,NODATA
         SGIEY001   50,0,1,0,0,0,1,0
         END
/*
//SG22 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEK205)
//SYSIN DD *
         PRINT ON,NODATA
         SGIEK005   8,6,5,6,7,6,5,7
         END
/*
//SG23 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEK206)
//SYSIN DD *
         PRINT ON,NODATA
    SGIEK006  0,0,1
    END
/*
//SG24 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEPCBL00)
//SYSIN DD *
         PRINT ON,NODATA
 SGIEP000 0,0,0,0,60,176,0
 END
/*
//SG25 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IKFCBL01)
//SYSIN DD *
         PRINT ON,NODATA
 SGIKF000 1,0,1,1,1,1,00,                                              X
               60,2768,81920,1,0,0,0,0,0,0,1
 END
/*
//SG26 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEXCWKA)
//SYSIN DD *
         PRINT ON,NODATA
 SGIEX001 0,0,0,0,0,45056
 END
/*
//SG27 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEMAF)
//SYSIN DD *
         PRINT ON,NODATA
AF       TITLE 'OS 360 PL/I(F) COMPILER , IEMAF'
IEMAF    CSECT
*                  DEFAULT BITS
         DC    B'01011001'
         DC    B'01100011'
         DC    B'00110100'
         DC    B'10000011'
         DC    B'00101011'
         DC    B'00101010'
         DC    B'00000100'
         DC    B'00000000'
         DC    B'00000000'
         DC    B'00000000'
         DC    B'00000000'
         DC    B'00000000'
         DC    B'00000000'
         DC    B'00000000'
         DC    F'50'
         DC    F'999999'
         DC    F'2'
         DC    F'72'
         DC    F'0'
         DC    F'0'
         DC    F'0'
         END   IEMAF
/*
//SG28 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IERAM1)
//SYSIN DD *
         PRINT ON,NODATA
 SGIER001 65536,0
 END
/*
//SG29 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEWLDDEF)
//SYSIN DD *
         PRINT ON,NODATA
         SGIEW050 FLAG=(1,0,1,0,0),SIZE=102400,                      XXXXXXXX
               LIN=SYSLIN,PRINT=SYSLOUT,LIB=SYSLIB
         END
/*
//SG30 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEASVC00)
//SYSIN DD *
         PRINT ON,NODATA
 ENTRY USERORG
IBMORG   CSECT
 DC X'00',VL3(IGC000),X'00',VL3(IGC001),X'00',VL3(IGC002)
 DC X'00',VL3(IGC003),X'00',VL3(IGC004),X'00',VL3(IGC005)
 DC X'80',VL3(IGC006),X'80',VL3(IGC007),X'80',VL3(IGC008)
 DC X'80',VL3(IGC009),X'00',VL3(IGC010),X'00',VL3(IGC011)
 DC X'80',VL3(IGC012),X'C0',AL3(0),X'80',VL3(IGC014)
 DC X'00',VL3(IGC015),X'80',VL3(IGC016),X'C0',AL3(0)
 DC X'80',VL3(IGC018),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'80',VL3(IGC037),X'00',VL3(IGCERROR)
 DC X'C0',AL3(0),X'00',VL3(IGC040),X'80',VL3(IGC041)
 DC X'80',VL3(IGC042),X'80',VL3(IGC043),X'00',VL3(IGC044)
 DC X'80',VL3(IGC045),X'00',VL3(IGC046),X'80',VL3(IGC047)
 DC X'80',VL3(IGC048),X'00',VL3(IGCERROR),X'00',AL3(IGCRETRN)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'80',VL3(IGC054),X'C0',AL3(0),X'80',VL3(IGC056)
 DC X'C0',AL3(0),X'00',VL3(IGCERROR),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'80',VL3(IGC062)
 DC X'C0',AL3(0),X'C0',AL3(0),X'80',VL3(IGC065)
 DC X'00',VL3(IGCERROR),X'80',VL3(IGC067),X'C0',AL3(0)
 DC X'C0',AL3(0),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'C0',AL3(0),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'00',VL3(IGC079),X'00',VL3(IGCERROR)
 DC X'C0',AL3(0),X'C0',AL3(0),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'C0',AL3(0),X'C0',AL3(0)
 DC X'00',AL3(IGCRETRN),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'C0',AL3(0),X'C0',AL3(0),X'00',VL3(IGC092)
 DC X'C0',AL3(0),X'C0',AL3(0),X'00',AL3(IGCRETRN)
 DC X'C0',AL3(0),X'C0',AL3(0),X'C0',AL3(0)
 DC X'C0',AL3(0),X'C0',AL3(0),X'00',AL3(IGCRETRN)
 DC X'00',VL3(IGC102),X'80',VL3(IGC103),X'C0',AL3(0)
 DC X'C0',AL3(0),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'80',VL3(IGC109),X'C0',AL3(0)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGCERROR)
 DC X'00',VL3(IGCERROR),X'00',VL3(IGCERROR),X'00',VL3(IGC116)
 DC X'80',VL3(IGC117)
USERORG  DS    0F
IGCRETRN SR    15,15
         BR    14
         END
/*
//SG31 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAQNU00)
//SYSIN DD *
     PRINT  ON,NODATA
 IEAQNU  JSTIME,50,SERP,117,256,TRACE,0,                              XXXXXXXXX
               0,0,0,0,EMUN,0,0,1,0
         END
/*
//SG32 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAANIP0)
//SYSIN DD *
         PRINT ON,NODATA
IEAANIP0  START
 IEAANIP 1,1,4,1,117,256,0,1,0,0,                                   XXXXXXX
               0,01F01F,01F01F,0,                             *****************
               0,                                         *****************
               100,                                         *****************
               20,                                         *****************
               62,                                         *****************
               10,                                         *****************
               100000,                                            *************
               0,                                        *****************
               0,                                        *****************
               0,                                        *****************
               0,                                         *****************
               1,                                        *****************
               0,                                        *****************
               500000000000,                                           *********
               000000000000,                                           *********
               020000000000,                                           *********
               0,                                           **************
               ,                                          **************
               ,                                          **************
               0,                                          **************
               0,                                            *************
               0,                                          **************
               ,                                              **************
               1,                                          **************
               0,                                          **************
               0,                                        *****************
               0,                                        *****************
               0,                                        *****************
               0050,                                                   *
               0,                                                      *
               0,                                                      *
               1,                                                      *
               24,                                               ********
               0,                           BH 61205        ************
               1,                                                      *
               0
         END
/*
//SG33 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEAASU00)
//SYSIN DD *
         PRINT ON,NODATA
 IEAQFX 50,SERP,0,0,GENCODE=YES
         AGO   .GBL      SET UP GLOBALS
.IOSTART ENTRY IECIOS
IECIOS  DS  0D
         AGO   .IECIOS     TO ASSEMBLE MAINLINE IOS
.RQE      ANOP         RQE AND STST TAB
 IECIOQE 40,1,1,0
          AGO   .IOSB
.TAB1   ANOP         LOOK UP UCB TAB
UCBTAB   DS    0C         THIS IS THE LOOK UP TAB
IECILK1  DS    0C
 IECULK1 8,0,0,0,0,0,0
         AGO   .TAB2     TO NEXT CHANNEL ENTRY
.TCU1   IECULK2 24,0,0,8,1,0,1
         AGO   .TCU2       TO NEXT ENTRY
.LST1 ANOP   UCB LOOKUP ENTRY
LIST     DS    0H       THIS IS THE LIST OF UCB ADDS
IECILK2  DS    0C
         AGO   .LST2
.LST2 IECULK3 0,12,1,1,24,0,0,0,0,1
         AGO   .LST3    TO NEXT UCB ADD RNTRY
.UCB1 ANOP
  IECIUCB 1,00C,UR,0,0D,1,0,,10000801,0,0,0,0,,64,0,0,00C,0
         AGO   .UCB2      TO NEXT UCB
.LST3 IECULK3 12,13,2,0,0,0,0,0,0,1
         AGO   .LST4    TO NEXT UCB ADD RNTRY
.UCB2 ANOP
  IECIUCB 2,00D,UR,0,0D,2,0,,10000802,0,0,0,0,,64,0,0,00D,0
         AGO   .UCB3      TO NEXT UCB
.LST4 IECULK3 13,14,3,0,0,0,0,0,0,1
         AGO   .LST5    TO NEXT UCB ADD RNTRY
.UCB3 ANOP
  IECIUCB 3,00E,UR,0,07,3,0,,10800808,8,0,0,0,,64,0,0,00E,0
         AGO   .UCB4      TO NEXT UCB
.WK1 IECIUCBA 3,10800808,0,0,64,005,005,0
         AGO   .WK2   TO NEXT WORK AREA
.TCU2   IECULK2 0,0,1,8,0,0,0
         AGO   .TCU3       TO NEXT ENTRY
.LST5 IECULK3 14,15,4,1,0,0,0,0,0,0
         AGO   .LST6    TO NEXT UCB ADD RNTRY
.UCB4 ANOP
  IECIUCB 4,01F,UR,0,04,4,0,,10000820,0,2,0,0,,64,0,0,01F,0
         AGO   .UCB5      TO NEXT UCB
.WK2 IECIUCBA 4,10000820,0,0,64,005,005,0
         AGO   .WK3   TO NEXT WORK AREA
.TCU3   IECULK2 32,1,3,8,0,0,0
         AGO   .TCU4       TO NEXT ENTRY
.LST6 IECULK3 15,0,5,1,32,0,0,0,0,0
         AGO   .LST7    TO NEXT UCB ADD RNTRY
.UCB5   ANOP       UCB ENTRY
 IECIUCB 5,030,TP,8,29,5,0,1,51104013,0,0,0,0
         AGO   .UCB6      TO NEXT UCB
.LST7 IECULK3 0,1,6,0,32,0,0,0,0,0
         AGO   .LST8    TO NEXT UCB ADD RNTRY
.UCB6   ANOP       UCB ENTRY
 IECIUCB 6,031,TP,8,29,6,0,2,51104013,0,0,0,0
         AGO   .UCB7      TO NEXT UCB
.LST8 IECULK3 1,2,7,0,32,0,0,0,0,0
         AGO   .LST9    TO NEXT UCB ADD RNTRY
.UCB7   ANOP       UCB ENTRY
 IECIUCB 7,032,TP,8,29,7,0,3,51104013,0,0,0,0
         AGO   .UCB8      TO NEXT UCB
.LST9 IECULK3 2,3,8,0,32,0,0,0,0,0
         AGO   .LST10    TO NEXT UCB ADD RNTRY
.UCB8   ANOP       UCB ENTRY
 IECIUCB 8,033,TP,8,29,8,0,4,51104013,0,0,0,0
         AGO   .UCB9      TO NEXT UCB
.LST10 IECULK3 3,4,9,0,32,0,0,0,0,0
         AGO   .LST11    TO NEXT UCB ADD RNTRY
.UCB9   ANOP       UCB ENTRY
 IECIUCB 9,034,TP,8,29,9,0,5,51104013,0,0,0,0
         AGO   .UCB10      TO NEXT UCB
.LST11 IECULK3 4,5,10,0,32,0,0,0,0,0
         AGO   .LST12    TO NEXT UCB ADD RNTRY
.UCB10   ANOP       UCB ENTRY
 IECIUCB 10,035,TP,8,29,10,0,6,51104013,0,0,0,0
         AGO   .UCB11      TO NEXT UCB
.LST12 IECULK3 5,6,11,0,32,0,0,0,0,0
         AGO   .LST13    TO NEXT UCB ADD RNTRY
.UCB11   ANOP       UCB ENTRY
 IECIUCB 11,036,TP,8,29,11,0,7,51104013,0,0,0,0
         AGO   .UCB12      TO NEXT UCB
.LST13 IECULK3 6,7,12,0,32,0,0,0,0,0
         AGO   .LST14    TO NEXT UCB ADD RNTRY
.UCB12   ANOP       UCB ENTRY
 IECIUCB 12,037,TP,8,29,12,0,8,51104013,0,0,0,0
         AGO   .UCB13      TO NEXT UCB
.LST14 IECULK3 7,8,13,0,32,0,0,0,0,0
         AGO   .LST15    TO NEXT UCB ADD RNTRY
.UCB13   ANOP       UCB ENTRY
 IECIUCB 13,038,TP,8,29,13,0,9,51104013,0,0,0,0
         AGO   .UCB14      TO NEXT UCB
.LST15 IECULK3 8,9,14,0,32,0,0,0,0,0
         AGO   .LST16    TO NEXT UCB ADD RNTRY
.UCB14   ANOP       UCB ENTRY
 IECIUCB 14,039,TP,8,29,14,0,10,51104013,0,0,0,0
         AGO   .UCB15      TO NEXT UCB
.LST16 IECULK3 9,10,15,0,32,0,0,0,0,0
         AGO   .LST17    TO NEXT UCB ADD RNTRY
.UCB15   ANOP       UCB ENTRY
 IECIUCB 15,03A,TP,8,29,15,0,11,51104013,0,0,0,0
         AGO   .UCB16      TO NEXT UCB
.LST17 IECULK3 10,11,16,0,32,0,0,0,0,0
         AGO   .LST18    TO NEXT UCB ADD RNTRY
.UCB16   ANOP       UCB ENTRY
 IECIUCB 16,03B,TP,8,29,16,0,12,51104013,0,0,0,0
         AGO   .UCB17      TO NEXT UCB
.LST18 IECULK3 11,12,17,0,32,0,0,0,0,0
         AGO   .LST19    TO NEXT UCB ADD RNTRY
.UCB17   ANOP       UCB ENTRY
 IECIUCB 17,03C,TP,8,29,17,0,13,51104013,0,0,0,0
         AGO   .UCB18      TO NEXT UCB
.LST19 IECULK3 12,13,18,0,32,0,0,0,0,0
         AGO   .LST20    TO NEXT UCB ADD RNTRY
.UCB18   ANOP       UCB ENTRY
 IECIUCB 18,03D,TP,8,29,18,0,14,51104013,0,0,0,0
         AGO   .UCB19      TO NEXT UCB
.LST20 IECULK3 13,14,19,0,32,0,0,0,0,0
         AGO   .LST21    TO NEXT UCB ADD RNTRY
.UCB19   ANOP       UCB ENTRY
 IECIUCB 19,03E,TP,8,29,19,0,15,51104013,0,0,0,0
         AGO   .UCB20      TO NEXT UCB
.LST21 IECULK3 14,15,20,0,32,0,0,0,0,0
         AGO   .LST22    TO NEXT UCB ADD RNTRY
.UCB20   ANOP       UCB ENTRY
 IECIUCB 20,03F,TP,8,29,20,0,16,51104013,0,0,0,0
         AGO   .UCB21      TO NEXT UCB
.SRCH1  ANOP         CHAN SEARCH FOR MPX
    IECICS 0,0,0,,0,0,0,0,0,(0,0,0,0)
         AGO   .SRCH2     TO NEXT SEARCH
.TCH1   ANOP       TCH FOR MPX
         IECXTCH 1,0,0,,0,0,1,0,0,0
         AGO   .TCH2     TO NEXT TXH
.TAB2   ANOP         LOOK UP UCB TAB
 IECULK1 7,0,1,0,0,1,0
         AGO   .TAB3     TO NEXT CHANNEL ENTRY
.TCU4   IECULK2 64,3,5,7,1,0,0
         AGO   .TCU5       TO NEXT ENTRY
.LST22 IECULK3 15,0,21,1,64,0,1,0,1,0
         AGO   .LST23    TO NEXT UCB ADD RNTRY
.UCB21 ANOP
  IECIUCB 21,150,ML,16,01,21,1,,30502009,8,0,0,0,,64,0,0,150,0
         AGO   .UCB22      TO NEXT UCB
.WK3 IECIUCBA 21,30502009,0,0,64,005,005,0
         AGO   .WK4   TO NEXT WORK AREA
.LST23 IECULK3 0,1,22,0,64,0,1,0,1,0
         AGO   .LST24    TO NEXT UCB ADD RNTRY
.UCB22 ANOP
  IECIUCB 22,151,ML,16,01,21,1,,30502009,8,0,0,0,,64,0,0,151,0
         AGO   .UCB23      TO NEXT UCB
.WK4 IECIUCBA 22,30502009,0,0,64,005,005,0
         AGO   .WK5   TO NEXT WORK AREA
.LST24 IECULK3 1,2,23,0,64,0,1,0,1,0
         AGO   .LST25    TO NEXT UCB ADD RNTRY
.UCB23 ANOP
  IECIUCB 23,152,ML,16,01,21,1,,30502009,8,0,0,0,,64,0,0,152,0
         AGO   .UCB24      TO NEXT UCB
.WK5 IECIUCBA 23,30502009,0,0,64,005,005,0
         AGO   .WK6   TO NEXT WORK AREA
.LST25 IECULK3 2,3,24,0,64,0,1,0,1,0
         AGO   .LST26    TO NEXT UCB ADD RNTRY
.UCB24 ANOP
  IECIUCB 24,153,ML,16,01,21,1,,30502009,8,0,0,0,,64,0,0,153,0
         AGO   .UCB25      TO NEXT UCB
.WK6 IECIUCBA 24,30502009,0,0,64,005,005,0
         AGO   .WK7   TO NEXT WORK AREA
.LST26 IECULK3 3,4,25,0,64,0,1,0,1,0
         AGO   .LST27    TO NEXT UCB ADD RNTRY
.UCB25 ANOP
  IECIUCB 25,154,ML,16,01,21,1,,30502009,8,0,0,0,,64,0,0,154,0
         AGO   .UCB26      TO NEXT UCB
.WK7 IECIUCBA 25,30502009,0,0,64,005,005,0
         AGO   .WK8   TO NEXT WORK AREA
.LST27 IECULK3 4,5,26,0,64,0,1,0,1,0
         AGO   .LST28    TO NEXT UCB ADD RNTRY
.UCB26 ANOP
  IECIUCB 26,155,ML,16,01,21,1,,30502009,8,0,0,0,,64,0,0,155,0
         AGO   .UCB27      TO NEXT UCB
.WK8 IECIUCBA 26,30502009,0,0,64,005,005,0
         AGO   .WK9   TO NEXT WORK AREA
.LST28 IECULK3 5,6,27,0,64,0,1,0,1,0
         AGO   .LST29    TO NEXT UCB ADD RNTRY
.UCB27 ANOP
  IECIUCB 27,156,ML,16,01,21,1,,30502009,8,0,0,0,,64,0,0,156,0
         AGO   .UCB28      TO NEXT UCB
.WK9 IECIUCBA 27,30502009,0,0,64,005,005,0
         AGO   .WK10   TO NEXT WORK AREA
.LST29 IECULK3 6,7,28,0,64,0,1,0,1,0
         AGO   .LST30    TO NEXT UCB ADD RNTRY
.UCB28 ANOP
  IECIUCB 28,157,ML,16,01,21,1,,30502009,8,0,0,0,,64,0,0,157,0
         AGO   .UCB29      TO NEXT UCB
.WK10 IECIUCBA 28,30502009,0,0,64,005,005,0
         AGO   .WK11   TO NEXT WORK AREA
.TCU5   IECULK2 80,5,8,7,0,0,0
         AGO   .TCU6       TO NEXT ENTRY
.LST30 IECULK3 7,0,29,1,80,0,1,0,0,0
         AGO   .LST31    TO NEXT UCB ADD RNTRY
.UCB29 ANOP
  IECIUCB 29,180,AT,24,09,22,1,,34008003,24,0,0,0,,64,0,0,180,0
         AGO   .UCB30      TO NEXT UCB
.WK11 IECIUCBA 29,34008003,0,0,64,005,005,0
         AGO   .WK12   TO NEXT WORK AREA
.LST31 IECULK3 0,1,30,0,80,0,1,1,0,0
         AGO   .LST32    TO NEXT UCB ADD RNTRY
.UCB30 ANOP
  IECIUCB 30,181,AT,24,09,24,1,,34008003,24,0,0,0,,64,0,0,181,0
         AGO   .UCB31      TO NEXT UCB
.WK12 IECIUCBA 30,34008003,0,0,64,005,005,0
         AGO   .WK13   TO NEXT WORK AREA
.LST32 IECULK3 1,2,31,0,80,0,1,2,0,0
         AGO   .LST33    TO NEXT UCB ADD RNTRY
.UCB31 ANOP
  IECIUCB 31,182,AT,24,09,26,1,,34008003,24,0,0,0,,64,0,0,182,0
         AGO   .UCB32      TO NEXT UCB
.WK13 IECIUCBA 31,34008003,0,0,64,005,005,0
         AGO   .WK14   TO NEXT WORK AREA
.LST33 IECULK3 2,3,32,0,80,0,1,3,0,0
         AGO   .LST34    TO NEXT UCB ADD RNTRY
.UCB32 ANOP
  IECIUCB 32,183,AT,24,09,28,1,,34008003,24,0,0,0,,64,0,0,183,0
         AGO   .UCB33      TO NEXT UCB
.WK14 IECIUCBA 32,34008003,0,0,64,005,005,0
         AGO   .WK15   TO NEXT WORK AREA
.TCU6   IECULK2 88,8,9,7,0,0,0
         AGO   .TCU7       TO NEXT ENTRY
.LST34 IECULK3 3,0,33,1,88,0,1,4,1,0
         AGO   .LST35    TO NEXT UCB ADD RNTRY
.UCB33 ANOP
  IECIUCB 33,190,DA,32,01,30,1,,30002001,0,0,0,0,,64,0,0,190,0
         AGO   .UCB34      TO NEXT UCB
.WK15 IECIUCBA 33,30002001,0,0,64,005,005,0
         AGO   .WK16   TO NEXT WORK AREA
.LST35 IECULK3 0,1,34,0,88,0,1,5,1,0
         AGO   .LST36    TO NEXT UCB ADD RNTRY
.UCB34 ANOP
  IECIUCB 34,191,DA,32,01,31,1,,30002001,0,0,0,0,,64,0,0,191,0
         AGO   .UCB35      TO NEXT UCB
.WK16 IECIUCBA 34,30002001,0,0,64,005,005,0
         AGO   .WK17   TO NEXT WORK AREA
.LST36 IECULK3 1,2,35,0,88,0,1,6,1,0
         AGO   .LST37    TO NEXT UCB ADD RNTRY
.UCB35 ANOP
  IECIUCB 35,192,DA,32,01,32,1,,30002001,0,0,0,0,,64,0,0,192,0
         AGO   .UCB36      TO NEXT UCB
.WK17 IECIUCBA 35,30002001,0,0,64,005,005,0
         AGO   .WK18   TO NEXT WORK AREA
.LST37 IECULK3 2,3,36,0,88,0,1,7,1,0
         AGO   .LST38    TO NEXT UCB ADD RNTRY
.UCB36 ANOP
  IECIUCB 36,193,DA,32,01,33,1,,30002001,0,0,0,0,,64,0,0,193,0
         AGO   .UCB37      TO NEXT UCB
.WK18 IECIUCBA 36,30002001,0,0,64,005,005,0
         AGO   .WK19   TO NEXT WORK AREA
.TCH2    ANOP   TEST CHANNEL
    IECXTCH 2,1,(1,0,0,0,0,                                           *****
               0),(0,0,0,0),0,0,1,0,0,0
         AGO   .TCH3      TO NEXT TCH MOD
.SRCH2  ANOP       CHANNEL SEARCH MOD2
               IECICS 1,8,0,                                 ************
               (1,                            I267                 ********
               1,1,         I267                                       *
               0),0,0,0,0,0,(0,0,0,0),0
         AGO   .SRCH3     TO NEXT CHAN SRCH MOD
.TAB3   ANOP         LOOK UP UCB TAB
 IECULK1 12,1,2,0,0,1,0
         AGO   .TAB4     TO NEXT CHANNEL ENTRY
.TCU7   IECULK2 96,9,5,12,1,0,0
         AGO   .TCU8       TO NEXT ENTRY
.LST38 IECULK3 3,0,37,1,96,0,2,0,1,0
         AGO   .LST39    TO NEXT UCB ADD RNTRY
.UCB37 ANOP
  IECIUCB 37,250,ML,16,01,34,2,,30502009,8,0,0,0,,64,0,0,250,0
         AGO   .UCB38      TO NEXT UCB
.WK19 IECIUCBA 37,30502009,0,0,64,005,005,0
         AGO   .WK20   TO NEXT WORK AREA
.LST39 IECULK3 0,1,38,0,96,0,2,0,1,0
         AGO   .LST40    TO NEXT UCB ADD RNTRY
.UCB38 ANOP
  IECIUCB 38,251,ML,16,01,34,2,,30502009,8,0,0,0,,64,0,0,251,0
         AGO   .UCB39      TO NEXT UCB
.WK20 IECIUCBA 38,30502009,0,0,64,005,005,0
         AGO   .WK21   TO NEXT WORK AREA
.LST40 IECULK3 1,2,39,0,96,0,2,0,1,0
         AGO   .LST41    TO NEXT UCB ADD RNTRY
.UCB39 ANOP
  IECIUCB 39,252,ML,16,01,34,2,,30502009,8,0,0,0,,64,0,0,252,0
         AGO   .UCB40      TO NEXT UCB
.WK21 IECIUCBA 39,30502009,0,0,64,005,005,0
         AGO   .WK22   TO NEXT WORK AREA
.LST41 IECULK3 2,3,40,0,96,0,2,0,1,0
         AGO   .LST42    TO NEXT UCB ADD RNTRY
.UCB40 ANOP
  IECIUCB 40,253,ML,16,01,34,2,,30502009,8,0,0,0,,64,0,0,253,0
         AGO   .UCB41      TO NEXT UCB
.WK22 IECIUCBA 40,30502009,0,0,64,005,005,0
         AGO   .WK23   TO NEXT WORK AREA
.LST42 IECULK3 3,4,41,0,96,0,2,0,1,0
         AGO   .LST43    TO NEXT UCB ADD RNTRY
.UCB41 ANOP
  IECIUCB 41,254,ML,16,01,34,2,,30502009,8,0,0,0,,64,0,0,254,0
         AGO   .UCB42      TO NEXT UCB
.WK23 IECIUCBA 41,30502009,0,0,64,005,005,0
         AGO   .WK24   TO NEXT WORK AREA
.LST43 IECULK3 4,5,42,0,96,0,2,0,1,0
         AGO   .LST44    TO NEXT UCB ADD RNTRY
.UCB42 ANOP
  IECIUCB 42,255,ML,16,01,34,2,,30502009,8,0,0,0,,64,0,0,255,0
         AGO   .UCB43      TO NEXT UCB
.WK24 IECIUCBA 42,30502009,0,0,64,005,005,0
         AGO   .WK25   TO NEXT WORK AREA
.LST44 IECULK3 5,6,43,0,96,0,2,0,1,0
         AGO   .LST45    TO NEXT UCB ADD RNTRY
.UCB43 ANOP
  IECIUCB 43,256,ML,16,01,34,2,,30502009,8,0,0,0,,64,0,0,256,0
         AGO   .UCB44      TO NEXT UCB
.WK25 IECIUCBA 43,30502009,0,0,64,005,005,0
         AGO   .WK26   TO NEXT WORK AREA
.LST45 IECULK3 6,7,44,0,96,0,2,0,1,0
         AGO   .LST46    TO NEXT UCB ADD RNTRY
.UCB44 ANOP
  IECIUCB 44,257,ML,16,01,34,2,,30502009,8,0,0,0,,64,0,0,257,0
         AGO   .UCB45      TO NEXT UCB
.WK26 IECIUCBA 44,30502009,0,0,64,005,005,0
         AGO   .WK27   TO NEXT WORK AREA
.TCU8   IECULK2 112,5,9,12,0,0,0
         AGO   .TCU9       TO NEXT ENTRY
.LST46 IECULK3 7,0,45,1,112,0,2,0,1,0
         AGO   .LST47    TO NEXT UCB ADD RNTRY
.UCB45 ANOP
  IECIUCB 45,290,DA,32,01,35,2,,30002001,0,0,0,0,,64,0,0,290,0
         AGO   .UCB46      TO NEXT UCB
.WK27 IECIUCBA 45,30002001,0,0,64,005,005,0
         AGO   .WK28   TO NEXT WORK AREA
.LST47 IECULK3 0,1,46,0,112,0,2,1,1,0
         AGO   .LST48    TO NEXT UCB ADD RNTRY
.UCB46 ANOP
  IECIUCB 46,291,DA,32,01,36,2,,30002001,0,0,0,0,,64,0,0,291,0
         AGO   .UCB47      TO NEXT UCB
.WK28 IECIUCBA 46,30002001,0,0,64,005,005,0
         AGO   .WK29   TO NEXT WORK AREA
.LST48 IECULK3 1,2,47,0,112,0,2,2,1,0
         AGO   .LST49    TO NEXT UCB ADD RNTRY
.UCB47 ANOP
  IECIUCB 47,292,DA,32,01,37,2,,30002001,0,0,0,0,,64,0,0,292,0
         AGO   .UCB48      TO NEXT UCB
.WK29 IECIUCBA 47,30002001,0,0,64,005,005,0
         AGO   .WK30   TO NEXT WORK AREA
.LST49 IECULK3 2,3,48,0,112,0,2,3,1,0
         AGO   .LST50    TO NEXT UCB ADD RNTRY
.UCB48 ANOP
  IECIUCB 48,293,DA,32,01,38,2,,30002001,0,0,0,0,,64,0,0,293,0
         AGO   .UCB49      TO NEXT UCB
.WK30 IECIUCBA 48,30002001,0,0,64,005,005,0
         AGO   .WK31   TO NEXT WORK AREA
.LST50 ANOP     LAST UCB ADD ENTRY
    IECULK3 0,0,0,0,0,1
         AGO   .UCB1      TO FIRST UCB
.TAB4   ANOP            LAST CHANNEL ENTRY
  IECULK1 0,0,2,1
         AGO   .TCU1       TO FIRST CU ENTRY
.TCH3    ANOP   TEST CHANNEL
    IECXTCH 3,1,(0,1,0,0,0,                                           *****
               0),(0,0,0,0),0,0,1,1,0,0
         AGO   .TCH4      TO NEXT TCH MOD
.SRCH3  ANOP       CHANNEL SEARCH MOD3
               IECICS 2,4,0,                                 ************
               (2,                            I267                 ********
               1,1,         I267                                       *
               1),0,0,0,0,0,(0,0,0,0),0
         AGO   .SRCH4     TO NEXT CHAN SRCH MOD
.TCH4   ANOP       LAST TEST CHAN MOD
         AGO   .SRCH1     TO FIRST CSRCH MOD
.SRCH4  ANOP         LAST CHANNEL SEARCH MOD
         AGO   .TBLTAB          TO TABLE MACRO
.TCU9   ANOP       LAST CU ENRY TO TABLE
         AGO   .LST1       TO FIRST CUB ADD
.UCB49   ANOP      LAST UCB ENTRY4
         AGO   .RQE     TO RQE AND STATAB
.WK31 ANOP    LAST WORK ENTRY
         AGO   .UCBEND  TO STATISTICS
.GBL      IECGBL 0,0,33,0
         AGO   .IOSTART
.IECIOS  ANOP      MAINLINE IOS
 IECXCP  1,0,0,1,1,0,0,1,0,0,1,1,                                    XXXXXX
               100,0,2,0,0,0,0,0,0,1,0,0,0,                       *********
               1,1,0,1,0,1,1,0,0,1,0,0,0
ID202    DS    0H  -  SGIEC202  LEVEL - US05579
 IECINT  1,0,0,1,1,0,0,1,0,0,1,1,                                    XXXXXX
               100,0,2,0,0,0,0,0,0,1,0,0,0,                       *********
               1,1,0,1,0,1,1,0,0,1,0,0,0
 IECIOS  1,0,0,1,1,0,0,1,0,0,1,1,                                    XXXXXX
               100,0,2,0,0,0,0,0,0,1,0,0,0,                       *********
               1,1,0,1,0,1,1,0,0,1,0,0,0
         AGO   .TCH1      TO FIRST TCH MOD
.TBLTAB  ANOP  LCH,DEVICE AND CHAN TABLE
 IECTBL  (1,3,3,0,0,0,0),0,3,                                      ******
               (UR,                                                 ******
               TP,                                                  ******
               ML,                                                  ******
               AT,                                                  ******
               DA),1
         AGO  .TAB1     TO FIRST UCB ADDR
.IOSB    ANOP
 IECIOSB 1,0,0,1,1,0,0,1,0,0,1,1,                                    XXXXXX
               100,0,2,0,0,0,0,0,0,1,0,0,0,                      *********
               1,1,0,1,0,1,1,0,0,1,0,0,0
          AGO   .WK1
.END    ANOP
.UCBEND  ANOP
 IECIST 38,(0,0,0,0,0),1
         END
/*
//SG34 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IGFCCH)
//SYSIN DD *
         PRINT ON,NODATA
 IGFCATAP 0,1,0
         END
/*
//SG35 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(CHLOADTB)
//SYSIN DD *
         PRINT ON,NODATA
CHLOADTB CSECT
         DC   H'0'
         DC    H'4'
         DC   H'64'
         DC    H'0'
         DC   H'96'
         DC    H'0'
         DC   H'120'
         DC H'32767'
         END
/*
//SG36 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEC23XXF)
//SYSIN DD *
         PRINT ON,NODATA
 IEC23XXF 0,0,0,0,0,1,1,1,0,0,1,0
         END
/*
//SG37 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEHMVSRR)
//SYSIN DD *
         PRINT ON,NODATA
IEHMVSRR CSECT
 ENTRY CORE
CORE   DC F'65536'
   END
/*
//SG38 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEFWMAS1)
//SYSIN DD *
         PRINT ON,NODATA
DEVNAMET CSECT
         SGIEF010                                                      X
               10,3400-3,X'3400',X'8003',                             XXXXXXXX
               11,2311,X'3000',X'2001',                             XXXXXXXX
               12,1052,X'1000',X'0820',                             XXXXXXXX
               13,1403,X'1000',X'0808',                             XXXXXXXX
               39,2540,X'1000',X'0801',                             XXXXXXXX
               40,2540-2,X'1000',X'0802',                             XXXXXXXX
               49,3330,X'3050',X'2009',                             XXXXXXXX
               62,AAA2,X'0000',X'4002',                             XXXXXXXX
               LAST
         DC    F'13'
 SGIEF011 39,39
 SGIEF011 40,40
 SGIEF011 13,13
 SGIEF011 12,12
 SGIEF011 62,62
 SGIEF011 49,49
 SGIEF011 10,10
 SGIEF011 11,11
         DC    CL8'2400-3'
         DC    X'34008001'
 SGIEF013 16,49,49,49,49,49,49,49,49,11,11,11,11,49,49,49,49
 SGIEF013 24,49,49,49,49,11,11,11,11,11,11,11,11,49,49,49,49
 SGIEF011 0,0,SYSDA
 SGIEF013 8,49,49,49,49,49,49,49,49,11,11,11,11,49,49,49,49
 SGIEF011 0,0,SYSSQ
 SGIEF013 1,40,49,49,49,49,49,49,49,11,11,11,11,49,49,49,49
 SGIEF011 0,0,SYSCP
 SGIEF013 4,10,10,10,10,49,49,49,49,11,11,11,11,49,49,49,49
 SGIEF011 0,0,TAPE
 END
/*
//SG39 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEFDEVPT)
//SYSIN DD *
         PRINT ON,NODATA
IEFDEVPT CSECT
DVPTLEN  DC    H'2'
DVPTSIZE DC    H'60'
DVPTDEV  DC    H'48'
DVPT2321 DC    H'0'
DVPT     DC    F'0'
     DC  X'000FFFFFFFFFFFF0'
     END
/*
//SG40 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(3509,(150,15),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IEFWMSKA)
//SYSIN DD *
         PRINT ON,NODATA
DEVMASKT CSECT
          DC    H'13'
         DC    H'14'
         SGIEF010                                                      X
               10,3400-3,X'3400',X'8003',                             XXXXXXXX
               11,2311,X'3000',X'2001',                             XXXXXXXX
               12,1052,X'1000',X'0820',                             XXXXXXXX
               13,1403,X'1000',X'0808',                             XXXXXXXX
               39,2540,X'1000',X'0801',                             XXXXXXXX
               40,2540-2,X'1000',X'0802',                             XXXXXXXX
               49,3330,X'3050',X'2009',                             XXXXXXXX
               62,AAA2,X'0000',X'4002',                             XXXXXXXX
               LAST
 SGIEF012 39,1,                                                  XXXXXXXX
               0008000000000000
 SGIEF012 40,1,                                                  XXXXXXXX
               0004000000000000
 SGIEF012 13,1,                                                  XXXXXXXX
               0002000000000000
 SGIEF012 12,1,                                                  XXXXXXXX
               0001000000000000
 SGIEF012 62,16,                                                  XXXXXXXX
               0000FFFF00000000
 SGIEF012 49,16,                                                  XXXXXXXX
               00000000FF00FF00
 SGIEF012 10,4,                                                  XXXXXXXX
               0000000000F00000
 SGIEF012 11,8,                                                  XXXXXXXX
               00000000000F00F0
        DC        F'4'
        DC        X'34008001'
   DC  X'0000000000F00000'
 SGIEF013 16,49,49,49,49,49,49,49,49,11,11,11,11,49,49,49,49
 SGIEF013 24,49,49,49,49,11,11,11,11,11,11,11,11,49,49,49,49
 SGIEF012 0,24,                                                      XXXX
               00000000FF0FFFF0
 SGIEF013 8,49,49,49,49,49,49,49,49,11,11,11,11,49,49,49,49
 SGIEF012 0,8,                                                      XXXX
               00000000FF000000
 SGIEF013 1,40,49,49,49,49,49,49,49,11,11,11,11,49,49,49,49
 SGIEF012 0,1,                                                      XXXX
               0004000000000000
 SGIEF013 4,10,10,10,10,49,49,49,49,11,11,11,11,49,49,49,49
 SGIEF012 0,4,                                                      XXXX
               0000000000F00000
 SGIEF013 1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
 SGIEF012 0,24,                                                      XXXX
               00000000FF0FFFF0
          END
/*
//SG41 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IKJEFLP0)
//SYSIN DD *
     PRINT  ON,NODATA
    SGIKJ0LP 3000,10
         END
/*
//SG42 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IKJEBEPD)
//SYSIN DD *
     PRINT  ON,NODATA
  SGIKJ0EB  DSTYPE=(PLIF,FORTE,FORTG,FORTH,TEXT,DATA,CLIST,            X
               CNTL,ASM,COBOL,FORTGI,GOFORT,BASIC,IPLI,PLI,            X
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               BLKSIZE=(400,                                      XXXXXXXXX
               400,                                               XXXXXXXXX
               400,                                               XXXXXXXXX
               400,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               400,                                               XXXXXXXXX
               400,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               1680,                                               XXXXXXXXX
               400,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0),                                              XXXXXXXXX
               RECFM=(FXDONLY,                                        XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               VAR,                                               XXXXXXXXX
               FIXED,                                               XXXXXXXXX
               VAR,                                               XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               FXDONLY,                                               XXXXXXXXX
               VAR,                                               XXXXXXXXX
               VAR,                                               XXXXXXXXX
               VAR,                                               XXXXXXXXX
               VAR,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               DLRECLF=(80,                                      XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0),                                              XXXXXXXXX
               MLRECLF=(100,                                      XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               80,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               120,                                               XXXXXXXXX
               120,                                               XXXXXXXXX
               100,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0),                                              XXXXXXXXX
               DLRECLV=(0,                                      XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               120,                                               XXXXXXXXX
               120,                                               XXXXXXXXX
               104,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0),                                              XXXXXXXXX
               MLRECLV=(0,                                      XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               255,                                               XXXXXXXXX
               120,                                               XXXXXXXXX
               120,                                               XXXXXXXXX
               104,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0,                                               XXXXXXXXX
               0),                                              XXXXXXXXX
               TRNSLT=(CAPSONLY,                                       XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               ASIS,                                               XXXXXXXXX
               CAPS,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPS,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPSONLY,                                               XXXXXXXXX
               CAPS,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               CHKR=(PLIFSCAN,                                         XXXXXXXXX
               IPDSNEXC,                                               XXXXXXXXX
               IPDSNEXC,                                               XXXXXXXXX
               IPDSNEXC,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               IPDSNEXC,                                               XXXXXXXXX
               IPDSNEXC,                                               XXXXXXXXX
               IKJNC211,                                               XXXXXXXXX
               IKJNC211,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               USREXT=(,,,,,,,,,,,,,,,                                 X
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               PRMTR=(,                                        XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ASM,                                               XXXXXXXXX
               COBOL,                                               XXXXXXXXX
               FORT,                                               XXXXXXXXX
               GOFORT,                                               XXXXXXXXX
               IKJNC211,                                               XXXXXXXXX
               IKJNC211,                                               XXXXXXXXX
               PLIC,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               DSNSRC=(DATASET,                                       XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               INCORE,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               DATASET,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               )
 END
/*
//SG43 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IKJEBEIN)
//SYSIN DD *
     PRINT  ON,NODATA
  SGIKJ0E2  DST=(PLI,COBOL,ASM,TEXT,DATA,CLIST,CNTL,BASIC,             X
               IPLI,GOFORT,FORTE,FORTG,FORTGI,FORTH,PLIF,              X
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ),                                              XXXXXXXXX
               SUBFD=(,                                        XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               ,                                               XXXXXXXXX
               )
 END
/*
//SG44 EXEC PGM=ASMBLR,COND=(4,LT)
//SYSLIB DD DSNAME=SYS1.TSOGEN,DISP=(SHR,PASS)
//  DD DSN=SYS1.MODGEN,DISP=(SHR,PASS)
// DD DSN=SYS1.MODGEN2,DISP=(SHR,PASS)
//  DD DSNAME=SYS1.TSOMAC,DISP=(SHR,PASS),VOLUME=(,RETAIN)
// DD DSNAME=SYS1.MACLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG1
//SYSUT2 DD DISP=OLD,VOLUME=(,RETAIN),LABEL=(,SL),DSNAME=SYS1.SG2
//SYSUT3 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
//            DCB=(RECFM=FB,LRECL=121,BLKSIZE=3509),                  X
//            SYSOUT=A,UNIT=(3330,3)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS(IKJEFF65)
//SYSIN DD *
     PRINT  ON,NODATA
   SGIKJ0EF CLASS=AA
 END
/*
//SG45 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE CI555(IKJEAD00)
  ALIAS IKJEAD01
  NAME IKJEAD00(R)
/*
//SG46 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE CI555(IKJEAT03,IKJEAS02,IKJGG008)
  INCLUDE CI555(IKJEAT04,IKJEAT05,IKJEAT06,IKJEAT07)
  INCLUDE CI555(IKJEAT08,IKJEAI00,IKJEAR00,IKJEAR01)
  INCLUDE CI555(IKJEAR02,IKJEAR03,IKJEAR04,IKJEAR05)
  ALIAS IKJEAT04,IKJEAT05,IKJEAT06,IKJEAT07,IKJEAT08
  ALIAS IKJEAI00,IKJEAI01,IKJEAI02,IKJEAI03,IKJEAR00
  ALIAS IKJEAR01
  ENTRY IKJEAT03
  NAME IKJEAT03(R)
  INCLUDE CI555(IKJEAT01)
  ALIAS IKJEAT09
  ENTRY IKJEAT01
  NAME IKJEAT01(R)
/*
//SG47 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//CQ548 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CQ548
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI555(IKJGGQT0)   FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IEDAYAA)    FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IEDAYHH)    FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IEDAYII)    FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IEDAYLL)    FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IEDAYOO)    FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IEDAYGP)    FROM CI555 TO IKJGGQT0 IN LINKLIB
 INCLUDE CQ548(IEDAYZZ)    FROM CQ548 TO IKJGGQT0 IN LINKLIB
 INCLUDE CI555(IKJGG088)   FROM CI555 TO IKJGGQT0 IN LINKLIB
 ENTRY   IKJGGQT0          FIRST ENTRY POINT
 ALIAS   IKJGGQT1          SECOND ENTRY POINT
 NAME    IKJGGQT0(R)       ALL 9 MODULES IN THIS MEMBER NAME
/*
//SG48 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET,REUS,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
    INCLUDE CI555(IKJEFP00,IKJEFP10,IKJEFP20)
    ENTRY IKJPARS
    NAME IKJPARS(R)
    INCLUDE CI555(IKJEFP60)
    ENTRY IKJPARS2
    NAME IKJPARS2(R)
    INCLUDE CI555(IKJEFP30,IKJEFP20)
    ENTRY IKJSCAN
    NAME IKJSCAN(R)
    INCLUDE CI555(IKJEFD00)
    ENTRY IKJEFD00
    ALIAS IKJDAIR
    NAME IKJEFD00(R)
    INCLUDE CI555(IKJEFLF)
    ALIAS IKJEAL00,IKJEAL01
    NAME IKJEFLF(R)
    INCLUDE CI555(IKJEFLG,IKJEFLGB,IKJEFLGH)
    INCLUDE CI555(IKJEFLH)
    INCLUDE SYSPUNCH(IKJEFLP0)
    ENTRY IKJEFLG
    ALIAS IKJEFLGB,IKJEFLH,IKJEFLP0
    NAME IKJEFLG(R)
    INCLUDE CI555(IKJEFLS)
    ENTRY IKJEFLS
    ALIAS IKJEFLS1,IKJEFLS2,IKJEFLS3
    NAME IKJEFLS(R)
    INCLUDE CI555(IKJEFT02,IKJEFT03,IKJEFT04)
    INCLUDE CI555(IKJEFT05,IKJEFT06,IKJEFT07)
    ENTRY IKJEFT02
    ALIAS IKJEFT03,IKJEFT04,IKJEFT05,IKJEFT07
    NAME IKJEFT02(R)
    INCLUDE CI555(IKJEFT30,IKJEFT35,IKJEFT40)
    INCLUDE CI555(IKJEFT45,IKJEFT52,IKJEFT53)
    INCLUDE CI555(IKJEFT54,IKJEFT55,IKJEFT56)
    ALIAS IKJGETL,IKJPUTL,IKJSTCK
    ENTRY IKJPTGT
    NAME IKJPTGT(R)
    INCLUDE CI555(IKJFATRC,IKJFAMSG)
    ENTRY IKJFATRC
    NAME IKJFATRC(R)
    INCLUDE CI555(IKJFATR1,IKJFAMSG,IKJFAERR)
    ENTRY IKJFATR1
    NAME IKJFATR1(R)
    INCLUDE CI555(IKJFASCN,IKJFAMP1,IKJFATP1)
    ENTRY IKJFASCN
    NAME IKJFATRP(R)
    INCLUDE CI555(IKJFATP2,IKJFATAB,IKJFAPUT)
    INCLUDE CI555(IKJFAMP1,IKJFATP1)
    ENTRY IKJFATP2
    NAME IKJFATP2(R)
    INCLUDE CI555(IEEVSND2,IEEVSND5)
    ENTRY IEEVSND2
    NAME IEEVSND2(R)
    INCLUDE CI555(IEEVSND3,IEEVSND5)
    ENTRY IEEVSND3
    NAME IEEVSND3(R)
    INCLUDE CI555(IEEVSND4,IKJEES20)
    ENTRY IEEVSND4
    NAME IEEVSND4(R)
    INCLUDE CI555(IEEVSND8,IEEVSND5)
    ENTRY IEEVSND8
    NAME IEEVSND8(R)
/*
//SG49 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
    INCLUDE CI555(IKJEES70,IKJEES74,IKJEES75)
    ENTRY IKJEES73
    NAME IKJEES73(R)
    INCLUDE CI555(IKJEFT01,IKJEFT06)
    ENTRY IKJEFT01
    NAME IKJEFT01(R)
    INCLUDE CI555(IKJEFLB)
    ENTRY IKJEFLB
    ALIAS IKJLB1
    NAME IKJEFLB(R)
    INCLUDE CI555(IKJEFLC,IKJEFLCM)
    ENTRY IKJEFLC
    NAME IKJEFLC(R)
    INCLUDE CI555(IKJEFLE,IKJEFLEA)
    ENTRY IKJEFLE
    NAME IKJEFLE(R)
    INCLUDE CI555(IKJEFLGM,IKJEFLGN)
    ENTRY IKJEFLGM
    NAME IKJEFLGM(R)
    INCLUDE CI555(IKJEFLL,IKJEFLLM)
    ENTRY IKJEFLL
    NAME IKJEFLL(R)
    INCLUDE CI555(IKJEFLJ)
    ENTRY IKJEFLJ
    ALIAS IKJLJ1
    NAME IKJEFLJ(R)
    INCLUDE CI555(IKJEFLK)
    ENTRY IKJEFLK
    ALIAS IKJLK1
    NAME IKJEFLK(R)
/*
//SG50 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET,REUS,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
    INCLUDE CI555(IKJEFF40)
    ENTRY IKJEFF40
    ALIAS IKJEFF4A
    NAME IKJEFF40(R)
    INCLUDE CI555(IKJEFF41,IKJEFF42,IKJEFF43,IKJEFF46)
    ENTRY IKJEFF41
    NAME IKJEFF41(R)
    INCLUDE CI555(IKJEFF51,IKJEFF52,IKJEFF54)
    ENTRY IKJEFF51
    NAME IKJEFF51(R)
    INCLUDE CI555(IKJEFF58)
    ENTRY IKJEFF58
    NAME  IKJEFF58(R)
    INCLUDE CI555(IKJEFF59)
    ENTRY IKJEFF59
    NAME  IKJEFF59(R)
/*
//SG51 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET,REUS,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=151,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.CMDLIB
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
    INCLUDE DCMDLIB(IKJEES10,IKJEES11)
    INCLUDE CI555(IEEVSDIO,IKJEES20)
    ENTRY IKJEES10
    ALIAS SE
    NAME SEND(R)
    INCLUDE DCMDLIB(IKJEES40)
    INCLUDE CI555(IEEVSDIO,IKJEES20)
    ENTRY IKJEES40
    NAME IKJEES40(R)
    INCLUDE DCMDLIB(IKJEFA00,IKJEFA01)
    ENTRY IKJEFA00
    NAME ACCOUNT(R)
    INCLUDE DCMDLIB(IKJEFA30,IKJEFA31,IKJEFA51)
    INCLUDE DCMDLIB(IKJEFA52,IKJEFA53,IKJEFA54)
    INCLUDE DCMDLIB(IKJEFA32,IKJEFA55)
    ENTRY IKJEFA30
    NAME IKJEFA30(R)
    INCLUDE DCMDLIB(IKJEFA40,IKJEFA41,IKJEFA42)
    INCLUDE DCMDLIB(IKJEFA52,IKJEFA51,IKJEFA55)
    ENTRY IKJEFA40
    NAME IKJEFA40(R)
    INCLUDE DCMDLIB(IKJEFA10,IKJEFA11,IKJEFA12)
    INCLUDE DCMDLIB(IKJEFA13,IKJEFA51)
    INCLUDE DCMDLIB(IKJEFA52,IKJEFA53,IKJEFA55)
    ENTRY IKJEFA10
    NAME IKJEFA10(R)
    INCLUDE DCMDLIB(IKJEFA20,IKJEFA21,IKJEFA22)
    INCLUDE DCMDLIB(IKJEFA23,IKJEFA24,IKJEFA55)
    INCLUDE DCMDLIB(IKJEFA51,IKJEFA52,IKJEFA53)
    INCLUDE DCMDLIB(IKJEFA54)
    ENTRY IKJEFA20
    NAME IKJEFA20(R)
    INCLUDE DCMDLIB(IKJEE100,IKJEE1A0,IKJEE150)
    ENTRY IKJEE100
    ALIAS OPER
    NAME OPERATOR(R)
    INCLUDE DCMDLIB(IKJEFE11,IKJEFE15,IKJEFE16)
    ENTRY IKJEFE11
    ALIAS END,WHEN
    NAME IKJEFE11(R)
    INCLUDE DCMDLIB(IKJEFH01,IKJEFH00,IKJEFH02)
    INCLUDE DCMDLIB(IKJEFH03)
    INCLUDE CI555(IKJEFF02)
    ENTRY IKJEFH01
    ALIAS H
    NAME HELP(R)
    INCLUDE DCMDLIB(IKJEFT80)
    ALIAS TERM
    NAME TERMINAL(R)
    INCLUDE DCMDLIB(IKJEFT82)
    ALIAS PROF
    NAME PROFILE(R)
    INCLUDE DCMDLIB(IKJEFE01,IKJEFE02,IKJEFE03)
    INCLUDE DCMDLIB(IKJEFE05)
    ENTRY IKJEFE01
    ALIAS EX
    NAME EXEC(R)
    INCLUDE DCMDLIB(IKJEFE04,IKJEFE06)
    ENTRY IKJEFE04
    NAME IKJEFE04(R)
    INCLUDE DCMDLIB(IKJEFF04,IKJEFF05,IKJEFF06)
    INCLUDE DCMDLIB(IKJEFF07,IKJEFF08,IKJEFF09)
    INCLUDE DCMDLIB(IKJEFF11,IKJEFF12,IKJEFF13)
    INCLUDE DCMDLIB(IKJEFF14)
    INCLUDE CI555(IKJEFF15)
    ENTRY IKJEFF04
    NAME IKJEFF04(R)
    INCLUDE DCMDLIB(IKJEFF16)
    ENTRY IKJEFF16
    NAME IKJEFF16(R)
    INCLUDE DCMDLIB(IKJEFF01,IKJEFF03)
    INCLUDE CI555(IKJEFF02)
    ENTRY IKJEFF01
    ALIAS SUB
    NAME SUBMIT(R)
    INCLUDE DCMDLIB(IKJEFF50,IKJEFF55)
    INCLUDE CI555(IKJEFF02)
    ENTRY IKJEFF50
    ALIAS IKJEFF5A,ST
    NAME STATUS(R)
    INCLUDE CI555(IKJEES70,IKJEES74,IKJEES75)
    ENTRY IKJEES70
    ALIAS LISTB
    NAME LISTBC(R)
    INCLUDE DCMDLIB(IKJEFD20)
    ENTRY IKJEFD20
    NAME FREE(R)
    INCLUDE DCMDLIB(IKJEFG00)
    ENTRY IKJEFG00
    NAME CALL(R)
    INCLUDE DCMDLIB(IKJEFR00)
    ENTRY IKJEFR00
    ALIAS R
    NAME RUN(R)
    INCLUDE DCMDLIB(IKJEFD30)
    ENTRY IKJEFD30
    ALIAS ALLOC
    NAME ALLOCATE(R)
    INCLUDE DCMDLIB(IKJEFATT)
    ENTRY IKJEFATT
    ALIAS ATTR
    NAME ATTRIB(R)
    INCLUDE DCMDLIB(IKJEFL00)
    ALIAS LOGON
    NAME LOGOFF(R)
/*
//SG52 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,REFR,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=151,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.CMDLIB
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE DCMDLIB(IKJEHREN)
  ALIAS RENAME
  ALIAS REN
  NAME IKJEHREN(R)
  INCLUDE DCMDLIB(IKJEHDEL)
  ALIAS DELETE
  ALIAS D
  NAME IKJEHDEL(R)
  INCLUDE DCMDLIB(IKJEHPRO)
  ALIAS PROTECT
  ALIAS PROT
  NAME IKJEHPRO(R)
/*
//SG53 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=151,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.CMDLIB
//DCMDLIB DD DSNAME=SYS1.DCMDLIB,DISP=SHR,VOLUME=(,RETAIN)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DCMDLIB(IKJLKL01,IKJLKMSG)
 ENTRY IKJLKL01
 NAME IKJLKL01(R)
/*
//SG54 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,REFR,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=151,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.CMDLIB
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE DCMDLIB(IKJEGCVT,IKJEGATN,IKJEGSTA)
  INCLUDE DCMDLIB(IKJEGIO,IKJEGSCD,IKJEGMNL)
  ENTRY  IKJEGMNL
  NAME   IKJEGMNL(R)
  INCLUDE DCMDLIB(IKJEGINT,IKJEGIO,IKJEGSCD)
  ENTRY IKJEGINT
  NAME TEST(R)
/*
//SG55 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,REFR,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=151,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.CMDLIB
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE DCMDLIB(IKJEBEFI,IKJEBESE)
  ENTRY IKJEBEFI
  NAME IKJEBEFI(R)
  INCLUDE DCMDLIB(IKJEBECG,IKJEBESE)
  ENTRY IKJEBECG
  NAME IKJEBECG(R)
  INCLUDE SYSPUNCH(IKJEBEIN)
  ENTRY IKJEBEIN
  ALIAS EDIT
  ALIAS IKJEBEIN
  NAME E(R)
  INCLUDE DCMDLIB(IKJEBEMA,IKJEBEAT,IKJEBEUT,IKJEBEAE)
  ENTRY IKJEBEMA
  NAME IKJEBEMA(R)
  INCLUDE DCMDLIB(IKJEBEEN)
  ENTRY IKJEBEEN
  ALIAS IKJEBEXT
  NAME IKJEBEEN(R)
/*
//SG56 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,OL,REFR,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=151,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.CMDLIB
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE DCMDLIB(IKJEBEPS)
  INCLUDE SYSPUNCH(IKJEBEPD)
  ENTRY IKJEBEPS
  NAME IKJEBEPS(R)
/*
//SG57 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,REFR,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=151,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.CMDLIB
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE DCMDLIB(IKJEFF60,IKJEFF62,IKJEFF63)
  INCLUDE DCMDLIB(IKJEFF64,IKJEFF68)
  ENTRY IKJEFF60
  ALIAS OUTPUT
  ALIAS OUT
  NAME IKJEFF60(R)
/*
//SG58 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,REFR,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE CI555(IKJEFF61,IKJEFF66)
  CHANGE  IEFSD110(IKJEFF61)
  INCLUDE  CI505(IEFQAGST,IEFLOCDQ)
  CHANGE  IEFSD112(IKJEFF61)
  INCLUDE CI505(IEFQDELQ,IEFCNVRT,IEFRDWRT)
  ENTRY IKJEFF61
  NAME IKJEFF61(R)
  INCLUDE SYSPUNCH(IKJEFF65)
  ENTRY IKJEFF65
  NAME IKJEFF65(R)
/*
//SG59 EXEC PGM=IEBCOPY,COND=(8,LT)
//SYSUT3 DD DISP=SHR,DSNAME=SYS1.SG3
//SYSUT4 DD DISP=SHR,DSNAME=SYS1.SG4
//SYSPRINT DD SPACE=(121,(750,100),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=121),                   X
//             SYSOUT=A,UNIT=(3330,3)
//CI535 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.CI535
//CI555 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.CI555
//DM508 DD DISP=SHR,VOLUME=(,RETAIN),DSN=SYS1.DM508
//CI505 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.CI505
//DHELP DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DHELP
//HELP DD DSNAME=SYS1.HELP,VOLUME=(,RETAIN,SER=MVTRES),            XXXXXXXX
//             UNIT=151,DISP=OLD
//DUADS DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DUADS
//UADS DD DSNAME=SYS1.UADS,VOLUME=(,RETAIN,SER=MVTRES),            XXXXXXXX
//             UNIT=151,DISP=OLD
//DCMDLIB DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DCMDLIB
//CMDLIB DD DSN=SYS1.CMDLIB,VOL=(,RETAIN,SER=MVTRES),
//             UNIT=151,DISP=OLD
//SVCLIB DD DSNAME=SYS1.SVCLIB,VOLUME=(,RETAIN,SER=MVTRES),        XXXXXXXX
//             UNIT=151,DISP=OLD
//LINKLIB DD DSNAME=SYS1.LINKLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=3330,DISP=OLD
//SYSIN DD *
 COPY OUTDD=HELP,INDD=DHELP
 COPY OUTDD=UADS,INDD=DUADS
  COPY    OUTDD=LINKLIB,INDD=CI555
  SELECT MEMBER=(IKJEAT00,IKJEAT02)
  SELECT MEMBER=(IKJEAD02,IKJEAD03,IKJEAP00)
  SELECT MEMBER=(IKJEAS00,IKJEAS01,IKJEAS03)
  COPY   OUTDD=SVCLIB,INDD=CI555
  SELECT MEMBER=((IKJEAX00,IGC0009F))
 COPY OUTDD=SVCLIB,INDD=CI555
 SELECT MEMBER=(IGC0009C,IGC0009D,IGG019TX)
 SELECT MEMBER=(IGG019TY,IGG019TZ,IGG019T3,IGG019T4)
 SELECT MEMBER=(IGG019T5,IGG019T6,IGG019T7,IGG019T8)
 SELECT MEMBER=(IGG0196S,IGG09301,IGG09302)
 SELECT MEMBER=(IGG09303,IGG0940A,IGG0940B,IGG0940C)
 SELECT MEMBER=(IGG0940D,IGG0940E,IGG0940F,IGG0940G)
 SELECT MEMBER=(IGG09400,IGG09404,IGG09405,IGG09406)
 SELECT MEMBER=(IGG09407,IGG09408,IGG09409,IGG0193H)
 COPY OUTDD=LINKLIB,INDD=CI555
 SELECT MEMBER=(IKJGG001,IKJGGE00,IKJGGE01)
 COPY OUTDD=CMDLIB,INDD=DCMDLIB
 SELECT MEMBER=(LINK,LOADGO,LOAD,IKJLKL02)
  COPY OUTDD=CMDLIB,INDD=DCMDLIB
   SELECT MEMBER=(IKJEBERU,IKJEBEMS,IKJEBEFC,IKJEBESA)
   SELECT MEMBER=(IKJEBECO,IKJEBELT,IKJEBELI,IKJEBEMR)
   SELECT MEMBER=(IKJEBEM5,IKJEBEIM,IKJEBEIP,IKJEBESC)
   SELECT MEMBER=(IKJEBELE,IKJEBESN,IKJEBECI,IKJEBEUI)
   SELECT MEMBER=(IKJEBEUT,IKJEBEEX,IKJEBEAA,IKJEBEIA)
   SELECT MEMBER=(IKJEBEDE,IKJEBEME,IKJEBERE,IKJEBEIS)
   SELECT MEMBER=(IKJEBETA,IKJEBEDO,IKJEBEHE)
   SELECT MEMBER=(IKJEBEFO,IKJEBETO,IKJEBEBO,IKJEBEUP)
   SELECT MEMBER=(IKJEBEVE,IKJEBEDA,IKJEBEM6,IKJEBEM7)
   SELECT MEMBER=(IKJEBEM1,IKJEBEM2,IKJEBEM3,IKJEBEM4)
   SELECT MEMBER=(IKJEBECH,IKJEBECN,IKJEBERN)
 COPY OUTDD=CMDLIB,INDD=DCMDLIB
   SELECT MEMBER=IKJEFF67
  COPY OUTDD=SVCLIB,INDD=CI555
   SELECT MEMBER=IGC0009G
   COPY OUTDD=SVCLIB,INDD=CI505
   SELECT MEMBER=IGC0006A               TESTRAN SVC
  COPY OUTDD=CMDLIB,INDD=DCMDLIB
   SELECT MEMBER=(IKJEGLDR,IKJEGQFY,IKJEGSYM,IKJEGAT)
   SELECT MEMBER=(IKJEGPCH,IKJEGLST,IKJEGASN,IKJEGLSA)
   SELECT MEMBER=(IKJEGMAP,IKJEGWHR,IKJEGOFF,IKJEGTCB)
   SELECT MEMBER=(IKJEGDEB,IKJEGPSW,IKJEGDCB,IKJEGEQU)
   SELECT MEMBER=(IKJEGGO,IKJEGRUN,IKJEGCAL,IKJEGDRP)
   SELECT MEMBER=(IKJEGLDF,IKJEGLOD,IKJEGDEL,IKJEGATD)
   SELECT MEMBER=(IKJEGGET,IKJEGFRE,IKJEGCPY)
    COPY OUTDD=LINKLIB,INDD=CI555
    SELECT MEMBER=(IKJEFT25)
    SELECT MEMBER=(IKJEFLA,IKJEFLI,IKJEFLM)
    SELECT MEMBER=(IKJEFLPA,IEFVSCAN)
    SELECT MEMBER=(IEEVDUS1,IEEVGPSD)
    SELECT MEMBER=(IEEVSEND,IEEVSND9)
    COPY OUTDD=SVCLIB,INDD=CI555
~raw00000000000000001200402021004020410011000000204040202040420040202001001240224022400122002400402040104010100010001102400140044100100010000400100050002022202200000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
    SELECT MEMBER=(IGC0009I,IGC0109I,IGC0209I)
    SELECT MEMBER=(IGC0309I,IGC0409I,IGC0509I)
    SELECT MEMBER=(IGC0609I,IGC0709I,IGC0809I)
    SELECT MEMBER=(IGC0909I,IGC1009I,IGC1109I)
    SELECT MEMBER=(IGC1209I,IGC1309I,IGC1409I)
    SELECT MEMBER=(IGC1509I,IGC1609I,IGC1709I)
    SELECT MEMBER=(IGC1809I,IGC1909I,IGC2009I)
    SELECT MEMBER=(IGC2109I,IGC2309I,IGC2509I)
    SELECT MEMBER=(IGC2609I,IGC2709I,IGC2809I)
    SELECT MEMBER=(IGC2909I,IGC3009I,IGC3509I)
    COPY OUTDD=LINKLIB,INDD=CI555
    SELECT MEMBER=(IKJEFF02,IKJEFF44,IKJEFF45)
    SELECT MEMBER=(IKJEFF53)
    SELECT MEMBER=(IKJEFF15)
    COPY OUTDD=CMDLIB,INDD=DCMDLIB
    SELECT MEMBER=(IKJEFF10,IKJEFF18)
    SELECT MEMBER=((IKJEFF57,CANCEL))
  COPY  OUTDD=CMDLIB,INDD=DCMDLIB
  SELECT MEMBER=(IKJEHCT1,LISTCAT,LISTC,IKJEHCIR,IKJEHMEM)
   SELECT MEMBER=(IKJEHDEF,IKJDFLT)
  SELECT MEMBER=(IKJEHDS1,LISTDS,LISTD)
  SELECT MEMBER=(IKJEHAL1,LISTALC,LISTA)
  SELECT MEMBER=(IKJEHSIR)
/*
//SG60 EXEC PGM=IEBCOPY,COND=(8,LT)
//SYSPRINT DD SPACE=(121,(500,40),RLSE),                               X
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3630),                  X
//             SYSOUT=A,UNIT=(3330,3)
//SYSUT1 DD DSNAME=SYS1.MACLIB,DISP=SHR
//SYSUT2 DD DSNAME=SYS1.MACLIB,VOLUME=(,RETAIN,SER=MVTRES),        XXXXXXXX
//             DISP=OLD,UNIT=3330
//SYSUT3 DD DISP=SHR,DSNAME=SYS1.SG3
//SYSUT4 DD DISP=SHR,DSNAME=SYS1.SG4
//TSOMAC DD DSNAME=SYS1.TSOMAC,DISP=SHR
//TCAMMAC DD DSNAME=SYS1.TCAMMAC,DISP=SHR
//SYSIN DD *
 COPY OUTDD=SYSUT2,INDD=SYSUT1
 EXCLUDE MEMBER=(FDFORM,FDPAGE,FDLINE,FDFIELD,FDCTRL)
 EXCLUDE MEMBER=(FDEND,IDFTR,IDFASM,IDFGBL,IDFMSG)
 EXCLUDE MEMBER=(IDFMSG1,IDFMSG2,IDFMSG3,IDFIN01)
 EXCLUDE MEMBER=(IDFIN02,IDFIN03,IDFIN04,IDFIN05)
 EXCLUDE MEMBER=(IDFIN06,IDFIN07,IDFIN08,IDFIN09)
 EXCLUDE MEMBER=(IDFIN10,IDFIN11)
 EXCLUDE MEMBER=(IDFDSP,FDDSPLY,FDTRACE)
 EXCLUDE MEMBER=(FDLOAD,FDSYNTAX,IDFTRK)
 EXCLUDE MEMBER=(ANALYZ,ASGNBFR,ATTNINQ,BUFINQ,DAR)
 EXCLUDE MEMBER=(GAIC,GBFLM,GBINF,GBPOS,GBPST,GCNL)
 EXCLUDE MEMBER=(GCNOP,GCNTRL,GCON,GDCDS,GDPD,GDRD,GDS,GDSF)
 EXCLUDE MEMBER=(GDV,GECF,GECP,GECV,GENSD,GEOS,GEPI2)
 EXCLUDE MEMBER=(GEPM,GESD,GESM,GESU,GEVI2,GEVM,GFEF)
 EXCLUDE MEMBER=(GFFM,GFRM,GIBLC,GINIT,GLCW,GLIC,GLRC,GLRR)
 EXCLUDE MEMBER=(GLTR,GLVS,GMLD,GMLW,GMSR,GMVA,GMVD)
 EXCLUDE MEMBER=(GNOP2,GNOP4,GODEL,GPDI,GRDA,GRDB,GRDE)
 EXCLUDE MEMBER=(GRDS,GREAD,GREADR,GSBLC,GSBPOS,GSCW)
 EXCLUDE MEMBER=(GSERV,GSIC,GSRT,GSXY,GTDD,GTND)
 EXCLUDE MEMBER=(GTNS,GTNZ,GTOS,GTRU,GTR1,GTR2,GTR3)
 EXCLUDE MEMBER=(GTR4,GTSL,GTXT,GTZE,GUSTOR,GWRITE)
 EXCLUDE MEMBER=(IHBGAM1,IHBGAM2,IHBGAM3)
 EXCLUDE MEMBER=(OACB,RLSEBFR,SAEC,SPAR)
 EXCLUDE MEMBER=(RESCN,DSPLY,RDLNE,DEFAREA,DEFCCW)
 COPY OUTDD=SYSUT2,INDD=TSOMAC
 COPY OUTDD=SYSUT2,INDD=TCAMMAC
/*
//SG61 EXEC PGM=IEWL,COND=(4,LT),
//  PARM='NCAL,DC,SIZE=(128K,6K),SCTR,LET,MAP'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(500,40),RLSE),                               X
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=121),                   X
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=(OLD,PASS),UNIT=151,                            XXXXXXXX
//             VOLUME=SER=MVTRES,                                    XXXXXXXX
//             DSNAME=SYS1.NUCLEUS(IEANUC01)
//CI505 DD DISP=SHR,DSNAME=SYS1.CI505,VOLUME=(,RETAIN)
//DM508 DD DISP=SHR,DSNAME=SYS1.DM508,VOLUME=(,RETAIN)
//CI535 DD DISP=SHR,DSNAME=SYS1.CI535,VOLUME=(,RETAIN)
//IO526 DD DISP=SHR,DSNAME=SYS1.IO526,VOLUME=(,RETAIN)
//CQ519 DD DISP=SHR,DSNAME=SYS1.CQ519,VOLUME=(,RETAIN)
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//CQ548 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CQ548
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//DN539 DD DISP=SHR,DSNAME=SYS1.DN539,VOLUME=(,RETAIN)
//SYSLIN DD *
         INSERT IEAANIP0
       INSERT IEAQFX00
 INSERT IGFCCH
 INCLUDE CQ519(IECKQQ01)
 INCLUDE CQ548(IEDQEB)
 INCLUDE CQ548(IEDQATTN)
 INCLUDE SYSPUNCH(IEAANIP0,IEAASU00,IEAQBK00)
 INCLUDE CI505(IEAAEF00)
 INCLUDE CI535(IEAQED02,IEAQID00,IEAQTB00)
 INCLUDE CI555(IKJEASY0,IKJEALK0)
 INCLUDE CI555(IKJEANQ0)
 INCLUDE CI535(IEAQRT00,IEAQST00)
 INCLUDE CI555(IKJEATR0,IKJEAAB0)
  INCLUDE CI555(IKJEATI0)
 CHANGE GETIQE(IEACVT)
         INCLUDE CI535(IEAQSETS)
 INCLUDE SYSPUNCH(IEAQNU00,IEASVC00,IEAQGM01,IEAQPRT0)
 INCLUDE SYSPUNCH(IEAQCH00,IEAQAT00,IEAQET00)
 INCLUDE CI505(IEAPATCH)
 INCLUDE DM508(IFG019RA)
 INCLUDE CI505(IEAQMSGS)
 INCLUDE  DM508(IGC0010C)
 INCLUDE SYSPUNCH(IGFCCH)
 INCLUDE CI505(IFBDCB02)
         INCLUDE CI535(IHLMCIHV)
         INCLUDE CI505(IEAASPRG)
          CHANGE IECTRDIL(IGXERROR)
          CHANGE IECTATRL(IGXERROR)
          CHANGE IECTCHSL(IGXERROR)
          CHANGE IECTCHAL(IGXERROR)
          CHANGE IECTRSTL(IGXERROR)
          INCLUDE  CI505(IGC116)
   INCLUDE SYSPUNCH(IEC23XXF)
   INCLUDE CI505(IECINTRP)
  INCLUDE SYSPUNCH(IEAATR00)
    INCLUDE CI555(IECIPRTS)
      INCLUDE  CI505(IECTATTN)
 INCLUDE  IO526(IGC054)
 INCLUDE  SYSPUNCH(IGC018)
 INCLUDE CI535(IEEBASEC,IEFVPOST)
 INCLUDE CI505(IEECVCRA,IEFQRESD,IEFATECB)
 INCLUDE CI535(IEECVCTB,IEECVED2)
 INCLUDE CI505(IEECVCRX)
 INCLUDE SYSPUNCH(IEECVUCM)
 INCLUDE SYSPUNCH(IEACVTPC)
 INCLUDE CI535(IEAQCB02)
 INCLUDE SYSPUNCH(IGF201)
 INCLUDE DN539(IGFDDR02)
 INCLUDE DN539(IGFDDR03)
 INCLUDE DN539(IGFDDR04)
 INCLUDE DN539(IGFDDRMV)
 INCLUDE SYSPUNCH(IFBCTA00)
 INCLUDE      CI535(IEWFETCH)
 INCLUDE      CI505(IEWSUOVR)
 INCLUDE CI505(IFFGRDUM)
/*
//SG62 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=151,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.SVCLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//DN539 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN539
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN539(IGF2603D)
 NAME IGC2603D(R)
 INCLUDE  CI505(IEE4503D)
 NAME IGC4503D(R)
 INCLUDE CI505(IEE5503D)
 NAME IGC5503D(R)
 INCLUDE CI535(IEE0003D)
 NAME IGC0003D(R)
 INCLUDE CI505(IEE0303D)
 NAME IGC0303D(R)
 INCLUDE CI535(IEE5103D)
 NAME IGC5103D(R)
 INCLUDE CI535(IEE5203D)
 NAME IGC5203D(R)
 INCLUDE CI535(IEE5303D)
 NAME IGC5303D(R)
 INCLUDE CI505(IEE5403D)
 NAME IGC5403D(R)
 INCLUDE CI505(IEE0403D)
 NAME IGC0403D(R)
 INCLUDE CI505(IEE0503D)
 NAME IGC0503D(R)
 INCLUDE CI505(IEE0603D)
 NAME IGC0603D(R)
 INCLUDE CI505(IEE8603D)
 NAME IGC8603D(R)
 INCLUDE CI505(IEE6503D)
 NAME IGC6503D(R)
 INCLUDE CI505(IEE6603D)
 NAME IGC6603D(R)
 INCLUDE CI505(IEE0703D)
 NAME IGC0703D(R)
 INCLUDE CI535(IEE3703D)
 NAME IGC3703D(R)
 INCLUDE CI505(IEE0803D)
 NAME IGC0803D(R)
 INCLUDE CI505(IEE3503D)
 NAME IGC3503D(R)
 INCLUDE CI535(IEE3803D)
 NAME IGC3803D(R)
 INCLUDE CI505(IEE0903D)
 NAME IGC0903D(R)
 INCLUDE CI505(IEE8503D)
 NAME IGC8503D(R)
 INCLUDE CI505(IEE1103D)
 NAME IGC1103D(R)
 INCLUDE CI505(IEE5603D)
 NAME IGC5603D(R)
 INCLUDE CI505(IEE5903D)
 NAME IGC5903D(R)
 INCLUDE CI505(IEE6303D)
 NAME IGC6303D(R)
 INCLUDE CI505(IEE6403D)
 NAME IGC6403D(R)
 INCLUDE CI505(IEE6703D)
 NAME IGC6703D(R)
 INCLUDE CI505(IEE6803D)
 NAME IGC6803D(R)
 INCLUDE CI505(IEE6903D)
 NAME IGC6903D(R)
 INCLUDE CI505(IEE7103D)
 NAME IGC7103D(R)
 INCLUDE CI505(IEE7503D)
 NAME IGC7503D(R)
 INCLUDE CI505(IEE7603D)
 NAME IGC7603D(R)
 INCLUDE CI505(IEE7703D)
 NAME IGC7703D(R)
 INCLUDE CI505(IEE7803D)
 NAME IGC7803D(R)
 INCLUDE CI505(IEE7903D)
 NAME IGC7903D(R)
 INCLUDE CI505(IEE00110)
 ALIAS IGC00110
~raw00002020440020404020000040014004410010001000040004005000402220012022000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
 INCLUDE CI505(IEE10110)
 NAME IGC10110(R)
 INCLUDE CI505(IEE11110)
 NAME IGC11110(R)
 INCLUDE CI505(IEE12110)
 NAME IGC12110(R)
 INCLUDE CI505(IEE20110)
 NAME IGC20110(R)
 INCLUDE CI505(IEE21110)
 NAME IGC21110(R)
 INCLUDE CI505(IEE22110)
 NAME IGC22110(R)
 INCLUDE CI505(IEE23110)
 NAME IGC23110(R)
 INCLUDE CI505(IEE40110)
 NAME IGC40110(R)
 INCLUDE CI535(IEE50110)
 NAME IGC50110(R)
 INCLUDE CI505(IEE60110)
 NAME IGC60110(R)
 INCLUDE CI505(IED1303D)
 NAME IGC1303D(R)
 INCLUDE CI555(IKJ5803D)
 NAME IGC5803D(R)
 INCLUDE CI505(IEE3103D)
 NAME IGC3103D(R)
 INCLUDE CI505(IHK1503D)
 NAME IGC1503D(R)
 INCLUDE CI505(IEE2103D)
 NAME IGG2103D(R)
 INCLUDE CI505(IEE2303D)
 NAME IGC2303D(R)
 INCLUDE DN539(IGF2503D)
 NAME IGC2503D(R)
 INCLUDE DN539(IGF2403D)
 NAME IGC2403D(R)
 INCLUDE SYSPUNCH(IEE3203D)
 NAME IGC3203D(R)
 INCLUDE CI505(IEE2903D)
 NAME IGC2903D(R)
 INCLUDE CI505(IEECVCTR)
 NAME IGC0007B(R)
 INCLUDE CI505(IEECVCTX)
 NAME IGCXL07B(R)
 INCLUDE CI505(IEECVPMX)
 NAME IGC0107B(R)
 INCLUDE CI505(IEECVPMC)
 NAME IGC1107B(R)
 INCLUDE CI505(IEECVPMP)
 NAME IGC2107B(R)
 INCLUDE CI505(IEECVOCP)
 NAME IGC2I07B(R)
 INCLUDE CI535(IEENVWTO)
 NAME IGC0003E(R)
 INCLUDE CI505(IEECVOCX)
 NAME IGC0I07B(R)
 INCLUDE CI505(IEECVOCC)
 NAME IGC1I07B(R)
 INCLUDE CI505(IEEVWTOR)
 NAME IGC0103E(R)
 INCLUDE CI505(IEFWTP00)
 NAME IGC0203E(R)
 INCLUDE CI505(IEFWTP01)
 NAME IGC0303E(R)
 INCLUDE CI505(IEFWTP02)
 NAME IGC0403E(R)
 INCLUDE CI505(IEFXQM00)
~raw00002020440020404020000040014004410010001000100000015000402220012022000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
 INCLUDE CI505(IEFXQM01)
~raw00002020440020404020000040014004410010000400100000015000402220012022000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
 INCLUDE CI505(IEFXQM02)
~raw00002020440020404020000040014004410010000200100000015000402220012022000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
 INCLUDE CI505(IEFXQM03)
~raw00002020440020404020000040014004410010000100100000015000402220012022000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
 INCLUDE CI505(IEE1203D)
 NAME IGC1203D(R)
 INCLUDE CI505(IEE1B03D)
 NAME IGC1B03D(R)
 INCLUDE CI505(IEE1603D)
 NAME IGC1603D(R)
 INCLUDE CI505(IEE0303F)
 NAME IGC0003F(R)
 INCLUDE CI505(IEE0403F)
 NAME IGC0403F(R)
 INCLUDE CI505(IEECVPM1)
 NAME IGC0207B(R)
 INCLUDE CI505(IEECVML1)
 NAME IGC0603E(R)
 INCLUDE CI505(IEECVML2)
 NAME IGC0703E(R)
 INCLUDE CI505(IEECVML4)
 NAME IGC0803E(R)
/*
//SG63 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//DN539 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN539
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 CHANGE IEFSD059(IEFVM2)
 INCLUDE CI505(IEFVMLS1)
 INCLUDE CI535(IEFSD180)
 INCLUDE CI505(IEFSD21Q,IEF41FAK,IEFWSTRT)
 CHANGE IEFSD059(IEFVM2)
 INCLUDE CI505(IEFVM3LS)
 CHANGE IEFSD059(IEFVM2)
 INCLUDE CI505(IEFVM5LS,IEFVM2LS,IEFVM4LS)
 INCLUDE CI505(IEFQMLK1,IEFYSVMS,IEFVM76)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ,IEFQMRAW)
 INCLUDE CI535(IEFSD111)
 INCLUDE CI505(IEFCVFAK)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFXCSSS)
 INCLUDE CI505(IEFSCAN)
 INCLUDE SYSPUNCH(IEFDEVPT)
 INCLUDE SYSPUNCH(CHLOADTB)
 INCLUDE CI505(IEFVKMSG,IEFWAFAK)
 INCLUDE CI505(IEFXAMSG,IEFWCFAK,IEFWDFAK)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFVKIMP)
 INCLUDE CI505(IEFVMLK5)
 INCLUDE CI505(IEFACTFK)
 ALIAS IEFVM1,IEFXA,IEFVMCVL
 ENTRY IEFW21SD
 NAME IEFW21SD(R)
 INCLUDE SYSPUNCH(IEFWMAS1)
 NAME DEVNAMET(R)
 INCLUDE SYSPUNCH(IEFWMSKA)
 NAME DEVMASKT(R)
 INCLUDE SYSPUNCH(CHLOADTB)
 NAME CHLOADTB(R)
 INCLUDE CI535(IEFDSOCR)
 INCLUDE CI535(IEFSD111)
 INCLUDE CI535(IEFSD112)
 INCLUDE CI505(IEFQMRAW)
 INCLUDE CI505(IEFQMNQQ)
 CHANGE IEFSD598(IEFSD068)
 CHANGE IEFSD510(IEFSD068)
 CHANGE IEFSD061(IEFSD068)
 CHANGE IEFVSDRA(IEFSD068)
 INCLUDE CI505(IEFSD168)
 ENTRY IEFDSOCR
 NAME IEFDSOCR(R)
 INCLUDE CI505(IEFDSOFB)
 NAME IEFDSOFB(R)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFMCVOL)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFVMLS6)
 INCLUDE CI505(IEFVMLS7,IEFVMFAK)
 INCLUDE CI505(IEFVMMS1,IEF41FAK)
 INCLUDE CI505(IEFYSVMS,IEFQMLK1)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ,IEFQMRAW)
 INCLUDE CI535(IEFSD111)
 ALIAS IEFCVOL1,IEFCVOL2,IEFCVOL3
 ENTRY IEFCVOL1
 NAME  IEFMCVOL(R)
 INCLUDE CI505(IEFXV001,IEFXVMSG,IEFXVNSL,IEFX5000)
 INCLUDE CI505(IEFSCAN)
 INCLUDE SYSPUNCH(IEFDEVPT)
 INCLUDE CI505(IEFXV002)
 INCLUDE CI505(IEFXV003)
 INCLUDE CI505(IEFXDPTH)
 INCLUDE CI505(IEFXJFAK,IEFSD551,IEFX300A,IEFXH000)
 INCLUDE CI505(IEFWCFAK,IEFSD552,IEFWD001)
 CHANGE IEFXT000(IEFXV001)
 CHANGE IEFW1FAK(IEFXV001)
 CHANGE IEFW2FAK(IEFXV001)
 CHANGE IEFXK000(IEFXV001)
 INCLUDE CI505(IEFWD000)
 INCLUDE CI505(IEFCVFAK)
 CHANGE IEFQASGN(IEFQMRAW)
 INCLUDE CI505(IEFQMLK1)
 INCLUDE CI505(IEFQMRAW)
 INCLUDE CI535(IEFSD111)
 ALIAS IEFXV001
 ENTRY IEFXV001
 NAME IEFXVAVR(R)
 INCLUDE CI505(IEFWA000,IEFX300A)
 INCLUDE CI505(IEFAVFAK)
 INCLUDE CI505(IEFWSWIN)
 CHANGE IEFSEPAR(IEFW41SD)
 INCLUDE SYSPUNCH(IEFSGOPT)
 INCLUDE CI505(IEFSCAN)
 INCLUDE CI505(IEFXDPTH)
 INCLUDE CI505(IEFSD552)
 INCLUDE CI505(IEFX5000,IEFWCIMP,IEFXH000)
 INCLUDE CI535(IEFSD111)
 INCLUDE CI505(IEFQMLK1,IEFYSVMS)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ,IEFQMRAW)
 INCLUDE CI505(IEFWDFAK,IEFXJFAK,IEF41FAK)
 INCLUDE CI505(IEFSD551)
 INCLUDE SYSPUNCH(IEFDEVPT)
 ALIAS IEFWC000
 ENTRY IEFWA000
 NAME IEFWA000(R)
 INCLUDE CI505(IEEVPRES,IEFK1MSG,IEFPRES)
 INCLUDE CI505(IEFSCAN)
 INCLUDE SYSPUNCH(IEFDEVPT)
 ENTRY IEEVPRES
 NAME IEEVPRES(R)
 INCLUDE CI505(IEFWD000,IEFWD001)
 INCLUDE CI505(IEFXT00D,IEFXTDMY,IEFSD195,IEFSD096)
 CHANGE IEFW41SD(IEFWEXTA)
 INCLUDE CI505(IEFXT002)
 INCLUDE CI505(IEFSD097,IEFQMLK1,IEFYSVMS,IEFQMRAW)
 INCLUDE CI505(IEFXT003)
 INCLUDE CI505(IEFXKFAK)
 INCLUDE CI505(IEFWEXTA)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ,IEFSD41Q,IEFXJFAK)
 INCLUDE CI505(IEFVMMS1)
 INCLUDE CI535(IEFSD111)
 INCLUDE CI505(IEFXTMSG)
 INCLUDE CI505(IEFCVFAK)
 ALIAS IEFW41SD
 ENTRY IEFWD000
 NAME IEFWD000(R)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFVMLS6,IEFVMLS7)
 INCLUDE CI505(IEFSD195,IEFSD096)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFXJIMP,IEFXJMSG)
 CHANGE IEFYN(IEFW41SD)
 INCLUDE CI505(IEFXKIMP,IEFXKMSG)
 INCLUDE CI505(IEFSD41Q,IEFXAFAK)
 INCLUDE CI505(IEFCVFAK,IEFVMMS1,IEFQMLK1)
 INCLUDE CI505(IEFYSVMS,IEFQMRAW)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 INCLUDE CI535(IEFSD111)
 ALIAS IEFXJX5A,IEFV15XL,IEFXJ000,IEFXK000
 ENTRY IEFVM6
 NAME IEFVM6LS(R)
 INCLUDE CI535(IEEPALTR)
 NAME IEEPALTR(R)
 INCLUDE CI505(IEFPRTXX)
 ALIAS IEFPRT,SPRINTER
 NAME IEFPRINT(R)
 INCLUDE SYSPUNCH(IEEVIPL)
 INCLUDE DN539(ICFBIX00)
 ENTRY IEEVIPL
 NAME IEEVIPL(R)
 INCLUDE CI555(IEEVSIPL)
 NAME IEEVSIPL(R)
 INCLUDE CI505(IEE2103D)
 NAME IEE2103D(R)
 INCLUDE CI535(IEECVINT)
 INCLUDE CI505(IEEVRFRX)
 ENTRY IEECVCTI
 NAME IEECVCTI(R)
 INCLUDE CI535(IEEVDSP1,IEEVDRGN)
 ENTRY IEEVDSP1
 NAME IEEVDSP1(R)
/*
//SG64 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET,REFR,REUS'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI535(IEFIRC)
 INCLUDE CI505(IEEVSMSG)
 ENTRY IEFIRC
 NAME IEFIRC(R)
 INCLUDE CI505(IEFVH1,IEEVSMSG)
 CHANGE IEFK2(IEFVH2)
 INCLUDE CI505(IEFVH2)
 ENTRY IEFVH1
 NAME IEFVH1(R)
 CHANGE IEFK3(IEFVHN)
 INCLUDE CI505(IEFVHN)
 NAME IEFVHN(R)
 CHANGE INEPKG03(IEFVHA)
 INCLUDE CI505(IEFVHA)
 INCLUDE CI505(IEFVHAA,IEFVHB,IEFVHC)
 INCLUDE CI505(IEFVHCB,IEFVHE,IEFVHEB,IEFVHEC)
 INCLUDE CI505(IEFVHF,IEFVHL,IEFHMFAK,IEFVHG)
 INCLUDE CI505(IEFVHH,IEFVHQ,IEFVFA,IEFVGK)
 INCLUDE CI505(IEFVGT,IEFVGM,IEFJAFAK,IEFVEA)
 INCLUDE CI505(IEFVDA,IEFVGI,IEFVGS)
 INCLUDE CI535(IEFHRFK1)
 INCLUDE CI505(IEFVSD12,IEFVSD13)
 INCLUDE CI505(IEFVDBSD)
 INCLUDE CI505(IEFACT)
 INCLUDE CI505(IEFVHHB,IEFQMDUM,IEFVFB)
 INCLUDE CI535(IEFVKG)
 INCLUDE CI505(IEFVIND)
 ALIAS IEFVHCB
 ALIAS IEFVHREP
 ALIAS IEFVHF
 ENTRY IEFVHA
 NAME IEFVHA(R)
 INCLUDE CI535(IEFHRFK2)
 INCLUDE CI535(IEFVHR)
 ALIAS IEFHRFK2
 NAME IEFMVTHR(R)
 CHANGE IEFQMSSS(IEFVHQ)
 INCLUDE CI505(IEFVHQ,IEFHFFAK,IEFVGM)
 INCLUDE CI505(IEFVGT,IEFVGK,IEFVJA)
 INCLUDE CI535(IEFVHR)
 ALIAS IEFVJA
 ENTRY IEFVJA
 NAME IEFMVTJA(R)
 CHANGE IEFQMSSS(IEFVHQ)
 INCLUDE CI505(IEFVHQ,IEFVHM,IEFVGM)
 INCLUDE CI505(IEFHAFAK)
 INCLUDE CI535(IEFVHR)
 ALIAS IEFVHM
 ENTRY IEFVHM
 NAME IEFMVTHM(R)
 INCLUDE CI505(IEFVINA,IEFVINB,IEFVINC,IEFVINE)
 INCLUDE CI505(IEZNCODE,IEFVGM)
 CHANGE IEFQMSSS(IEFVHQ)
 INCLUDE CI505(IEFVHQ)
 INCLUDE CI535(IEFVHR)
 ENTRY IEFVINA
 NAME IEFVINA(R)
 INCLUDE CI505(IEZDCODE)
 NAME IEZDCODE(R)
 INCLUDE CI535(IEFSD162,IEFSD103,IEF064SD)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ,IEFQMRAW,IEFSD514)
 INCLUDE CI535(IEFSD110,IEFSD111,IEFSD112)
 INCLUDE CI535(IEF061SD)
 ALIAS IEFV4221
 ENTRY IEFSD062
 NAME IEFSD062(R)
 INCLUDE CI535(IEFSD161,IEFSD164,IEFSD166)
 INCLUDE CI535(IEFDSTBL,IEFDSLST,IEFDSTRT)
 INCLUDE CI505(IEFACTFK)
 REPLACE IEFUJI
 REPLACE IEFUSI
 INCLUDE CI505(IEFBR14)
 CHANGE IEFSMFIE(IEFBR14)
 INCLUDE CI535(IEFSD101,IEFSD104)
 INCLUDE CI505(IEFSDPPT)
 INCLUDE CI505(IEFIDMPM,IEFSD42Q,IEFIDUMP)
 INCLUDE CI505(IEFYNIMP,IEFYPJB3,IEFVJIMP,IEFZGST1)
 INCLUDE CI505(IEFZGST2)
 INCLUDE CI505(IEFSD22Q,IEFZGMSG,IEFZHMSG)
 INCLUDE CI505(IEFWTERM,IEFSD31Q)
 INCLUDE CI505(IEFSD32Q)
 INCLUDE CI535(IEF060SD)
 INCLUDE CI505(IEFYTVMS,IEFQMLK1,IEFYSVMS)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 INCLUDE CI505(IEFQMRAW,IEFQMNQQ,IEFQMDQQ,IEFQDELQ)
 INCLUDE CI505(IEFQMUNQ,IEFVJMSG,IEFYNMSG,IEFYPMSG)
 INCLUDE CI535(IEFSD110,IEFSD111,IEFSD112)
 INCLUDE CI505(IEFZAJB3,IEFZGJB1)
 INCLUDE CI505(IEFRPREP)
 INCLUDE CI505(IEFSD514)
 CHANGE IEFSD598(IEFSD061),IEFSD510(IEFSD061)
 INCLUDE CI505(IEFSD168)
 INCLUDE CI505(IEFVSDRA)
 INCLUDE SYSPUNCH(IEFYRCDS)
 ALIAS IEFSD064
 ALIAS IEFW42SD
 ALIAS IEFSD104
 ENTRY IEFSD061
 NAME IEFSD061(R)
/*
//SG65 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//CI555 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI555
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI505(IEFSD055,IEFORMAT,IEF300SD,IEF304SD)
 INCLUDE CI505(IEFSD311)
 INCLUDE SYSPUNCH(IEFQMSGV)
 ENTRY IEFSD055
 NAME IEFSQINT(R)
 INCLUDE CI505(IEFSD312)
 INCLUDE CI505(IEFSD300,IEFSD301,IEFSD302)
 INCLUDE CI505(IEFSD303,IEFSD310)
 ENTRY IEFSD300
 NAME IEFSD300(R)
 INCLUDE CI505(IEFSD304,IEFSD305)
 INCLUDE CI505(IEFSD310,IEFSD312)
 CHANGE IEFSD111(IEFQMNQ2),IEFSD112(IEFQMNQ2)
 INCLUDE CI505(IEFQMNQQ)
 CHANGE IEFSD112(IEFQDELE)
 INCLUDE CI505(IEFQDELQ)
 INCLUDE CI505(IEFVSDRD)
 INCLUDE CI505(IEFVSDRA)
 INCLUDE CI505(IEFSD514)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 CHANGE IEFSD111(IEFQMRAW)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 ENTRY IEFSD305
 NAME IEFSD304(R)
 INCLUDE CI505(IEFSD308)
 NAME IEFSD308(R)
 INCLUDE CI505(IEEVSTAR,IEEVJCL)
 ENTRY IEEVSTAR
 NAME IEEVSTAR(R)
 INCLUDE CI535(IEEPRWI2)
 NAME IEEPRWI2(R)
 INCLUDE CI535(IEEVMNT1)
 INCLUDE CI505(IEEVJCL)
 ENTRY IEEVMNT1
 NAME IEEVMNT1(R)
 INCLUDE CI535(IEEVMNT2)
 INCLUDE CI505(IEEVSMSG)
 ENTRY IEEVMNT2
 NAME IEEVMNT2(R)
 INCLUDE CI505(IEEVRCTL)
 NAME IEEVRCTL(R)
 INCLUDE CI505(IEEVRC)
 INCLUDE CI505(IEEVSMSG,IEFCNVRT,IEFRDWRT)
 INCLUDE CI535(IEEVICTL)
 ALIAS IEEVIC
 ENTRY IEEVRC
 NAME IEEVRC(R)
 INCLUDE CI505(IEEVOMSG)
 NAME IEEVOMSG(R)
 INCLUDE CI505(IEFVINB)
 NAME IEFVINB(R)
 INCLUDE CI505(IEZNCODE)
 NAME IEZNCODE(R)
 INCLUDE CI535(IEFVMA)
 ENTRY IEFVMA
 NAME IEFVMA(R)
 INCLUDE CI535(IEFVMB)
 CHANGE IEFSD110(IEFQAGST)
 INCLUDE CI505(IEFQAGST)
 CHANGE IEFSD111(IEFQASGN)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 CHANGE IEFSD111(IEFQMNQ2),IEFSD112(IEFQMNQ2)
 INCLUDE CI505(IEFQMNQQ)
 INCLUDE CI505(IEZNCODE)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 ENTRY IEFVMB
 NAME IEFVMB(R)
 INCLUDE CI535(IEFVMBC)
 ENTRY IEFVMBC
 NAME IEFVMBC(R)
 INCLUDE CI535(IEFVMC)
 ENTRY IEFVMC
 NAME IEFVMC(R)
 INCLUDE CI535(IEFVMD)
 CHANGE IEFSD112(IEFQDELE)
 INCLUDE CI505(IEFQDELQ)
 ENTRY IEFVMD
 NAME IEFVMD(R)
 INCLUDE CI535(IEFVME)
 ENTRY IEFVME
 NAME IEFVME(R)
 INCLUDE CI535(IEFVMF)
 INCLUDE CI535(IEFVMG)
 INCLUDE CI535(IEFVMH)
 INCLUDE CI535(IEFSD110)
 INCLUDE CI535(IEFSD111)
 INCLUDE CI535(IEFSD112)
 INCLUDE CI505(IEFQBVMS)
 INCLUDE CI505(IEFQMRAW)
 INCLUDE CI505(IEFQMNQQ)
 INCLUDE CI505(IEFQAGST)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 INCLUDE CI505(IEFQMDQQ)
 INCLUDE CI505(IEFQDELQ)
 INCLUDE CI505(IEFQMUNQ)
 INCLUDE CI505(IEZDCODE)
 ENTRY IEFVMF
 NAME IEFVMF(R)
 INCLUDE CI505(IEEVICLR)
 ALIAS IEFICR
 NAME IEEVICLR(R)
 INCLUDE CI505(IEEVLDSP)
 NAME IEEVLDSP(R)
 INCLUDE CI505(IEEVLOUT)
 NAME IEEVLOUT(R)
 INCLUDE CI505(IEFLOCDQ,IEFCNVRT,IEFRDWRT)
 ALIAS LOC,LOCDQ,LOCCAN
 ENTRY IEFLOCDQ
 NAME IEFLOCDQ(R)
 INCLUDE CI535(IEEVLIN1)
 INCLUDE CI505(IEEVRFRX)
 ENTRY IEEVLIN
 NAME IEEVLIN(R)
 INCLUDE CI535(IEELOG01)
 NAME IEEVLIN2(R)
 INCLUDE CI535(IEEVLIN3)
 NAME IEEVLIN3(R)
 INCLUDE CI535(IEEPPRES)
 ENTRY IEEPPRES
 NAME IEEPPRES(R)
 INCLUDE CI505(IEFRCLN1)
 NAME IEFRCLN1(R)
 INCLUDE CI505(IEFRCLN2)
 NAME IEFRCLN2(R)
 INCLUDE CI505(IEFVRRC)
 INCLUDE CI505(IEFSD514)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 CHANGE IEFSD111(IEFQASGN)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 ALIAS IEFVRRCA,IEFVRRCB
 ENTRY IEFVRRC
 NAME IEFVRRC(R)
 INCLUDE CI505(IEFVRR1)
 INCLUDE CI505(IEFLOCDQ,IEFCNVRT,IEFRDWRT)
 ENTRY IEFVRR1
 NAME IEFVRR1(R)
 INCLUDE CI505(IEFVRR2)
 ENTRY IEFVRR2
 ALIAS IEFVR2AE
 NAME IEFVRR2(R)
 INCLUDE CI505(IEFVRR3)
 INCLUDE CI505(IEFQDELQ)
 INCLUDE CI535(IEFSD112)
 ENTRY IEFVRR3
 ALIAS IEFVR3AE
 NAME IEFVRR3(R)
/*
//SG66 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI505(IEESD562)
 ENTRY IEESD562
 ALIAS IEESD562
 NAME IEEVDNX1(R)
 INCLUDE CI505(IEESD563)
 ENTRY IEESD563
 NAME IEESD563(R)
 INCLUDE CI505(IEESD564)
 ENTRY IEESD564
 NAME IEESD564(R)
 INCLUDE CI505(IEESD584)
 NAME IEESD584(R)
 INCLUDE CI505(IEESD565)
 ENTRY IEESD565
 NAME IEESD565(R)
 INCLUDE CI505(IEESD575,IEESD581)
 ENTRY IEESD575
 ALIAS IEESD581
 NAME IEESD575(R)
 CHANGE IEFSD112(IEESD576)
 INCLUDE CI505(IEFQDELQ,IEESD576,IEESD580)
 ENTRY IEESD576
 ALIAS IEESD580
 NAME IEESD576(R)
 INCLUDE CI505(IEESD577)
 CHANGE IEFSD111(IEFQMNQ2),IEFSD112(IEFQMNQ2)
 INCLUDE CI505(IEFQMNQQ)
 ENTRY IEESD577
 NAME IEESD577(R)
 INCLUDE CI505(IEESD579)
 CHANGE IEFSD111(IEFQMNQ2),IEFSD112(IEFQMNQ2)
 INCLUDE CI505(IEFQMNQQ)
 ENTRY IEESD579
 NAME IEESD579(R)
 INCLUDE CI505(IEESD578)
 ENTRY IEESD578
 NAME IEESD578(R)
 INCLUDE CI505(IEESD582)
 ENTRY IEESD582
 ALIAS IEESD82A
 NAME IEESD582(R)
 INCLUDE CI505(IEESD583)
 ENTRY IEESD583
 NAME IEESD583(R)
 INCLUDE CI505(IEFBR14)
 NAME IEFBR14(R)
/*
//SG67 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI535(IEELWAIT)
 NAME IEELWAIT(R)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 INCLUDE CI505(IEFDSDRP)
 CHANGE IEFSD111(IEFQMRAW)
 CHANGE IEFSD113(IEFQMRAW)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 CHANGE IEFQMNQ2(IEFQMRAW)
 CHANGE IEFQDELE(IEFQMRAW)
 CHANGE IEFQAGST(IEFQMRAW)
 INCLUDE CI505(IEFQBVMS)
 INCLUDE SYSPUNCH(IEFDEVPT)
 ENTRY IEFDSDRP
 NAME IEFDSDRP(R)
 INCLUDE CI505(IEFRSTRT)
 ALIAS IEFSMR
 NAME IEFRSTRT(R)
 INCLUDE CI535(IEFIIC)
 NAME IEFIIC(R)
 INCLUDE CI535(IEEPRTN2)
 ALIAS IEERGN
 NAME IEEPRTN(R)
 INCLUDE CI535(IEFSD160,IEF061SD)
 ENTRY IEFSD060
 NAME IEFSD060(R)
 INCLUDE CI535(IEFSD102)
 ENTRY IEFSD102
 NAME IEFSD102(R)
 INCLUDE CI505(IEEVRJCL,IEEPSN)
 ENTRY IEEVRJCL
 ALIAS IEEPSN
 NAME IEEVRJCL(R)
 INCLUDE CI505(IEEVLNKT)
 NAME IEEVLNKT(R)
 INCLUDE CI535(IEEVWAIT)
 ALIAS IEEVWDAR
 NAME IEEVWAIT(R)
 INCLUDE CI505(IEFBR14)
 CHANGE IEFSMFAT(IEFBR14)
 INCLUDE CI535(IEFSD263)
 ENTRY IEFSD263
 NAME IEFSD263(R)
 INCLUDE CI535(IEFDSOLP)
 NAME IEFDSOLP(R)
 INCLUDE CI505(IEFSD078,IEF079SD)
 ENTRY IEFSD078
 NAME IEFSD078(R)
 INCLUDE CI505(IEFSD070)
 ALIAS IEFSD70A
 NAME IEFSD070(R)
 INCLUDE CI505(IEFSDXYZ)
 ENTRY IEFSDXYZ
 NAME IEFSDXYZ(R)
 INCLUDE CI505(IEFSD080,IEFSD081,IEFSD083)
 INCLUDE CI505(IEFQMUNQ,IEFSD082)
 INCLUDE CI505(IEFSD079,IEFSD084,IEF078SD)
 CHANGE IEFSD112(IEFQDELE)
 INCLUDE  CI505(IEFQDELQ)
 CHANGE IEFSD110(IEFQMDQ2),IEFSD111(IEFQMDQ2)
 INCLUDE CI505(IEFQMDQQ)
 ALIAS IEEVWTR1
 ALIAS IEFSD079
 ENTRY IEFSD080
 NAME IEFSD080(R)
 INCLUDE CI505(IEFSD085,IEFSD171)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 ALIAS IEF085SD
 ALIAS IEF850SD
 ALIAS IEFSD071
 ENTRY IEFSD085
 NAME IEFSD085(R)
 INCLUDE CI505(IEFSD086,IEFSD088,IEFSD089)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 ALIAS IEF086SD
 ENTRY IEFSD086
 NAME IEFSD086(R)
 INCLUDE CI505(IEFSD087,IEFSD088,IEFSD089)
 ENTRY IEFSD087
 NAME IEFSD087(R)
 INCLUDE CI505(IEFSD094,IEFSD095)
 INCLUDE CI505(IEFSD088,IEFSD089)
 ENTRY IEFSD094
 NAME IEFSD094(R)
 INCLUDE CI505(IEFSDXXX)
 ENTRY IEFSDXXX
 NAME IEFSDXXX(R)
 INCLUDE CI505(IEFSDTTE)
 ENTRY IEFSDTTE
 NAME IEFSDTTE(R)
 CHANGE IEFSD111(IEFQMNQ2),IEFSD112(IEFQMNQ2)
 INCLUDE CI505(IEFQMNQQ)
 NAME IEFQMNQ2(R)
 CHANGE IEFSD110(IEFQMDQ2),IEFSD111(IEFQMDQ2)
 INCLUDE CI505(IEFQMDQQ)
 ALIAS IEFQMDQ2
 NAME IEFQMDQQ(R)
 CHANGE IEFSD112(IEFQDELE)
 INCLUDE CI505(IEFQDELQ)
 NAME IEFQDELE(R)
 INCLUDE CI505(IEFQMUNQ)
 NAME IEFQMUNC(R)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 NAME IEFQMRAW(R)
 INCLUDE CI505(IEFQINTZ)
 NAME IEFQINTZ(R)
 INCLUDE CI535(IEFSD0XX)
 NAME IEFSD0XX(R)
 INCLUDE CI505(IEFSD105)
 ENTRY IEFSD105
 NAME IEFSD105(R)
 INCLUDE CI505(IEFQBVMS)
 CHANGE IEFSD110(IEFQAGST)
 INCLUDE CI505(IEFQAGST)
 CHANGE IEFSD111(IEFQASGN)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ)
 CHANGE IEFSD111(IEFQMNQ2),IEFSD112(IEFQMNQ2)
 INCLUDE CI505(IEFQMNQQ)
 CHANGE IEFSD111(IEFQMRAW)
 INCLUDE CI505(IEFQMRAW)
 INCLUDE CI535(IEFIRCB)
 ALIAS IEFIRCB
 ENTRY IEFQMSSS
 NAME IEFQMSSS(R)
 INCLUDE CI505(IEE0503D)
 NAME IEE0503D(R)
 INCLUDE CI505(IEFQAGST)
 INCLUDE CI535(IEFSD110)
 ENTRY IEFQAGST
 NAME IEFQMSTK(R)
 CHANGE IEFSD110(IEFQMRAW)
 INCLUDE CI505(IEFQAGST)
 CHANGE IEFSD572(IEFQASGN)
 INCLUDE CI505(IEFQASGQ,IEFQBVMS)
 CHANGE IEFSD112(IEFQMRAW)
 INCLUDE CI505(IEFQMNQQ)
 INCLUDE CI505(IEFQMRAW)
 INCLUDE CI535(IEFSD111)
 ENTRY IEFQMSSS
 NAME IEFQMSK1(R)
 INCLUDE CI505(IEFDSOCP)
 ENTRY IEFDSOCP
 NAME IEFDSO(R)
 CHANGE IEFSD514(IEFDSOSM)
 CHANGE IEFQMRAW(IEFDSOSM)
 INCLUDE CI505(IEFDSOSM)
 NAME IEFDSOSM(R)
 INCLUDE CI505(IEFDSOAL)
 NAME IEFDSOAL(R)
 INCLUDE CI505(IEFDSOWR)
 NAME IEFDSOWR(R)
 INCLUDE CI505(IEFVGM1)
 NAME IEFVGM1(R)
 INCLUDE CI505(IEFVGM2)
 NAME IEFVGM2(R)
 INCLUDE CI505(IEFVGM3)
 NAME IEFVGM3(R)
 INCLUDE CI505(IEFVGM4)
 NAME IEFVGM4(R)
 INCLUDE CI505(IEFVGM5)
 NAME IEFVGM5(R)
 INCLUDE CI505(IEFVGM6)
 NAME IEFVGM6(R)
 INCLUDE CI505(IEFVGM7)
 NAME IEFVGM7(R)
 INCLUDE CI505(IEFVGM8)
 NAME IEFVGM8(R)
 INCLUDE CI505(IEFVGM9)
 NAME IEFVGM9(R)
 INCLUDE CI505(IEFVGM10)
 NAME IEFVGM10(R)
 INCLUDE CI505(IEFVGM11)
 NAME IEFVGM11(R)
 INCLUDE CI505(IEFVGM12)
 NAME IEFVGM12(R)
 INCLUDE CI505(IEFVGM13)
 NAME IEFVGM13(R)
 INCLUDE CI505(IEFVGM14)
 NAME IEFVGM14(R)
 INCLUDE CI505(IEFVGM15)
 NAME IEFVGM15(R)
 INCLUDE CI505(IEFVGM16)
 NAME IEFVGM16(R)
 INCLUDE CI505(IEFVGM17)
 NAME IEFVGM17(R)
 INCLUDE CI505(IEFVGM18)
 NAME IEFVGM18(R)
 INCLUDE CI505(IEFVGM19)
 NAME IEFVGM19(R)
 INCLUDE CI505(IEFVGM67)
 NAME IEFVGM67(R)
 INCLUDE CI505(IEFVGM70)
 NAME IEFVGM70(R)
 INCLUDE CI505(IEFVGM71)
 NAME IEFVGM71(R)
 INCLUDE CI505(IEFVGM76)
 NAME IEFVGM76(R)
 INCLUDE CI505(IEFVGM78)
 NAME IEFVGM78(R)
/*
//SG68 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,DC'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//DN527 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN527
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN527(IFCEREP0)
 NAME IFCEREP0(R)
 INCLUDE DN527(IFCEP005)
 NAME IFCEP005(R)
 INCLUDE DN527(IFCEP007)
 NAME IFCEP007(R)
 INCLUDE DN527(IFCEP008)
 NAME IFCEP008(R)
 INCLUDE DN527(IFCEP009)
 NAME IFCEP009(R)
 INCLUDE DN527(IFCRE002)
 NAME IFCRE002(R)
 INCLUDE DN527(IFCRE003)
 NAME IFCRE003(R)
 INCLUDE DN527(IFCMSG00)
 NAME IFCMSG00(R)
 INCLUDE DN527(IFCMES00)
 NAME IFCMES00(R)
 INCLUDE DN527(IFCECUA0)
 NAME IFCECUA0(R)
 INCLUDE DN527(IFCSCUA0)
 NAME IFCSCUA0(R)
 INCLUDE DN527(IFCEVOL0)
 NAME IFCEVOL0(R)
 INCLUDE DN527(IFCSVOL0)
 NAME IFCSVOL0(R)
 INCLUDE DN527(IFCEUKNO)
 ALIAS IFCEUCPU
 ALIAS IFCEUCCH
 ALIAS IFCEUTYP
 ALIAS IFCEUOBR
 NAME IFCEUKNO(R)
 INCLUDE DN527(IFCSUKNO)
 ALIAS IFCSUCPU
 ALIAS IFCSUCCH
 ALIAS IFCSUTYP
 ALIAS IFCSUOBR
 NAME IFCSUKNO(R)
 INCLUDE DN527(IFCEXXXX)
 NAME IFCEXXXX(R)
 INCLUDE DN527(IFCSXXXX)
 NAME IFCSXXXX(R)
 INCLUDE DN527(IFCEXXX0)
 ALIAS IFCE2955
 ALIAS IFCE2703
 ALIAS IFCE2702
 NAME IFCE2701(R)
 INCLUDE DN527(IFCSXXX0)
 ALIAS IFCS2955
 ALIAS IFCS2703
 ALIAS IFCS2702
 NAME IFCS2701(R)
 INCLUDE DN527(IFCEXXX1)
 ALIAS IFCE2495
 ALIAS IFCE2520
 ALIAS IFCE2501
 ALIAS IFCE1442
 NAME IFCE2540(R)
 INCLUDE DN527(IFCSXXX1)
 ALIAS IFCS2495
 ALIAS IFCS2520
 ALIAS IFCS2501
 ALIAS IFCS1442
 NAME IFCS2540(R)
 INCLUDE DN527(IFCEXXX2)
 ALIAS IFCE3210
 ALIAS IFCE3215
 ALIAS IFCE3213
 ALIAS IFCE1053
 ALIAS IFCE2150
 ALIAS IFCE1052
 ALIAS IFCE1445
 NAME IFCE1403(R)
 INCLUDE DN527(IFCSXXX2)
 ALIAS IFCS3210
 ALIAS IFCS3215
 ALIAS IFCS3213
 ALIAS IFCS1053
 ALIAS IFCS2150
 ALIAS IFCS1052
 ALIAS IFCS1445
 NAME IFCS1403(R)
 INCLUDE DN527(IFCEXXX3)
 ALIAS IFCE2671
 ALIAS IFCE1285
 ALIAS IFCE1275
 ALIAS IFCE1419
 NAME IFCE1443(R)
 INCLUDE DN527(IFCSXXX3)
 ALIAS IFCS2671
 ALIAS IFCS1285
 ALIAS IFCS1275
 ALIAS IFCS1419
 NAME IFCS1443(R)
 INCLUDE DN527(IFCEXXX4)
 ALIAS IFCE2321
 ALIAS IFCE2303
 ALIAS IFCE2302
 NAME IFCE2311(R)
 INCLUDE DN527(IFCSXXX4)
 ALIAS IFCS2321
 ALIAS IFCS2303
 ALIAS IFCS2302
 NAME IFCS2311(R)
 INCLUDE DN527(IFCEXXX5)
 NAME IFCE2301(R)
 INCLUDE DN527(IFCSXXX5)
 NAME IFCS2301(R)
 INCLUDE DN527(IFCEXXX6)
 NAME IFCE2314(R)
 INCLUDE DN527(IFCSXXX6)
 NAME IFCS2314(R)
 INCLUDE DN527(IFCEXXX7)
 ALIAS IFCE2245
 ALIAS IFCE3158
 ALIAS IFCE3277
 ALIAS IFCE3284
 ALIAS IFCE3286
 NAME IFCE1015(R)
 INCLUDE DN527(IFCSXXX7)
 ALIAS IFCS2245
 ALIAS IFCS3158
 ALIAS IFCS3277
 ALIAS IFCS3284
 ALIAS IFCS3286
 NAME IFCS1015(R)
 INCLUDE DN527(IFCEXXX8)
 ALIAS IFCE5450
 ALIAS IFCE3066
 ALIAS IFCE1288
 NAME IFCE1287(R)
 INCLUDE DN527(IFCSXXX8)
 ALIAS IFCS5450
 ALIAS IFCS3066
 ALIAS IFCS1288
 NAME IFCS1287(R)
 INCLUDE DN527(IFCEXXX9)
 ALIAS IFCE2282
 ALIAS IFCE2280
 ALIAS IFCE2260
 ALIAS IFCE3505
 ALIAS IFCE3525
 NAME IFCE2250(R)
 INCLUDE DN527(IFCSXXX9)
 ALIAS IFCS2282
 ALIAS IFCS2280
 ALIAS IFCS2260
 ALIAS IFCS3505
 ALIAS IFCS3525
 NAME IFCS2250(R)
 INCLUDE DN527(IFCEXXXA)
 ALIAS IFCE3211
 NAME IFCE2400(R)
 INCLUDE DN527(IFCSXXXA)
 ALIAS IFCS3211
 NAME IFCS2400(R)
 INCLUDE DN527(IFCEXXXB)
 NAME IFCE3420(R)
 INCLUDE DN527(IFCSXXXB)
 NAME IFCS3420(R)
 INCLUDE DN527(IFCEXXXC)
 ALIAS IFCET001
 NAME IFCE3330(R)
 INCLUDE DN527(IFCEMER0)
 NAME IFCEMER0(R)
 INCLUDE DN527(IFCEMER1)
 NAME IFCEMER1(R)
 INCLUDE DN527(IFCEMER2)
 NAME IFCEMER2(R)
 INCLUDE DN527(IFCEMER3)
 NAME IFCEMER3(R)
 INCLUDE DN527(IFCEMER4)
 NAME IFCEMER4(R)
 INCLUDE DN527(IFCEMER5)
 NAME IFCEMER5(R)
 INCLUDE DN527(IFCSXXXC)
 ALIAS IFCST001
 NAME IFCS3330(R)
 INCLUDE DN527(IFCET003)
 NAME IFCET003(R)
 INCLUDE DN527(IFCST003)
 NAME IFCST003(R)
 INCLUDE DN527(IFCET004)
 NAME IFCET004(R)
 INCLUDE DN527(IFCET005)
 NAME IFCET005(R)
 INCLUDE DN527(IFCETRN0)
 NAME IFCETRN0(R)
 INCLUDE DN527(IFCETRN1)
 NAME IFCETRN1(R)
 INCLUDE DN527(IFCETRN2)
 NAME IFCETRN2(R)
 INCLUDE DN527(IFCETRN3)
 NAME IFCETRN3(R)
 INCLUDE DN527(IFCETRN4)
 NAME IFCETRN4(R)
 INCLUDE DN527(IFCST005)
 NAME IFCST005(R)
 INCLUDE DN527(IFCET006)
 NAME IFCET006(R)
 INCLUDE DN527(IFCST006)
 NAME IFCST006(R)
 INCLUDE DN527(IFCET00B)
 NAME IFCET00B(R)
 INCLUDE DN527(IFCST00B)
 NAME IFCST00B(R)
 INCLUDE DN527(IFCE0050)
 NAME IFCE0050(R)
 INCLUDE DN527(IFCS0050)
 NAME IFCS0050(R)
 INCLUDE DN527(IFCSA050)
 NAME IFCSA050(R)
 INCLUDE DN527(IFCEI050)
 NAME IFCEI050(R)
 INCLUDE DN527(IFCSI050)
 NAME IFCSI050(R)
 INCLUDE DN527(IFCSIA50)
 NAME IFCSIA50(R)
/*
//SG69 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,DC,REUS'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//DN527 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN527
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN527(IFBSR000)
 ENTRY IFBINIT
 NAME IFBSR000(R)
 INCLUDE DN527(IFBSR050)
 NAME IFBSR050(R)
/*
//SG70 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,REUS,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IEHDASDR)
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHDASDR)
 NAME IEHDASDR(R)
 INCLUDE UT506(IEHDASDS,IEHDCONS)
 ENTRY IEHDASDS
 NAME IEHDASDS(R)
 INCLUDE UT506(IEHDPRNT,IEHDDATE)
 ENTRY IEHDPRNT
 NAME IEHDPRNT(R)
 INCLUDE UT506(IEHDMSGB,IEHDMSGS)
 ENTRY IEHDMSGB
 NAME IEHDMSGB(R)
 INCLUDE UT506(IEHDSCAN)
 NAME IEHDSCAN(R)
 INCLUDE UT506(IEHDREST)
 NAME IEHDREST(R)
 INCLUDE UT506(IEHDDUMP,IEHDEXCP,IEHDDOIO)
 ENTRY IEHDDUMP
 NAME IEHDDUMP(R)
 INCLUDE UT506(IEHDAOUT)
 NAME IEHDAOUT(R)
 INCLUDE UT506(IEHDANAL)
 NAME IEHDANAL(R)
 INCLUDE UT506(IEHDVTOC)
 NAME IEHDVTOC(R)
 INCLUDE UT506(IEHDCELL)
 NAME IEHDCELL(R)
 INCLUDE UT506(IEHDLABL)
 NAME IEHDLABL(R)
 INCLUDE UT506(IEHDGETA)
 NAME IEHDGETA(R)
 INCLUDE UT506(IEHDPASS)
 NAME IEHDPASS(R)
 INCLUDE UT506(IEHDRCVR)
 NAME IEHDRCVR(R)
/*
//SG71 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHIOSUP)
 NAME   IEHIOSUP(R)
/*
//SG72 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHATLAS,IEHMESS)
 ENTRY  IEHATLAS
 NAME   IEHATLAS(R)
/*
//SG73 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,OVLY,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IEBPTPCH)
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEBPPUN1,IEBPPMSG)
 INCLUDE UT506(IEBPPAL1,IEBCCS02)
 INCLUDE UT506(IEBPPCH1)
 ENTRY PRPCH        ** CANCEL OVERLAY FOR IEBPTPCH   **
 NAME   IEBPTPCH(R) ** WHEN MSG IEW0201 IS GENERATED **
 INCLUDE UT506(IEBGENRT,IEBGMESG)
 INCLUDE UT506(IEBCCS02,IEBGSCAN)
 INCLUDE UT506(IEBGENR3,IEBCONP2,IEBCONH2)
 INCLUDE UT506(IEBCONZ2,IEBEDIT2,IEBLENP2)
 INCLUDE UT506(IEBMOVE2)
 INCLUDE UT506(IEBGENS3)
 INCLUDE UT506(IEBGEN03)
 ENTRY IEBGENER     ** CANCEL OVERLAY FOR IEBGENER   **
 NAME   IEBGENER(R) ** WHEN MSG IEW0201 IS GENERATED **
 INCLUDE UT506(IEBCROOT,IEBCOMPM,IEBCULET)
 INCLUDE UT506(IEBCCS02,IEBCANAL)
 INCLUDE UT506(IEBCMAIN,IEBCQSAM)
 ENTRY COMPARE      ** CANCEL OVERLAY FOR IEBCOMPR   **
 NAME   IEBCOMPR(R) ** WHEN MSG IEW0201 IS GENERATED **
 INCLUDE UT506(IEBUPDTE,IEBUPLOG,IEBUPDT2,IEBUPXIT)
 INCLUDE UT506(IEBUPNIT)
 INCLUDE UT506(IEBASCAN,IEBBSCAN)
 ENTRY IEBUPDTE     ** CANCEL OVERLAY FOR IEBUPDTE   **
 NAME   IEBUPDTE(R) ** WHEN MSG IEW0201 IS GENERATED **
 INCLUDE UT506(IEBDSCPY,IEBVMS)
 INCLUDE UT506(IEBBAM,IEBDV1)
 INCLUDE UT506(IEBSCN)
 INCLUDE UT506(IEBVCT)
 INCLUDE UT506(IEBIOE)
 INCLUDE UT506(IEBDRD,IEBWSU,IEBDWR)
 INCLUDE UT506(IEBVDM)
 INCLUDE UT506(IEBMCM)
 INCLUDE UT506(IEBDRB)
 INCLUDE UT506(IEBVTM)
 INCLUDE UT506(IEBVTT)
 INSERT IEBDSCPY,IEBDSCP2,IEBDSMCA,IEBVMS,IEBVMTXT
 OVERLAY 1
 INSERT IEBBAM,IEBDV1,IEBDV1MG
 OVERLAY 1
 INSERT IEBSCN
 OVERLAY 1
 INSERT IEBVCT
 OVERLAY 1
 INSERT IEBIOE,IEBIOEMG
 OVERLAY 1
 INSERT IEBDRD,IEBDRDR,IEBWSU,IEBWSUMG,IEBDWR,IEBDWRR
 OVERLAY 2
 INSERT IEBVDM
 OVERLAY 2
 INSERT IEBMCM
 OVERLAY 2
 INSERT IEBDRB
 OVERLAY 2
 INSERT IEBVTM
 OVERLAY 2
 INSERT IEBVTT
 ENTRY IEBDSCPY
 NAME    IEBCOPY(R)
/*
//SG74 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,REUS,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHMVESI)
 NAME       IEHMVESI(R)
 INCLUDE UT506(IEHMVESH)
 NAME       IEHMVESH(R)
 INCLUDE UT506(IEHMVESU)
 NAME       IEHMVESU(R)
 INCLUDE UT506(IEHMVESO)
 NAME       IEHMVESO(R)
 INCLUDE UT506(IEHMVESP)
 NAME       IEHMVESP(R)
 INCLUDE UT506(IEHMVESC)
 NAME       IEHMVESC(R)
 INCLUDE UT506(IEHMVESK)
 NAME       IEHMVESK(R)
 INCLUDE UT506(IEHMVESR)
 NAME       IEHMVESR(R)
 INCLUDE UT506(IEHMVESJ)
 NAME       IEHMVESJ(R)
/*
//SG75 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,REUS'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IEHMVXSF)
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHMVXSF,IEHMVSSF)
 ENTRY   IEHMVXSF
 NAME    IEHMVXSF(R)
 INCLUDE UT506(IEHMVSRX,IEHMVSRM,IEHMVSSY)
 INCLUDE UT506(IEHMVMSY)
 ENTRY   IEHMVESY
 NAME    IEHMVESY(R)
 INCLUDE UT506(IEHMVSSX,IEHMVSRY,IEHMVSTC)
 INCLUDE UT506(IEHMVMRY)
 ENTRY   IEHMVESY
 NAME    IEHMVESV(R)
 INCLUDE UT506(IEHMVSRV,IEHMVSRZ,IEHMVSRK)
 INCLUDE UT506(IEHMVMRZ)
 ENTRY   IEHMVESZ
 NAME    IEHMVESX(R)
 INCLUDE UT506(IEHMVSSZ,IEHMVSSV)
 INCLUDE UT506(IEHMVMRZ)
 ENTRY   IEHMVESZ
 NAME    IEHMVESZ(R)
 INCLUDE UT506(IEHMVSRD,IEHMVSRM)
 ENTRY   IEHMVERD
 NAME    IEHMVERD(R)
 INCLUDE UT506(IEHMVSRA,IEHMVSRK)
 ENTRY   IEHMVERA
 NAME    IEHMVERA(R)
 INCLUDE UT506(IEHMVSTA,IEHMVSRK,IEHMVSRM)
 INCLUDE UT506(IEHMVMTA)
 ENTRY   IEHMVETA
 NAME    IEHMVETA(R)
 INCLUDE UT506(IEHMVSTL,IEHMVSRK,IEHMVSRM)
 INCLUDE UT506(IEHMVMTL)
 ENTRY   IEHMVETL
 NAME    IEHMVETL(R)
 INCLUDE UT506(IEHMVSSS)
 ENTRY   IEHMVESS
 NAME    IEHMVESS(R)
 INCLUDE UT506(IEHMVETG)
 ENTRY IEHMVETG
 NAME IEHMVETG(R)
 INCLUDE UT506(IEHMVESM)
 ENTRY IEHMVESM
 NAME IEHMVESM(R)
 INCLUDE UT506(IEHMVESL)
 ENTRY IEHMVESL
 NAME IEHMVESL(R)
 INCLUDE UT506(IEHMVETJ)
 ENTRY IEHMVETJ
 NAME IEHMVETJ(R)
 INCLUDE UT506(IEHMVESQ,IEHMVMSQ)
 ENTRY IEHMVESQ
 NAME IEHMVESQ(R)
 INCLUDE UT506(IEHMVESN,IEHMVMSN)
 ENTRY IEHMVESN
 NAME IEHMVESN(R)
 INCLUDE UT506(IEHMVESA)
 ENTRY IEHMVESA
 NAME IEHMVESA(R)
/*
//SG76 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHMVXSE)
 ALIAS      IEHMVESE
 NAME       IEHMVXSE(R)
 INCLUDE UT506(IEHMVEST)
 NAME       IEHMVEST(R)
 INCLUDE UT506(IEHMOVE)
 ENTRY IEHMVESD
 NAME       IEHMOVE(R)
/*
//SG77 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,RENT,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEBISAM)
 NAME IEBISAM(R)
 INCLUDE UT506(IEBISU,IEBISSO)
 ENTRY IEBISU
 NAME IEBISU(R)
 INCLUDE UT506(IEBISL,IEBISSI)
 ENTRY IEBISL
 NAME IEBISL(R)
 INCLUDE UT506(IEBISF,IEBISMES)
 ENTRY IEBISF
 NAME IEBISF(R)
 INCLUDE UT506(IEBISC)
 NAME IEBISC(R)
 INCLUDE UT506(IEBISPL)
 NAME IEBISPL(R)
/*
//SG78 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,RENT,REFR'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEBDG)
 NAME IEBDG(R)
 INCLUDE UT506(IEBDGCUP)
 NAME IEBDGCUP(R)
 INCLUDE UT506(IEBFDANL)
 NAME IEBFDANL(R)
 INCLUDE UT506(IEBFDTBL)
 NAME IEBFDTBL(R)
 INCLUDE UT506(IEBCRANL)
 NAME IEBCRANL(R)
 INCLUDE UT506(IEBCREAT)
 NAME IEBCREAT(R)
 INCLUDE UT506(IEBDGMSG)
 NAME IEBDGMSG(R)
/*
//SG79 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//DN539 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN539
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN539(IGFCCH35)
 ENTRY CCHNIPIN
 NAME IGFCCH35(R)
 INCLUDE DN539(IGFCCH48)
 ENTRY CCHNIPIN
 NAME IGFCCH48(R)
 INCLUDE DN539(IGFCCH60)
 ENTRY CCHNIPIN
 NAME IGFCCH60(R)
 INCLUDE DN539(IGFCCH68)
 ENTRY CCHNIPIN
 NAME IGFCCH68(R)
 INCLUDE DN539(IGFCCH70)
 ENTRY CCHNIPIN
 NAME IGFCCH70(R)
 INCLUDE DN539(IGFCCH80)
 ENTRY CCHNIPIN
 NAME IGFCCH80(R)
 INCLUDE DN539(IGFCCHIN)
 NAME IGFCCHIN(R)
/*
//SG80 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=151,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.SVCLIB
//DN539 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN539
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN539(IGC0008E)
 NAME IGC0008E(R)
 INCLUDE DN539(IGC0108E)
 NAME IGC0108E(R)
 INCLUDE DN539(IGC0208E)
 NAME IGC0208E(R)
 INCLUDE DN539(IGC0308E)
 NAME IGC0308E(R)
 INCLUDE DN539(IGC0408E)
 NAME IGC0408E(R)
 INCLUDE DN539(IGC0508E)
 NAME IGC0508E(R)
 INCLUDE DN539(IGC0608E)
 NAME IGC0608E(R)
 INCLUDE DN539(IGC0708E)
 NAME IGC0708E(R)
 INCLUDE DN539(IGC0808E)
 NAME IGC0808E(R)
 INCLUDE DN539(IGC0908E)
 NAME IGC0908E(R)
 INCLUDE DN539(IGE0660A)
 NAME IGE0660A(R)
/*
//SG81 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,REUS'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IFDOLT)
//DN533 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN533
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN533(IFDOLT00,IFDOLT18,IFDOLT23,IFDOLT29,IFDOLT30)
 INCLUDE DN533(IFDOLT39,IFDOLT51,IFDOLT52,IFDOLT48,IFDMSG00)
 INCLUDE CI505(IECIOLTS)
 INCLUDE DN533(IFDOLT59)
 ENTRY IFDOLT00
 ALIAS IFDOLT00
 NAME IFDOLT(R)
 INCLUDE DN533(IFDOLT01)
 NAME  IFDOLT01(R)
 INCLUDE DN533(IFDOLT02,IFDMSG02)
 ENTRY IFDOLT02
 NAME IFDOLT02(R)
 INCLUDE DN533(IFDOLT03,IFDMSG03)
 ENTRY IFDOLT03
 NAME  IFDOLT03(R)
 INCLUDE DN533(IFDOLT04,IFDMSG04)
 ENTRY IFDOLT04
 NAME IFDOLT04(R)
 INCLUDE DN533(IFDOLT05,IFDMSG05)
 ENTRY IFDOLT05
 NAME  IFDOLT05(R)
 INCLUDE DN533(IFDOLT06,IFDMSG06)
 ENTRY IFDOLT06
 NAME  IFDOLT06(R)
 INCLUDE DN533(IFDOLT07,IFDMSG07)
 ENTRY IFDOLT07
 NAME  IFDOLT07(R)
 INCLUDE DN533(IFDOLT08,IFDMSG08)
 ENTRY IFDOLT08
 NAME  IFDOLT08(R)
 INCLUDE DN533(IFDOLT09)
 NAME  IFDOLT09(R)
 INCLUDE DN533(IFDOLT10)
 NAME  IFDOLT10(R)
 INCLUDE DN533(IFDOLT11)
 NAME  IFDOLT11(R)
 INCLUDE DN533(IFDOLT13,IFDMSG13)
 ENTRY IFDOLT13
 NAME  IFDOLT13(R)
 INCLUDE DN533(IFDOLT14)
 NAME  IFDOLT14(R)
 INCLUDE DN533(IFDOLT15)
 NAME  IFDOLT15(R)
 INCLUDE DN533(IFDOLT16)
 NAME  IFDOLT16(R)
 INCLUDE DN533(IFDOLT17)
 NAME  IFDOLT17(R)
 INCLUDE DN533(IFDOLT20,IFDMSG20)
 ENTRY IFDOLT20
 NAME  IFDOLT20(R)
 INCLUDE DN533(IFDOLT21)
 NAME  IFDOLT21(R)
 INCLUDE DN533(IFDOLT22,IFDMSG22)
 ENTRY IFDOLT22
 NAME  IFDOLT22(R)
 INCLUDE DN533(IFDOLT24)
 NAME  IFDOLT24(R)
 INCLUDE DN533(IFDOLT25,IFDMSG25)
 ENTRY IFDOLT25
 NAME  IFDOLT25(R)
 INCLUDE DN533(IFDOLT26)
 NAME  IFDOLT26(R)
 INCLUDE DN533(IFDOLT31,IFDMSG31)
 ENTRY IFDOLT31
 NAME  IFDOLT31(R)
 INCLUDE DN533(IFDOLT32,IFDMSG32)
 ENTRY IFDOLT32
 NAME  IFDOLT32(R)
 INCLUDE DN533(IFDOLT33,IFDMSG33)
 ENTRY IFDOLT33
 NAME  IFDOLT33(R)
 INCLUDE DN533(IFDOLT34)
 NAME  IFDOLT34(R)
 INCLUDE DN533(IFDOLT35)
 ENTRY IFDOLT35
 NAME  IFDOLT35(R)
 INCLUDE DN533(IFDOLT36)
 ENTRY IFDOLT36
 NAME  IFDOLT36(R)
 INCLUDE DN533(IFDOLT37,IFDMSG37)
 ENTRY IFDOLT37
 NAME  IFDOLT37(R)
 INCLUDE DN533(IFDOLT38,IFDMSG38)
 ENTRY IFDOLT38
 NAME  IFDOLT38(R)
 INCLUDE DN533(IFDOLT41)
 NAME  IFDOLT41(R)
 INCLUDE DN533(IFDOLT44)
 ENTRY IFDOLT44
 NAME IFDOLT44(R)
 INCLUDE DN533(IFDOLT46)
 NAME  IFDOLT46(R)
 INCLUDE DN533(IFDOLT50,IFDMSG50)
 ENTRY IFDOLT50
 NAME  IFDOLT50(R)
 INCLUDE DN533(IFDOLT53,IFDMSG53)
 ENTRY IFDOLT53
 NAME  IFDOLT53(R)
 INCLUDE DN533(IFDOLT61,IFDMSG61)
 ENTRY IFDOLT61
 NAME IFDOLT61(R)
 INCLUDE DN533(IFDOLT73,IFDMSG73)
 ENTRY IFDOLT73
 NAME IFDOLT73(R)
 INCLUDE DN533(IFDOLT74)
 ENTRY IFDOLT74
 NAME IFDOLT74(R)
 INCLUDE DN533(IFDOLTAJ,IFDMSGAJ)
 ENTRY IFDOLTAJ
 NAME  IFDOLTAJ(R)
/*
//SG82 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,OL,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=151,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.IMAGELIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 REPLACE UCS1PN,UCS1TN   **UCS1AN**
 INCLUDE SYSPUNCH(UCSIMAGE)
 NAME UCS1AN(R)
 REPLACE UCS1AN,UCS1TN   **UCS1PN**
 INCLUDE SYSPUNCH(UCSIMAGE)
 NAME UCS1PN(R)
 REPLACE UCS1AN,UCS1PN   **UCS1TN**
 INCLUDE SYSPUNCH(UCSIMAGE)
 NAME UCS1TN(R)
/*
//SG83 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IEWSZOVR)
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE    CI535(IEWSWOVR)
 NAME   IEWSZOVR(R)
/*
//SG84 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,OVLY,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IHGUAP)
//UT506 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IHGROOT,IHGURD,IHGANY,IHGCTB)
 INCLUDE UT506(IHGUALOG,IHGTAB)
 INSERT IHGROOT
 OVERLAY  IHGSEGA
 INSERT   IHGURD
 OVERLAY  IHGSEGA
 INSERT   IHGANY
 OVERLAY  IHGSUBA
 INSERT   IHGCTB
 OVERLAY  IHGSUBA
 INSERT   IHGUALOG
 OVERLAY  IHGREG2(REGION)
 INSERT   IHGTAB
 ENTRY IHGROOT
 NAME IHGUAP(R)
 INCLUDE UT506(IEHPRINT,IEHPRMSG,IEHQSCAN,IEHMVSSF)
 ENTRY   IEHROOT    * * MSG IEW0201 VALID IF USER DID * *
 NAME    IEHLIST(R) * * NOT SPECIFY OVERLAY OPTION    * *
/*
//SG85 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,OVLY,XCAL'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IEHPROGM)
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHPROG1,IEHPROG2,IEHPROG3,IEHPROG4)
 INCLUDE UT506(IEHPROG5,IEHMVSSF)
 ENTRY   IEHEBASE   * * MSG IEW0201 VALID IF USER DID * *
 NAME    IEHPROGM(R) * * NOT SPECIFY OVERLAY OPTION   * *
/*
//SG86 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEHINITT)
 NAME IEHINITT(R)
 INCLUDE UT506(IEHPRNT)
 NAME IEHPRNT(R)
 INCLUDE UT506(IEHSCAN)
 NAME IEHSCAN(R)
/*
//SG87 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,REUS,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE UT506(IEBEDIT)
 NAME IEBEDIT(R)
/*
//SG88 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//DN554 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN554
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE DN554(IMDPRCTL,IMDPRCOM,IMDPRRDC)
 INCLUDE DN554(IMDPRPMG,IMDPRSEG)
 ENTRY IMDPRDMP
 NAME IMDPRDMP(R)
 INCLUDE DN554(IMDPRSCN,IMDPRSN2,IMDPRSN3,IMDPRSMG,IMDPREID)
 ENTRY IMDPRSCN
 NAME IMDPRSCN(R)
 INCLUDE DN554(IMDSYS01,IMDSY101)
 ENTRY IMDSYS01
 NAME IMDSYS01(R)
 INCLUDE DN554(IMDPRFRM,IMDPRFMG,IMDPRGET,IMDPRFLT)
 INCLUDE DN554(IMDPREXT,IMDPRAPP,IMDPRREC)
 ENTRY IMDPRFRM
 NAME IMDPRXED(R)
 INCLUDE DN554(IMCOSMCI,IMCOSAPP)
 ENTRY IMCOSMCI
 NAME IMCOSJQD(R)
/*
//SG89 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,REUS'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//CI505  DD  DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE CI505(IHLGTF01,IHLGTF02,IHLGTF03)
 ENTRY IHLGTF01
 NAME IHLGTF(R)
 INCLUDE CI505(IHLGTF11,IHLGTF12,IHLGTF13)
 ENTRY IHLGTF11
 NAME IHLGTF1(R)
 INCLUDE CI505(IHLSCAN1,IHLSCMSG)
 ENTRY IHLSCAN1
 NAME IHLSCAN(R)
 INCLUDE CI505(IHLINT21,IHLINT22)
 ENTRY IHLINT21
 NAME IHLINT2(R)
 INCLUDE CI505(IHLINT31,IHLINT32)
 ENTRY IHLINT31
 NAME IHLINT3(R)
 INCLUDE CI505(IHLINT41,IHLINT43)
 ENTRY IHLINT41
 NAME IHLINT4(R)
 INCLUDE CI505(IHLTERM,IHLRMMSG)
 ENTRY IHLTERM
 NAME IHLTERM(R)
 INCLUDE CI505(IHLROUT,IHLSERV)
 ENTRY IHLROUT
 NAME IHLROUT(R)
 INCLUDE CI505(IHLRMON,IHLRMSTA,IHLRCOV,IHLRMMSG)
 ENTRY IHLRMON
 NAME IHLRMON(R)
 INCLUDE CI505(IHLTAIR1,IHLTAIR2)
 ENTRY IHLTAIR1
 NAME IHLTAIR(R)
 INCLUDE CI505(IHLTCTL1,IHLTCTL2)
 ENTRY IHLTCTL1
 NAME IHLTCTL(R)
 INCLUDE CI505(IHLTMG1,IHLTCIR,IHLTMG2)
 ENTRY IHLTMG1
 NAME IHLTMG1(R)
 INCLUDE CI505(IHLTSV1,IHLTSV2)
 ENTRY IHLTSV1
 NAME IHLTSVC(R)
/*
//SG90 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,OVLY,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//DN554  DD  DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN554  SERVICE AIDS
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE  DN554(IMBLKCTL,IMBLKOBJ,IMBLKLDM,IMBLKXRF,IMBLKIDR)
 INCLUDE  DN554(IMBLKMSG,IMBLKERR,IMBLKSZE)
 INSERT  IMBLKCTL,IMBLKERR,IMBLKMSG,IMBLKSZE
 OVERLAY  ONE
 INSERT  IMBLKOBJ
 OVERLAY  ONE
 INSERT  IMBLKXRF
 OVERLAY  ONE
 INSERT  IMBLKLDM
 OVERLAY  ONE
 INSERT  IMBLKIDR
 ENTRY  IMBLKCTL
 NAME  IMBLIST(R)
/*
//SG91 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,OVLY'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//DN554 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN554
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INSERT HMASMDRV
 INSERT HMASMMSG
 INSERT HMASMIO
 INSERT HMASMSCN
 OVERLAY ONE
 INSERT HMASMUPD
 INSERT HMASMCPY
 INSERT HMASMLKD
 INSERT HMASMASM
 INSERT HMASMIC
 OVERLAY ONE
 INSERT HMASMUCL
 OVERLAY ONE
 INSERT HMASMASI
 OVERLAY TWO
 INSERT HMASMREC
 INSERT HMASMEXT
 OVERLAY TWO
 INSERT HMASMCPI
 INSERT HMASMLKI
 OVERLAY THREE
 INSERT HMASMRES
 OVERLAY THREE
 INSERT HMASMAPA
 INSERT HMASMZAP
 OVERLAY ONE
 INSERT HMASMLOG
 OVERLAY ONE
 INSERT HMASMLCD
 OVERLAY ONE
 INSERT HMASMTBL
 INCLUDE DN554(HMASMDRV,HMASMMSG,HMASMIO,HMASMSCN)
 INCLUDE DN554(HMASMUPD,HMASMCPY,HMASMLKD,HMASMASM,HMASMIC)
 INCLUDE DN554(HMASMUCL,HMASMREC,HMASMASI,HMASMRES)
 INCLUDE DN554(HMASMAPA,HMASMZAP,HMASMLOG,HMASMLCD)
 INCLUDE DN554(HMASMCPI,HMASMLKI,HMASMTBL)
 INCLUDE DN554(HMASMEXT)
 ENTRY HMASMDRV
 NAME HMASMP(R)
/*
//SG92  EXEC PGM=IEBCOPY,COND=(8,LT)
//SYSUT3 DD DISP=SHR,DSNAME=SYS1.SG3
//SYSUT4 DD DISP=SHR,DSNAME=SYS1.SG4
//SYSPRINT DD SPACE=(121,(500,100),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3630),                  X
//             SYSOUT=A,UNIT=(3330,3)
//CI505 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI505
//CI535 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CI535
//CI555 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.CI555
//DM508 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DM508
//CQ548 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CQ548
//IO523 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.IO523
//DN533 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN533
//DN554 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.DN554
//CQ513 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.CQ513
//CQ519 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.CQ519
//CQ548 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.CQ548
//DM509 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.DM509
//IO526 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.IO526
//UT506 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.UT506
//SVCLIB DD DSNAME=SYS1.SVCLIB,VOLUME=(,RETAIN,SER=MVTRES),
// UNIT=151,DISP=OLD
//LINKLIB DD DSNAME=SYS1.LINKLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=3330,DISP=OLD
//TELCMLIB DD DSNAME=SYS1.TELCMLIB,VOLUME=(,RETAIN,SER=MVTRES),    XXXXXXXX
//             UNIT=151,DISP=OLD
//SYSIN DD *
  COPY  OUTDD=SVCLIB,INDD=DM508
  SELECT MEMBER=(IGC0010E)
 COPY OUTDD=SVCLIB,INDD=IO526
 SELECT MEMBER=(IGG019GG,IGG019HA,IGG019JH)
 COPY OUTDD=SVCLIB,INDD=IO526
 SELECT MEMBER=(IGG0192A,IGG0192B,IGG01921,IGG01920,IGG0202D,IGG0192C)
 SELECT MEMBER=(IGG01922)
 SELECT MEMBER=(IGG0192D,IGG0192E,IGG01925,IGG01927,IGG0192F,IGG0192G)
 SELECT MEMBER=(IGG0192U,IGG0192R,IGG0192S,IGG0192V,IGG0192T)
 SELECT MEMBER=(IGG019GA,IGG019GB,IGG019GC,IGG019GD,IGG019GE,IGG019GF)
 SELECT MEMBER=(IGG019IA,IGG019IB,IGG019IE,IGG019IF)
 SELECT MEMBER=(IGG0202I,IGG0202J,IGG0202K,IGG0202L,IGG0202M,IGG0202N)
 SELECT MEMBER=(IGG019HB,IGG019HD,IGG019HF,IGG019HG)
 SELECT MEMBER=(IGG01924,IGG01928,IGG01929)
 SELECT MEMBER=(IGG02028,IGG02029,IGG019HL,IGG019HN)
 SELECT MEMBER=(IGG019HH,IGG019HI,IGG019HJ,IGG019HK)
 SELECT MEMBER=(IGG0195D,IGG0195G,IGG0196D,IGG0196G)
 SELECT MEMBER=(IGG0196C)
 SELECT MEMBER=(IGG0195T,IGG0195U,IGG019I1,IGG019I2)
 SELECT MEMBER=(IGG0192H,IGG0192P,IGG0192I,IGG0192K,IGG0192L,IGG0192M)
 SELECT MEMBER=(IGG0192Q,IGG0192N,IGG0192O,IGG0192J,IGG0202A,IGG019JU)
 SELECT MEMBER=(IGG0192W,IGG0192X,IGG0192Z,IGG01950)
 SELECT MEMBER=(IGG019J6,IGG019J7,IGG019JX,IGG019J0)
 SELECT MEMBER=(IGG019J3,IGG019JV,IGG019H3,IGG019H7)
 SELECT MEMBER=(IGG019JW,IGG019G0,IGG019G1,IGG019G2,IGG019G3,IGG019G4)
 SELECT MEMBER=(IGG019G5,IGG019G6,IGG019G7,IGG019G8,IGG019G9)
 SELECT MEMBER=(IGG019GO,IGG019GL,IGG019GM,IGG019GN)
 SELECT MEMBER=(IGG019IM,IGG019IN,IGG019IO,IGG019I9)
 SELECT MEMBER=(IGG019GW,IGG019GX,IGG019GY,IGG019GV,IGG019GZ)
 SELECT MEMBER=(IGG019IX,IGG019IY,IGG019IZ,IGG019JC)
 SELECT MEMBER=(IGG019JI,IGG019JJ,IGG019JK,IGG019JL,IGG019JM,IGG019JN)
 SELECT MEMBER=(IGG019JO,IGG019JP,IGG019JQ,IGG019JR)
 SELECT MEMBER=(IGG019JS,IGG019JT,IGG019HP)
 SELECT MEMBER=(IGG032I1,IGG032I2,IGG032I3,IGG032I4,IGG032I5,IGG032I6)
 SELECT MEMBER=(IGG032I7)
  SELECT  MEMBER=(IGG032I8)
 COPY OUTDD=SVCLIB,INDD=CI505
   SELECT MEMBER=(IGG019C5)
   SELECT MEMBER=(IGE0000I,IGE0100I,IGE0200I,IGE0300I)
      SELECT  MEMBER=(IGE0400I)
     SELECT MEMBER=(IGE0800I)
     SELECT MEMBER=(IGE0900I)
        SELECT MEMBER=(IGE0000A)
        SELECT MEMBER=(IGE0000D)
        SELECT MEMBER=(IGE0000G)
        SELECT MEMBER=(IGE0001C,IGE0101C)
 SELECT MEMBER=(IGX00015)
    SELECT MEMBER=(IGE0025E)
  SELECT MEMBER=(IGE0125E,IGE0225E)
     SELECT MEMBER=(IGE0025C,IGE0025D)
   SELECT MEMBER=(IGE0125C,IGE0225C,IGE0325C)
    SELECT MEMBER=(IGE0425C,IGC0001G)
   SELECT MEMBER=(IGC0003C)
          SELECT MEMBER=(IGC0009A,IGC0109A)
  SELECT MEMBER=(IGE0025F,IGE0125F)
   SELECT MEMBER=(IGE0625F)
 COPY OUTDD=SVCLIB,INDD=CI505
~raw00001200402021004020410011000000204040202040420040202001001240224022400140204400440012001100100010001102400140044100100010001000001050002022202200000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
 SELECT MEMBER=((IFBSTAT,IGC0007F))
 SELECT MEMBER=((IFBSTAT1,IGC0107F))
 SELECT MEMBER=((IFBSTAT0,IGC0307F))
 SELECT MEMBER=((IFBSTAT2,IGC0207F))
 SELECT MEMBER=((IEE1403D,IGC1403D))
 COPY OUTDD=SVCLIB,INDD=CI535
 SELECT MEMBER=((IEAQTM00,IGC0001C),(IEAQTM01,IGC0101C))
 SELECT MEMBER=((IEAQTM03,IGC0301C))
 SELECT MEMBER=((IEAQTM04,IGC0401C),(IEAQTM05,IGC0501C))
 SELECT MEMBER=((IEAQTM07,IGC0701C),(IEAQTM08,IGC0801C))
 SELECT MEMBER=((IEAQTM09,IGC0901C),(IEAQTM0B,IGC0B01C))
 SELECT MEMBER=((IEAQTM0C,IGC0C01C),(IEAQTM0D,IGC0D01C))
 SELECT MEMBER=((IEAQTM0F,IGC0F01C),(IEAQTM0G,IGC0G01C))
 SELECT MEMBER=((IEAQTM0L,IGC0L01C),(IEAQTM0M,IGC0M01C))
 SELECT MEMBER=((IEAQTM0N,IGC0N01C),(IEAQTM0P,IGC0P01C))
 SELECT MEMBER=((IEAQTM0R,IGC0R01C),(IEAQTM0S,IGC0S01C))
 SELECT MEMBER=((IEAQTM0T,IGC0T01C),(IEAQTM0U,IGC0U01C))
 SELECT MEMBER=((IEAQTM0V,IGC0V01C),(IEAQTM0W,IGC0W01C))
 SELECT MEMBER=((IEAQAD0Y,IGC0005A),(IEAQAD0Z,IGC0Z05A))
 SELECT MEMBER=((IEAQAD00,IGC0L05A),(IEAQAD01,IGC0105A))
 SELECT MEMBER=((IEAQAD02,IGC0205A),(IEAQAD03,IGC0305A))
 SELECT MEMBER=((IEAQAD04,IGC0405A),(IEAQAD05,IGC0505A))
 SELECT MEMBER=((IEAQAD06,IGC0605A),(IEAQAD07,IGC0705A))
 SELECT MEMBER=((IEAQAD08,IGC0805A),(IEAQAD0A,IGC0A05A))
 SELECT MEMBER=((IEAQAD0J,IGC0J05A),(IEAQAD0M,IGC0M05A))
 SELECT MEMBER=((IEAQAD0N,IGC0N05A))
 SELECT MEMBER=((IEAQAD0C,IGC0C05A))
 SELECT MEMBER=((IEAQAD0Q,IGC0Q05A))
 SELECT MEMBER=((IEAQAD0D,IGC0D05A))
 SELECT MEMBER=((IEAQAD0E,IGC0E05A))
 SELECT MEMBER=((IEAQAD0F,IGC0F05A))
 SELECT MEMBER=((IEAQAD0G,IGC0G05A))
 SELECT MEMBER=((IEAQAD0R,IGC0R05A))
 SELECT MEMBER=((IEAQAD0S,IGC0S05A))
 SELECT MEMBER=((IEAQAD0H,IGC0H05A),(IEAQAD0I,IGC0I05A))
 COPY OUTDD=LINKLIB,INDD=CI505
 SELECT MEMBER=(IEAXPSIM,IEAXPALL,IEAXPDXR)
 SELECT MEMBER=(IFCDIP00)
 COPY OUTDD=SVCLIB,INDD=IO523
 SELECT MEMBER=(IGGIFF01)
 COPY OUTDD=LINKLIB,INDD=CI505
 SELECT MEMBER=(IHLWRTE,IHLWRAP,IHLTDCB)
 SELECT MEMBER=(IHLTAR2,IHLTAR3,IHLTAR4,IHLTAR5)
 SELECT MEMBER=(IHLTAR6,IHLTSCN,IHLTPMT,IHLT103)
 SELECT MEMBER=(IHLTTAB,IHLTUSR,IHLTSIO,IHLTPED)
 SELECT MEMBER=(IHLTFIL)
 SELECT MEMBER=(IHLTSYSV)
 COPY OUTDD=SVCLIB,INDD=DM508
~raw00001200402021004020410011000000204040202040420040202001001240224022400140044100100010001000020010001102400140044100100010001000020050002022202200000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
 SELECT MEMBER=(IGC0001I)
 SELECT MEMBER=(IGC0002B)
 SELECT MEMBER=(IGC0002C,IFG0232A)
 SELECT MEMBER=(IGC0003A)
 SELECT MEMBER=(READPSWD)
 SELECT MEMBER=(SECLOADA)
 SELECT MEMBER=(IGG0196M)
 SELECT MEMBER=(IGC0005E)
 SELECT MEMBER=(IGC0006D)
 SELECT MEMBER=(IFG0190P)
 SELECT MEMBER=(IFG0190R,IFG0200R,IFG0550R)
 SELECT MEMBER=(IFG0193A,IFG0193B,IFG0193D)
 SELECT MEMBER=(IFG0193C,OMODVOL1)
 SELECT MEMBER=(IFG0193E,IFG0194A,IFG0194C,IFG0194D)
 SELECT MEMBER=(IFG0194E,IFG0194F,IFG0194G,IFG0194H)
 SELECT MEMBER=(IFG0194I,IFG0194R)
 SELECT MEMBER=(IFG0194J,IGG0190A)
 SELECT MEMBER=(IFG0195A,IFG0195B)
 SELECT MEMBER=(IFG0195C,IFG0195E,IFG0195G)
 SELECT MEMBER=(IFG0195D,IGG0190B)
 SELECT MEMBER=(IFG0195H,IFG0195J,IFG0195K,IFG0195M)
 SELECT MEMBER=(IFG0195N,IFG0195O,IFG0195P,IFG0195T)
 SELECT MEMBER=(IFG0195U,IFG0196J,IFG0196K)
 SELECT MEMBER=(IFG0196L,IFG0196M,IFG0196N)
 SELECT MEMBER=(IFG0195V)
 SELECT MEMBER=(IFG0196O,IGG0190R)
 SELECT MEMBER=(IFG0196Q,IFG0196T,IFG0196U,IFG0196V)
 SELECT MEMBER=(IFG0196W,IGG0190S)
 SELECT MEMBER=(IFG0196X,IFG0198N)
 SELECT MEMBER=(IFG0199B,IFG0209B,IFG0239B,IFG0559B)
 SELECT MEMBER=(IFG0199D,IFG0209D,IFG0239D,IFG0559D)
 SELECT MEMBER=(IFG0199E,IFG0209E,IFG0239E,IFG0559E)
 SELECT MEMBER=(IFG0199R,IFG0209R,IFG0239R,IFG0559R)
 SELECT MEMBER=(IFG019TR,IFG020TR,IFG023TR,IFG055TR)
 SELECT MEMBER=(IFG0200P,IGG0206M)
 SELECT MEMBER=(IFG0200V,IFG0200W,IFG0200Z)
 SELECT MEMBER=(IFG0200Y,IGG0200G)
 SELECT MEMBER=(IFG0201R,IFG0201U)
 SELECT MEMBER=(IFG0202A)
 SELECT MEMBER=(IFG0202B,IGG0200B,IFG0232Y,IFG0556B)
 SELECT MEMBER=(IFG0202C,IFG0202D,IFG0202E,IFG0202F)
 SELECT MEMBER=(IFG0202H,IFG0553B)
 SELECT MEMBER=(IFG0202G,IFG0202I,IFG0202J)
 SELECT MEMBER=(IFG0202K,IFG0202L)
 SELECT MEMBER=(IFG0230P,IFG0232D,IFG0232G,IFG0232J)
 SELECT MEMBER=(IFG0232M,IFG0232S)
 SELECT MEMBER=(IFG0232Z,IFG0202U)
 SELECT MEMBER=(IFG0550P,IFG0551B,IFG0551D,IFG0551F)
 SELECT MEMBER=(IFG0551H,IFG0551J)
 SELECT MEMBER=(IFG0551L,IGG0551A)
 SELECT MEMBER=(IFG0551N,IGG0551B)
 SELECT MEMBER=(IFG0551P,IFG0551R,IFG0551V,IFG0551Z)
 SELECT MEMBER=(IFG0551T,IGG0550F)
 SELECT MEMBER=(IFG0551X,IGG0550P)
 SELECT MEMBER=(IFG0552B,IFG0552D,IFG0552F,IFG0552H)
 SELECT MEMBER=(IFG0552J,EMODVOL1)
 SELECT MEMBER=(IFG0552N,IGG0550H)
 SELECT MEMBER=(IFG0552R,IGG0550B)
 SELECT MEMBER=(IFG0552L,IFG0552P,IFG0552T)
 SELECT MEMBER=(IFG0552V,IFG0552X,IFG0552Y,IFG0552Z)
 SELECT MEMBER=(IFG0553D,IFG0553F,IFG0553P,IFG0553R)
 SELECT MEMBER=(IFG0553H,IGG0550D)
 SELECT MEMBER=(IFG0553T,IFG0553V,IFG0553X,IFG0553Z)
 SELECT MEMBER=(IFG0554B,IFG0554D,IFG0554J,IFG0554N)
 SELECT MEMBER=(IFG0554L,IFG0195F)
 SELECT MEMBER=(IFG0554P,IGG0550K)
 SELECT MEMBER=(IFG0554R,IGG0552K)
 SELECT MEMBER=(IFG0554T,IGG0550S)
 SELECT MEMBER=(IFG0554V,IFG0554X,IFG0554Z,IFG0555B)
 SELECT MEMBER=(IFG0555D,IFG0555F,IFG0555H)
 SELECT MEMBER=(IFG0555J,IFG0196P)
 COPY OUTDD=SVCLIB,INDD=DM508
 SELECT MEMBER=(IGG019AA,IGG019AB,IGG019AC,IGG019AD)
 SELECT MEMBER=(IGG019AF,IGG019AG,IGG019AI,IGG019AJ)
 SELECT MEMBER=(IGG019AK,IGG019AL,IGG019AM,IGG019AN)
 SELECT MEMBER=(IGG019AQ,IGG019AR,IGG019AT,IGG019AV)
 SELECT MEMBER=(IGG019AW,IGG019AX)
 SELECT MEMBER=(IGG019BA,IGG019BB,IGG019BD,IGG019BE)
 SELECT MEMBER=(IGG019BF,IGG019BG,IGG019BI,IGG019BL)
 SELECT MEMBER=(IGG019BM,IGG019BN,IGG019BO,IGG019BP)
 SELECT MEMBER=(IGG019BQ,IGG019BU,IGG019BV)
 SELECT MEMBER=(IGG019CA,IGG019CB,IGG019CC,IGG019CD)
 SELECT MEMBER=(IGG019CE,IGG019CF,IGG019CH)
 SELECT MEMBER=(IGG019CL,IGG019CM,IGG019CN,IGG019CO)
 SELECT MEMBER=(IGG019CP,IGG019CQ,IGG019CR,IGG019CS)
 SELECT MEMBER=(IGG019CT,IGG019CX,IGG019CY,IGG019CZ)
 SELECT MEMBER=(IGG019C0,IGG019C1,IGG019C2,IGG019C3)
 SELECT MEMBER=(IGG019C4)
 SELECT MEMBER=(IGG019EA,IGG019EB,IGG019EC,IGG019ED)
 SELECT MEMBER=(IGG019EE,IGG019EF)
 SELECT MEMBER=(IGG019EI,IGG019EJ)
 SELECT MEMBER=(IGG019FB,IGG019FD,IGG019FF,IGG019FG)
 SELECT MEMBER=(IGG019FJ,IGG019FL,IGG019FN)
 SELECT MEMBER=(IGG019FP)
 SELECT MEMBER=(IGG019TC,IGG019TD)
 SELECT MEMBER=(IGG019T2)
 SELECT MEMBER=(IGG0191A,IGG0191B,IGG0191C,IGG0191D)
 SELECT MEMBER=(IGG0191E,IGG0191F,IGG0191G,IGG0191H)
 SELECT MEMBER=(IGG0191I,IGG0191J,IGG0191K,IGG0191N)
 SELECT MEMBER=(IGG0191O,IGG0191P,IGG0191Q,IGG0191R)
 SELECT MEMBER=(IGG0191S,IGG0191T,IGG0191U,IGG0191V)
 SELECT MEMBER=(IGG0191W,IGG0191X,IGG0191Y,IGG0191Z)
 SELECT MEMBER=(IGG01910,IGG01911,IGG01912,IGG01913)
 SELECT MEMBER=(IGG01914,IGG01915,IGG01916,IGG01917)
 SELECT MEMBER=(IGG01918,IGG01919,IGG01923)
 SELECT MEMBER=(IGG01926,IGG0193I)
 SELECT MEMBER=(IGG0196A,IGG0196B)
 SELECT MEMBER=(IGG0196J,IGG0196K,IGG0196L)
 SELECT MEMBER=(IGG0196I)
 SELECT MEMBER=(IGG0196P)
 SELECT MEMBER=(IGG0197U)
 SELECT MEMBER=(IGG0199K,IGG0199O)
 SELECT MEMBER=(IGG01990,IGG01991,IGG01992,IGG01993)
 SELECT MEMBER=(IGG01994)
 SELECT MEMBER=(IGG0201A,IGG0201B)
 SELECT MEMBER=(IGG0210A,IGG021AB)
 SELECT MEMBER=(IGG0201X,IGG0201Y,IGG0201Z)
 SELECT MEMBER=(IGC0002E,IGC0002A,IGC0002D)
 SELECT MEMBER=(IGC0005G)
 SELECT MEMBER=(IGC0006I)
 SELECT MEMBER=(IGC0006H,IGC0106H,IGC0206H,IGC0306H)
 SELECT MEMBER=(IGC0406H,IGC0506H,IGC0606H,IGC0706H)
 SELECT MEMBER=(IGC0806H,IGC0906H)
 SELECT MEMBER=(IGC0008A,IGG08101,IGG08102)
 COPY  OUTDD=SVCLIB,INDD=DM508
 SELECT MEMBER=(IGGAARPS)
 SELECT MEMBER=((IGGR19AE,IGG019AE,R))
 SELECT MEMBER=((IGGR19BC,IGG019BC,R))
 SELECT MEMBER=((IGGR19BH,IGG019BH,R))
 SELECT MEMBER=((IGGR19BK,IGG019BK,R))
 SELECT MEMBER=((IGGR19CW,IGG019CW,R))
 SELECT MEMBER=((IGGR19CG,IGG019CG,R))
 SELECT MEMBER=((IGGR19CI,IGG019CI,R))
 SELECT MEMBER=((IGGR19CJ,IGG019CJ,R))
 SELECT MEMBER=((IGGR19CU,IGG019CU,R))
 SELECT MEMBER=((IGGR19CV,IGG019CV,R))
 SELECT MEMBER=((IGGR19TV,IGG019TV,R))
 SELECT MEMBER=((IGGR19TW,IGG019TW,R))
 COPY OUTDD=LINKLIB,INDD=DM508
 SELECT MEMBER=(IECQBFG1,IECBBFB1)
 SELECT MEMBER=(IGG019B0)
 COPY OUTDD=SVCLIB,INDD=DM509
 SELECT MEMBER=(IGG019KC,IGG019KE,IGG019KG)
 SELECT MEMBER=(IGG019KR,IGG0193G,IGG0193F)
 SELECT MEMBER=(IGG019KA,IGG019KJ,IGG019KL)
 SELECT MEMBER=(IGG019KQ,IGG019KU,IGG0193A,IGG0193C)
 SELECT MEMBER=(IGG0203A,IGG019DC,IGG0191L)
 SELECT MEMBER=(IGG019BR,IGG019BS,IGG019BT,IGG0199L)
 SELECT MEMBER=(IGG0191M,IGG019KF,IGG019KH)
 SELECT MEMBER=(IGG019LG)
 SELECT MEMBER=(IGC0005C)
 SELECT MEMBER=(IGG019KW,IGG019KY,IGG019LA,IGG019LC,IGG019LI)
 SELECT MEMBER=(IGG019LE,IGG0193E)
 COPY  OUTDD=SVCLIB,INDD=DM509
 SELECT MEMBER=((IGGR19DA,IGG019DA,R),(IGGR19DB,IGG019DB,R))
 SELECT MEMBER=((IGGR19DD,IGG019DD,R),(IGGR19KN,IGG019KN,R))
 SELECT MEMBER=((IGGR19KI,IGG019KI,R),(IGGR19KK,IGG019KK,R))
 SELECT MEMBER=((IGGR19KM,IGG019KM,R),(IGGR19KO,IGG019KO,R))
 COPY OUTDD=SVCLIB,INDD=DM508
 SELECT MEMBER=(IGC0002G)
 SELECT MEMBER=(IGC0002I,IGG0290A,IGG0290B,IGG0290C)
 SELECT MEMBER=(IGG0290D,IGG0290E,IGG0290F,IGG0299A)
~raw00001200402021004020410011000000204040202040420040202001001240224022400140044100100010001000010010001102400140044100100010001000010050002022110240014004400410000100100010000400202200000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
 SELECT MEMBER=(IGG03002,IGG03003)
 SELECT MEMBER=(IGC0003B,IGG0325A,IGG0325B,IGG0325C,IGG0325D)
 SELECT MEMBER=(IGG0325E,IGG0325G,IGG0325H,IGG0325K)
 SELECT MEMBER=(IGG0325F,IGG0325J,IGG0325L)
 SELECT MEMBER=(IGG0325M,IGG0325S)
 SELECT MEMBER=(IGG0325P,IGG0325Q,IGG0325R,IGG0325T)
 SELECT MEMBER=(IGG0325U,IGG0325V,IGG0325W,IGG0325Z)
 SELECT MEMBER=(IGC0007H,IGC0107H)
 SELECT MEMBER=(IGC0009H,IGC0109H,IGC0209H)
 SELECT MEMBER=(IGG019EK)
 SELECT MEMBER=(IGG020P1,IGG020P2,IGG020P3,IGG020D0,IGG020D1)
 SELECT MEMBER=(IGG0553A,IGG0553B,IGG0553C,IGG0553D)
 SELECT MEMBER=(IGG0553E,IGG0553F,IGG0553G)
 SELECT MEMBER=(IGC0002F,IGC0002H)
 SELECT MEMBER=(IGG0CLF2,IGG0CLC1,IGG0CLC2,IGG0CLC3)
 SELECT MEMBER=(IGG0CLC4,IGG0CLC5,IGG0CLC6,IGG0CLC7)
 SELECT MEMBER=(IGG0CLC8)
 COPY OUTDD=SVCLIB,INDD=UT506
 SELECT MEMBER=(IGC0008B,IGC0108B,IGC0208B,IGG019P8,IGG019P9)
 SELECT MEMBER=(IGC0008F,IGG0860A,IGG0860B,IGG0860C,IGG0860D)
 SELECT MEMBER=(IGG086AE,IGC0308B,IGG019C8)
 COPY OUTDD=SVCLIB,INDD=CQ548
 SELECT MEMBER=(IGC0J05B)
 COPY OUTDD=SVCLIB,INDD=DM508
 SELECT MEMBER=(IGC0506C,IGC0N06C,IGC0G95B,IGC0G05B)
 SELECT MEMBER=(IGC0H05B,IGC0I05B,IGC0K05B,IGC0L05B,IGC0M05B)
 SELECT MEMBER=(IGC0M95B,IGC0K95B,IGC0L95B)
 SELECT MEMBER=(IGC0N05B,IGC0P05B,IGC0S05B,IGC0W05B,IGC0Q05B)
 SELECT MEMBER=(IGC0N95B)
 SELECT MEMBER=(IGC0R05B,IGC0T05B,IGC0U05B)
 COPY OUTDD=SVCLIB,INDD=CI505
 SELECT MEMBER=((IHJACP00,IGC0006C),(IHJACP01,IGC0106C))
 SELECT MEMBER=((IHJACP02,IGC0206C),(IHJACP20,IGC0A06C))
 SELECT MEMBER=((IHJACP50,IGC0Q06C),(IHJARS00,IGC0105B))
 SELECT MEMBER=((IHJACP25,IGC0D06C),(IHJACP70,IGC0S06C))
 SELECT MEMBER=((IEFVSMBR,IGC0005B))
 SELECT MEMBER=((IHJARS01,IGC0205B),(IHJARS60,IGC0V05B))
 COPY OUTDD=SVCLIB,INDD=CI535
 SELECT MEMBER=((IHJQCP30,IGC0F06C),(IHJQCP31,IGC0G06C))
 SELECT MEMBER=((IHJQCP32,IGC0H06C),(IHJQRS20,IGC0505B))
 SELECT MEMBER=((IHJQRS21,IGC0605B),(IHJQRS22,IGC0705B))
 SELECT MEMBER=((IHJQRS23,IGC0805B),(IHJQRS24,IGC0905B))
 COPY OUTDD=SVCLIB,INDD=DN533
 SELECT MEMBER=(IGC0005I,IGC0205I,IGC0405I,IGC0505I)
 SELECT MEMBER=(IGC0605I,IGC0705I,IGC0905I)
 COPY OUTDD=SVCLIB,INDD=CI505
 SELECT MEMBER=(IGC0105I,IGC0305I)
 COPY OUTDD=LINKLIB,INDD=DN554
 SELECT MEMBER=(IMAPTFLE,IMAPTF01,IMAPTF02)
 SELECT MEMBER=(IMASPZAP)
 SELECT MEMBER=(IMBMDMAP)
 SELECT MEMBER=(IMDPRLPA,IMDPRQCB,IMDPRDPS,IMDPRFSR)
 SELECT MEMBER=(IMDPRFUR,IMDPRFXT,IMDPRPMS,IMDPRNUC)
 SELECT MEMBER=(IMDPRPAL,IMDPRFUB,IMDPRPCR,IMDPRPDR)
 SELECT MEMBER=(IMDPRPJB,IMDDREAD,IMDTREAD,IMDPRLOD)
 SELECT MEMBER=(IMDPROOT,IMDSYS00,IMDSYS02,IMDSYS03)
 SELECT MEMBER=(IMDPRMST,IMDPRTSO,IMDPRSWP)
 SELECT MEMBER=(IMDUSRFF)
 COPY OUTDD=LINKLIB,INDD=CQ513
 SELECT MEMBER=(IDFCT,IDFST,IDFM01)
 COPY OUTDD=TELCMLIB,INDD=CQ513
 SELECT MEMBER=(IECTEDIT)
 COPY OUTDD=SVCLIB,INDD=CQ513
 SELECT MEMBER=(IGE0004A)
 COPY OUTDD=SVCLIB,INDD=CQ519
 SELECT MEMBER=(IGG0193N,IGG0193O,IGG0193P,IGG0193R)
 SELECT MEMBER=(IGG0193T,IGG0203N,IGG0203O,IGG0203P)
 SELECT MEMBER=(IGG0194A)
 SELECT MEMBER=(IGG0203R)
 SELECT MEMBER=(IGG019NA,IGG019NB,IGG019NC,IGG019ND)
 SELECT MEMBER=(IGG019NE,IGG019NF,IGG019NG)
 SELECT MEMBER=(IGG019NJ,IGG019NK,IGG019NL,IGG019NM)
 SELECT MEMBER=(IGG019NN,IGG019NO,IGG019NP,IGG019NQ)
 SELECT MEMBER=(IGG019NR,IGG019NS,IGG019NT,IGG019NU)
 SELECT MEMBER=(IGG019NV,IGG019NW,IGG019NX,IGG019NY)
 SELECT MEMBER=(IGG019NZ,IGG019N1,IGG019N2)
 SELECT MEMBER=(IGG019N3,IGG019N8,IGG019N9)
 SELECT MEMBER=(IGG019QA,IGG019QB)
 SELECT MEMBER=(IGG0193U,IGG0193V,IGG019NH,IGE0104E)
 SELECT MEMBER=(IGE0204E,IGE0304E,IGE0404E,IGE0504E)
 SELECT MEMBER=(IGE0604E,IGE0704E,IGE0804E,IGE0904E)
 SELECT MEMBER=(IGE0104F,IGE0204F,IGE0304F,IGE0404F)
 SELECT MEMBER=(IGE0504F,IGC0007G,IGC0107G,IGC0207G)
 SELECT MEMBER=(IGC0307G,IGC0407G,IGC0507G,IGC0607G)
 SELECT MEMBER=(IGE0004E,IGE0004F,IGE0604F,IGE0704F)
 SELECT MEMBER=(IGE0804F)
 COPY OUTDD=SVCLIB,INDD=CQ548
 SELECT MEMBER=(IGE0004G,IGE0104G,IGE0204G,IGE0304G)
 SELECT MEMBER=(IGE0404G,IGE0504G,IGE0604G,IGE0804G)
 SELECT MEMBER=(IGE0904G,IGE0004H,IGE0104H,IGE0204H)
 SELECT MEMBER=(IGE0404H,IGE0504H,IGE0804H)
 SELECT MEMBER=(IGE0904H)
 SELECT MEMBER=(IGE0004I,IGE0104I,IGE0904I)
 SELECT MEMBER=(IGG019RH,IGG019RI,IGG019RJ,IGG019RL)
 SELECT MEMBER=(IGG019RM,IGG019RG)
 SELECT MEMBER=(IGG019Q2,IGG019Q3,IGG019Q4,IGG019Q8)
 SELECT MEMBER=(IGG019Q5,IGG019Q6,IGG019Q7)
 SELECT MEMBER=(IGG019Q9)
 SELECT MEMBER=(IGG019Q0,IGG019Q1,IGG019RA,IGG019RB)
 SELECT MEMBER=(IGG019RC,IGG019RD,IGG019RN,IGG019RO)
 SELECT MEMBER=(IGG019RR,IGG019RS,IGG019RT,IGG019RU)
 SELECT MEMBER=(IGG019RV,IGG019RW,IGG019RX,IGG019RY)
 SELECT MEMBER=(IGG019RF,IGG019RK)
 SELECT MEMBER=(IGG019RE,IGG019EM)
 SELECT MEMBER=(IGG019RP,IGG019RQ,IGG019R0,IGG019R1)
 SELECT MEMBER=(IGG019R2,IGG019R3,IGG019R4,IGG019R5)
 SELECT MEMBER=(IGG019R6,IGG019R7,IGG019R8,IGG019R9)
 SELECT MEMBER=(IGG019TE,IGG019TF,IGG019TG)
 SELECT MEMBER=(IGG019TH,IGG019TI,IGG019TJ)
 SELECT MEMBER=(IGG019TM,IGG019TN)
 SELECT MEMBER=(IGC0010D,IGC0110D,IGC0310D)
 SELECT MEMBER=(IGC0210D)
 SELECT MEMBER=(IGC0410D,IGC0510D,IGC0610D)
 SELECT MEMBER=(IGC0710D,IGC0810D,IGC0910D)
 SELECT MEMBER=(IGC0B10D,IGC0C10D)
 SELECT MEMBER=(IGC0D10D,IGC0E10D)
 SELECT MEMBER=(IGC0G10D)
 SELECT MEMBER=(IGC1210D)
 SELECT MEMBER=(IGCC010D,IGCC110D)
 SELECT MEMBER=(IGCI010D,IGCI110D,IGCH010D)
 SELECT MEMBER=(IGCI210D,IGCI310D)
 SELECT MEMBER=(IGCR010D,IGCZ010D,IGCZ110D)
 SELECT MEMBER=(IGCV010D,IGCV110D,IGCV210D)
 SELECT MEMBER=(IGCV310D,IGCV410D,IGCM010D)
 SELECT MEMBER=(IGCM110D,IGCM210D,IGCM410D)
 SELECT MEMBER=(IGCM310D)
 SELECT MEMBER=(IGCM510D,IGCM610D,IGCM710D)
 SELECT MEMBER=(IGCM810D,IGCM910D,IGCMA10D)
 SELECT MEMBER=(IGCMB10D)
 SELECT MEMBER=(IGCMD10D,IGCME10D,IGCMF10D)
 SELECT MEMBER=(IGCMG10D,IGCMH10D,IGCMI10D)
 SELECT MEMBER=(IGCMJ10D)
 SELECT MEMBER=(IGCMK10D,IGCML10D,IGCMM10D)
 SELECT MEMBER=(IGCMN10D)
 SELECT MEMBER=(IGCMP10D)
 SELECT MEMBER=(IGCMR10D,IGCMS10D,IGCMT10D)
 SELECT MEMBER=(IGCMX10D,IGCMY10D)
 SELECT MEMBER=(IGCD010D,IGCD110D,IGCD210D)
 SELECT MEMBER=(IGCD310D,IGCD410D,IGCD510D)
 SELECT MEMBER=(IGCD610D,IGCD710D,IGCD810D)
 SELECT MEMBER=(IGCD910D,IGCV510D,IGCV610D)
 SELECT MEMBER=(IGCDB10D,IGCDC10D,IGCDD10D)
 SELECT MEMBER=(IGCSW10D)
 SELECT MEMBER=(IGCT010D,IGCT110D,IGCT210D)
 SELECT MEMBER=(IGCT310D,IGCT410D)
 SELECT MEMBER=(IEDQOT01)
 SELECT MEMBER=(IGCVA10D,IGCVB10D)
 SELECT MEMBER=(IGCVE10D,IGCVF10D,IGCVG10D)
 SELECT MEMBER=(IGCVH10D)
 SELECT MEMBER=(IGCV710D)
 SELECT MEMBER=(IGCV810D,IGCV910D)
 SELECT MEMBER=(IGG019AO,IGG019AP)
 SELECT MEMBER=(IGG01930,IGG01931,IGG01933,IGG01934)
 SELECT MEMBER=(IGG01935,IGG01936,IGG01937,IGG01938)
 SELECT MEMBER=(IGG01939,IGG01940,IGG01941,IGG01942)
 SELECT MEMBER=(IGG01943,IGG01944,IGG01945,IGG01946)
 SELECT MEMBER=(IGG01947,IGG01948,IGG01949)
 SELECT MEMBER=(IGG0194B)
 SELECT MEMBER=(IGG0198B)
 SELECT MEMBER=(IGG0198D,IGG0198E)
 SELECT MEMBER=(IGG02030,IGG02035,IGG02036)
 SELECT MEMBER=(IGG0203B)
 SELECT MEMBER=(IGG02041)
 SELECT MEMBER=(IGG02046,IGG02047)
 COPY OUTDD=TELCMLIB,INDD=CQ519
 SELECT MEMBER=(IECKBRKF,IECKCHGT,IECKCHPL,IECKCLOS)
 SELECT MEMBER=(IECKCNCL,IECKCPPL,IECKCPYQ,IECKCPYT)
 SELECT MEMBER=(IECKCVRS,IECKDATE,IECKDLQT,IECKDRCT)
 SELECT MEMBER=(IECKEOAD,IECKEOBC,IECKEOBK,IECKERMG)
 SELECT MEMBER=(IECKITCP,IECKLKUP,IECKLNCH,IECKMODE)
 SELECT MEMBER=(IECKNATE,IECKPAUS,IECKPLMT,IECKPRTY)
 SELECT MEMBER=(IECKRELM,IECKRETD,IECKRETS,IECKRF40)
 SELECT MEMBER=(IECKRF50,IECKROUT,IECKRRTE,IECKRVT1)
 SELECT MEMBER=(IECKRVT2,IECKRV30,IECKRV40,IECKRV50)
 SELECT MEMBER=(IECKRV60,IECKR260,IECKSCAN,IECKSDT1)
 SELECT MEMBER=(IECKSDT2,IECKSD30,IECKSD40,IECKSD50)
 SELECT MEMBER=(IECKSD60,IECKSEQN,IECKSEQT,IECKSKPC)
 SELECT MEMBER=(IECKSKPS,IECKSRCE,IECKS260,IECKTIME)
 SELECT MEMBER=(IECKTRNS,IECKTYPE,IECKEXPD,IECKSDT3)
 SELECT MEMBER=(IECKOCTL,IECKONLT,IECKCKRQ,IECKOPAW)
 SELECT MEMBER=(IECKDCBL)
 SELECT MEMBER=(IECKRVTW,IECKRVTZ,IECKSDTW,IECKSDTZ)
 COPY OUTDD=TELCMLIB,INDD=CQ548
 SELECT MEMBER=(IEDNID)
 SELECT MEMBER=(IEDN25)
 SELECT MEMBER=(IEDQAA,IEDQAC,IEDQAD,IEDQAE)
 SELECT MEMBER=(IEDQAF,IEDQAG,IEDQAH,IEDQAI,IEDQAJ)
 SELECT MEMBER=(IEDQAK,IEDQAB,IEDQA9)
 SELECT MEMBER=(IEDQAL,IEDQAM,IEDQAN,IEDQAO,IEDQAP)
 SELECT MEMBER=(IEDQAQ,IEDQAR,IEDQAS,IEDQAT,IEDQAU)
 SELECT MEMBER=(IEDQAV,IEDQAW,IEDQAX,IEDQAY,IEDQAZ)
 SELECT MEMBER=(IEDQA0,IEDQA1,IEDQA2,IEDQA8,IEDQA4)
 SELECT MEMBER=(IEDQA3)
 SELECT MEMBER=(IEDQA5,IEDQA6,IEDQA7,IEDQBA,IEDQBB)
 SELECT MEMBER=(IEDQBC,IEDQBD,IEDQBE,IEDQBF,IEDQBG)
 SELECT MEMBER=(IEDQBI,IEDQBJ)
 SELECT MEMBER=(IEDQBH,IEDQBL,IEDQBM,IEDQBN)
 SELECT MEMBER=(IEDQBO,IEDQBP,IEDQBQ,IEDQBR)
 SELECT MEMBER=(IEDQBT,IEDQBU,IEDQBX,IEDQBY)
 SELECT MEMBER=(IEDQBV,IEDQB4)
 SELECT MEMBER=(IEDQBZ)
 SELECT MEMBER=(IEDQB1,IEDQB2,IEDQB3)
 SELECT MEMBER=(IEDQB7)
 SELECT MEMBER=(IEDQES,IEDQEU,IEDQE8)
 SELECT MEMBER=(IEDQFA,IEDQFA1,IEDQFA2,IEDQFE)
 SELECT MEMBER=(IEDQGA,IEDQGH)
 SELECT MEMBER=(IEDQGP,IEDQGR)
 SELECT MEMBER=(IEDQGT,IEDQHG,IEDQHK,IEDQHM)
 SELECT MEMBER=(IEDQHM1,IEDQHM2,IEDQKB,IEDQKC,IEDQKD)
 SELECT MEMBER=(IEDQKA,IEDQKE,IEDQNA,IEDQUI)
 SELECT MEMBER=(IEDQ10,IEDQ11,IEDQ12,IEDQ13,IEDQ14)
 SELECT MEMBER=(IEDQ15,IEDQ16,IEDQ17,IEDQ18,IEDQ19)
 SELECT MEMBER=(IEDQ20,IEDQ21,IEDQ22,IEDQ23,IEDQ24)
 SELECT MEMBER=(IEDQ25,IEDQ26,IEDQ27,IEDQ28)
 COPY OUTDD=LINKLIB,INDD=CQ548
 SELECT MEMBER=(IEDNAR)
 SELECT MEMBER=(IEDNLT)
 SELECT MEMBER=(IEDNMG)
 SELECT MEMBER=(IEDNRE)
 SELECT MEMBER=(IEDNTR)
 SELECT MEMBER=(IEDQCA)
 SELECT MEMBER=(IEDQEC,IEDQET,IEDQEW)
 SELECT MEMBER=(IEDQEZ,IEDQE6,IEDQE7)
 SELECT MEMBER=(IEDQFE10,IEDQFE20,IEDQFE30)
 SELECT MEMBER=(IEDQFW,IEDQNA2)
 SELECT MEMBER=(IEDQGQ)
 SELECT MEMBER=(IEDQHI)
 SELECT MEMBER=(IEDQNB,IEDQNB02,IEDQNB05)
 SELECT MEMBER=(IEDQND,IEDQNF,IEDQNG,IEDQNH,IEDQNJ)
 SELECT MEMBER=(IEDQNK,IEDQNM,IEDQNO,IEDQNP,IEDQNQ)
 SELECT MEMBER=(IEDQNR,IEDQNS,IEDQNX,IEDQOA,IEDQOB)
 SELECT MEMBER=(IEDQWA,IEDQWAB,IEDQWAJ,IEDQWB)
 SELECT MEMBER=(IEDQWB1,IEDQWC,IEDQWC1,IEDQWC2)
 SELECT MEMBER=(IEDQWD)
 SELECT MEMBER=(IEDQWE,IEDQWE1)
 SELECT MEMBER=(IEDQWF,IEDQWH)
 SELECT MEMBER=(IEDQWI,IEDQWI1)
 SELECT MEMBER=(IEDQWIA)
 SELECT MEMBER=(IEDQWID,IEDQWIE,IEDQWI5U)
 SELECT MEMBER=(IEDQWI7,IEDQWI8,IEDQWI9,IEDQWJ)
 SELECT MEMBER=(IEDQWJ1,IEDQWJ2,IEDQWK,IEDQWL)
 SELECT MEMBER=(IEDQWK1)
 SELECT MEMBER=(IEDQWL1,IEDQWL2,IEDQWL3)
 SELECT MEMBER=(IEDQWM2)
 SELECT MEMBER=((IEDQWN,IEDQW35,R))
 SELECT MEMBER=(IEDQWO,IEDQWP1,IEDQWP2)
 SELECT MEMBER=((IEDQWP,IEDQW39,R))
 SELECT MEMBER=((IEDQWQ,IEDQW37,R))
 SELECT MEMBER=((IEDQWR,IEDQW28,R))
 SELECT MEMBER=((IEDQWS,IEDQW36,R))
 SELECT MEMBER=(IEDQWV,IEDQW21,IEDQWAC)
 SELECT MEMBER=((IEDQWX,IEDQW41,R))
 SELECT MEMBER=((IEDQWY,IEDQW16,R))
 SELECT MEMBER=(IEDQW42,IEDQW43)
 SELECT MEMBER=(IEDQW44,IEDQW47)
 SELECT MEMBER=(IEDQWAA,IEDQWB2)
 SELECT MEMBER=(IEDQWE2,IEDQWEC)
 SELECT MEMBER=(IEDQXA,IEDQXB,IEDQXC)
 SELECT MEMBER=(IEDQE1,IEDQE2,IEDQE3,IEDQE4)
 COPY OUTDD=TELCMLIB,INDD=CQ548
 SELECT MEMBER=(IEDAYA,IEDAYC,IEDAYD,IEDAYE)
 SELECT MEMBER=(IEDAYB)
 SELECT MEMBER=(IEDAYH,IEDAYI,IEDAYL,IEDAYM)
 SELECT MEMBER=(IEDAYO,IEDAYR,IEDAYS,IEDAYT)
 SELECT MEMBER=(IEDAYX,IEDAYY,IEDAYZ,IEDAYF)
 SELECT MEMBER=(IKJGG00A)
 COPY OUTDD=LINKLIB,INDD=UT506
 SELECT MEMBER=(IHGUADEL)
 COPY OUTDD=SVCLIB,INDD=UT506
 SELECT MEMBER=(IGC0003I)
/*
//SG93 EXEC PGM=IEWL,COND=(8,LT),                                 XXXXXXXX
//             PARM='OVLY,LET,MAP,SIZE=(250K,50K)'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(500,1000),RLSE),                             X
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=121),                   X
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=(OLD,PASS),UNIT=3330,                             XXXXXXXX
//             VOLUME=SER=MVTRES,DSNAME=SYS1.LINKLIB(IEKAA00)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//FO500 DD DISP=SHR,DSNAME=SYS1.FO500,VOLUME=(,RETAIN)
//SYSABEND DD SYSOUT=A
//SYSLIN DD *
 INCLUDE   SYSPUNCH(IEK201)
          INCLUDE FO500(IEKAA00)
          INCLUDE FO500(IEKATB)
          INCLUDE FO500(IEKAPT)
          INCLUDE FO500(IEKTLOAD)
          INCLUDE FO500(IEKFCOMH)
          INCLUDE FO500(IEKFIOCS)
          INCLUDE FO500(IEKATM)
          INCLUDE FO500(IEKAFP)
          INCLUDE FO500(IEKTDC)
          INCLUDE FO500(IEKAINIT)
          INCLUDE FO500(IEKCGC)
          INCLUDE FO500(IEKCAA)
          INCLUDE FO500(IEKCCR)
          INCLUDE FO500(IEKXRS)
          INCLUDE FO500(IEKCSR)
          INCLUDE FO500(IEKCGW)
          INCLUDE FO500(IEKCGO)
          INCLUDE FO500(IEKCPX)
          INCLUDE FO500(IEKCLT)
          INCLUDE FO500(IEKCDT)
          INCLUDE FO500(IEKCAR)
          INCLUDE FO500(IEKCDO)
          INCLUDE FO500(IEKDIO)
          INCLUDE FO500(IEKCDP)
          INCLUDE FO500(IEKCTN)
          INCLUDE FO500(IEKCSP)
          INCLUDE FO500(IEKKOS)
          INCLUDE FO500(IEKGST)
          INCLUDE FO500(IEKCIO)
          INCLUDE FO500(IEKDCL)
          INCLUDE FO500(IEKTFM)
          INCLUDE FO500(IEKXRF)
          INCLUDE FO500(IEKJA1)
          INCLUDE FO500(IEKJA3)
          INCLUDE FO500(IEKJAL)
          INCLUDE FO500(IEKJBF)
          INCLUDE FO500(IEKJCP)
          INCLUDE FO500(IEKLMA)
          INCLUDE FO500(IEKKRE)
          INCLUDE FO500(IEKJDF)
          INCLUDE FO500(IEKLTB)
          INCLUDE FO500(IEKLOK)
          INCLUDE FO500(IEKKUN)
          INCLUDE FO500(IEKKST)
          INCLUDE FO500(IEKLRG)
          INCLUDE FO500(IEKLGN)
          INCLUDE FO500(IEKKOP)
          INCLUDE FO500(IEKKSM)
          INCLUDE FO500(IEKJFI)
          INCLUDE FO500(IEKJGR)
          INCLUDE FO500(IEKKSA)
          INCLUDE FO500(IEKJAN)
          INCLUDE FO500(IEKLER)
          INCLUDE FO500(IEKJA)
          INCLUDE FO500(IEKKCN)
          INCLUDE FO500(IEKKPA)
          INCLUDE FO500(IEKJFU)
          INCLUDE FO500(IEKLAB)
          INCLUDE FO500(IEKGEV)
          INCLUDE FO500(IEKGCZ)
          INCLUDE FO500(IEKTDT)
          INCLUDE FO500(IEKGDA)
          INCLUDE FO500(IEKTNL)
          INCLUDE FO500(IEKTDF)
          INCLUDE FO500(IEKGCR)
          INCLUDE FO500(IEKPLS)
          INCLUDE FO500(IEKPGK)
          INCLUDE FO500(IEKPT)
          INCLUDE FO500(IEKARW)
          INCLUDE FO500(IEKPZ)
          INCLUDE FO500(IEKQAA)
          INCLUDE FO500(IEKPB)
          INCLUDE FO500(IEKPO)
          INCLUDE FO500(IEKQXM)
          INCLUDE FO500(IEKQKO)
          INCLUDE FO500(IEKQXS)
          INCLUDE FO500(IEKQCF)
          INCLUDE FO500(IEKQCL)
          INCLUDE FO500(IEKQBM)
          INCLUDE FO500(IEKQSR)
          INCLUDE FO500(IEKQMT)
          INCLUDE FO500(IEKQWT)
          INCLUDE FO500(IEKQPF)
          INCLUDE FO500(IEKQSM)
          INCLUDE FO500(IEKQTL)
          INCLUDE FO500(IEKRFR)
          INCLUDE FO500(IEKRL1)
          INCLUDE FO500(IEKRFP)
          INCLUDE FO500(IEKRGB)
          INCLUDE FO500(IEKRBP)
          INCLUDE FO500(IEKRCI)
          INCLUDE FO500(IEKRS)
          INCLUDE FO500(IEKSBS)
          INCLUDE FO500(IEKRRG)
          INCLUDE FO500(IEKRSX)
          INCLUDE FO500(IEKRFL)
          INCLUDE FO500(IEKRBK)
          INCLUDE FO500(IEKRF1)
          INCLUDE FO500(IEKRSS)
          INCLUDE FO500(IEKRLL)
          INCLUDE FO500(IEKRSL)
          INCLUDE FO500(IEKP30)
          INCLUDE FO500(IEKP31)
          INCLUDE FO500(IEKUEN)
          INCLUDE FO500(IEKTEN)
          INCLUDE FO500(IEKTPR)
          INCLUDE FO500(IEKTA)
          INCLUDE FO500(IEKWCN)
          INCLUDE FO500(IEKVSU)
          INCLUDE FO500(IEKVUN)
          INCLUDE FO500(IEKVTS)
          INCLUDE FO500(IEKTIS)
          INCLUDE FO500(IEKGMP)
          INCLUDE FO500(IEKVAD)
          INCLUDE FO500(IEKVBL)
          INCLUDE FO500(IEKVFN)
          INCLUDE FO500(IEKVM2)
          INCLUDE FO500(IEKVTN)
          INCLUDE FO500(IEKTIO)
          INCLUDE FO500(IEKTEP)
          INCLUDE FO500(IEKTSR)
          INCLUDE FO500(IEKTPK)
          INCLUDE FO500(IEKWKK)
          INCLUDE FO500(IEKTLS)
          INCLUDE FO500(IEKTLB)
          INCLUDE FO500(IEKTRN)
          INCLUDE FO500(IEKVPL)
          INCLUDE FO500(IEKVFP)
 OVERLAY PHASE
  INSERT IEKCAA
  INSERT IEKAINIT
  INSERT IEKDIO#
  INSERT IEKCSP#
  INSERT IEKCTN#
  INSERT IEKCCR
  INSERT IEKCDP#
  INSERT IEKCGC
  INSERT IEKCGW
  INSERT IEKCLT#
  INSERT IEKCPX#
  INSERT IEKCAR#
  INSERT IEKDCL#
  INSERT IEKCDT#
  INSERT IEKCDO#
  INSERT IEKCGO#
  INSERT IEKCIO#
  INSERT IEKCSR#
  INSERT IEKGST#
  INSERT IEKKOS#
  INSERT IEKTFM
  INSERT IEKXRS
 OVERLAY PHASE
  INSERT IEKXRF
 OVERLAY PHASE
  INSERT IEKJA2
  INSERT IEKJA4
 OVERLAY COMMON
  INSERT IEKJA1
  INSERT IEKJAL#
  INSERT IEKJFU#
  INSERT IEKJFI#
  INSERT IEKLER#
  INSERT IEKLOK
  INSERT IEKJAN#
  INSERT IEKKSM#
  INSERT IEKLMA#
  INSERT IEKKSA#
  INSERT IEKLTB
  INSERT IEKKUN#
  INSERT IEKKRE#
  INSERT IEKKPA#
  INSERT IEKKOP#
  INSERT IEKKST#
  INSERT IEKJCP#
  INSERT IEKJGR#
  INSERT IEKKCN#
  INSERT IEKLGN#
  INSERT IEKLAB#
  INSERT IEKJA#
  INSERT IEKLRG#
  INSERT IEKJDF#
  INSERT IEKJBF#
  INSERT IEKJA3
 OVERLAY COMMON
  INSERT IEKGA1
  INSERT IEKGCR#
  INSERT IEKTDT#
  INSERT IEKTNL#
  INSERT IEKGEV#
  INSERT IEKGDA#
  INSERT IEKGCZ#
  INSERT IEKTDF#
 OVERLAY COMMON
  INSERT IEKPOP
  INSERT IEKPLS#
  INSERT IEKPGK#
  INSERT IEKARW
  INSERT IEKPT#
 OVERLAY LOOPS
  INSERT IEKPBL
  INSERT IEKPB#
  INSERT IEKPZ#
  INSERT IEKPO#
  INSERT IEKQAA#
 OVERLAY LOOPS
  INSERT IEKQBM#
  INSERT IEKQCF#
  INSERT IEKQCL#
  INSERT IEKQMT#
  INSERT IEKQSR#
  INSERT IEKQSM#
  INSERT IEKQKO
  INSERT IEKQXS#
  INSERT IEKQTL#
  INSERT IEKQWT#
  INSERT IEKQPF#
  INSERT IEKQXM#
 OVERLAY LOOPS
  INSERT IEKSBS#
  INSERT IEKRSX#
  INSERT IEKRBK#
  INSERT IEKRBP#
  INSERT IEKRCI#
  INSERT IEKRFL#
  INSERT IEKRFP#
  INSERT IEKRF1#
  INSERT IEKRFR#
  INSERT IEKRGB#
  INSERT IEKRL1
  INSERT IEKRRG#
  INSERT IEKRS#
 OVERLAY LOOPS
  INSERT IEKRLL#
  INSERT IEKRSL#
  INSERT IEKRSS#
 OVERLAY COMMON
  INSERT IEKP30
  INSERT IEKP31
 OVERLAY PHASE
  INSERT IEKVTS#
  INSERT IEKVFN#
  INSERT IEKTRN#
  INSERT IEKTIO#
  INSERT IEKTIS#
  INSERT IEKVPL#
  INSERT IEKVSU#
  INSERT IEKP25
  INSERT IEKWCN
  INSERT IEKVTN#
  INSERT IEKTPK#
  INSERT IEKTLS
  INSERT IEKVBL#
  INSERT IEKTSR
  INSERT IEKTEN#
  INSERT IEKUEN#
  INSERT IEKVFP#
  INSERT IEKTA#
  INSERT IEKTLB#
  INSERT IEKVUN#
  INSERT IEKGMP
  INSERT IEKTPR#
  INSERT IEKVAD#
  INSERT IEKWKK
  INSERT IEKVM2
  INSERT IEKTEP#
 ENTRY IEKAA00
/*
//SG94 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IEYFORT)
//FO520 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.FO520
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
         INCLUDE    SYSPUNCH(IEY201)
         INCLUDE      FO520(IEYFORT,IEYFORT2,IEYROL,IEYINT)
         ENTRY         IEYFORT
         NAME         IEYFORT(R)
         INCLUDE      FO520(IEYPAR)
         NAME         IEYPAR(R)
         INCLUDE      FO520(IEYALL)
         NAME         IEYALL(R)
         INCLUDE      FO520(IEYUNF)
         NAME         IEYUNF(R)
         INCLUDE      FO520(IEYGEN)
         NAME         IEYGEN(R)
         INCLUDE      FO520(IEYEXT)
         NAME         IEYEXT(R)
/*
//SG95 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=151,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.FORTLIB
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
        INCLUDE     SYSPUNCH(IEK205)
      NAME    IHCUATBL(R)
    INCLUDE      SYSPUNCH(IEK206)
     NAME    IHCUOPT(R)
/*
//SG96 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=151,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.FORTLIB
//LM501 DD DSNAME=SYS1.LM501,DISP=SHR,VOLUME=(,RETAIN)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
         INCLUDE    LM501(IHCFIXPI)
         ALIAS      FIXPI#
         NAME       IHCFIXPI(R)
         INCLUDE    LM501(IHCFRXPI)
         ALIAS      FRXPI#
         NAME       IHCFRXPI(R)
         INCLUDE    LM501(IHCFDXPI)
         ALIAS      FDXPI#
         NAME       IHCFDXPI(R)
         INCLUDE    LM501(IHCFRXPR)
         ALIAS      FRXPR#
         NAME       IHCFRXPR(R)
         INCLUDE    LM501(IHCFDXPD)
         ALIAS      FDXPD#
         NAME       IHCFDXPD(R)
         INCLUDE    LM501(IHCDIOSE)
         ALIAS      DIOCS#
         NAME       IHCDIOSE(R)
         INCLUDE    LM501(IHCFIOSH)
         ALIAS      FIOCS#
         NAME       IHCFIOSH(R)
         INCLUDE    LM501(IHCIBERH)
         ALIAS      IBERH#
         NAME       IHCIBERH(R)
         INCLUDE    LM501(IHCCLAS)
         ALIAS      CDMPY#
         ALIAS      CDDVD#
         NAME       IHCCLAS(R)
         INCLUDE    LM501(IHCCSAS)
         ALIAS      CMPY#
         ALIAS      CDVD#
         NAME       IHCCSAS(R)
         INCLUDE    LM501(IHCFCDXI)
         ALIAS      FCDXI#
         NAME       IHCFCDXI(R)
         INCLUDE    LM501(IHCFCXPI)
         ALIAS      FCXPI#
         NAME       IHCFCXPI(R)
         INCLUDE    LM501(IHCFCVTH)
         ALIAS      ADCON#
         NAME       IHCFCVTH(R)
         INCLUDE    LM501(IHCLATN2)
         ALIAS      DATAN
         ALIAS      DATAN2
         NAME       IHCLATN2(R)
         INCLUDE    LM501(IHCSATN2)
         ALIAS      ATAN
         ALIAS      ATAN2
         NAME       IHCSATN2(R)
         INCLUDE    LM501(IHCNAMEL)
         ALIAS      FRDNL#
         ALIAS      FWRNL#
         NAME       IHCNAMEL(R)
         INCLUDE    LM501(IHCDBUG)
         ALIAS      DEBUG#
         NAME       IHCDBUG(R)
     INCLUDE     LM501(IHCFCOMH)
     ALIAS       IBCOM#
     NAME      IHCFCOMH(R)
     INCLUDE   LM501(IHCFINTH)
     ALIAS     ARITH#
     NAME      IHCFINTH(R)
   INCLUDE   LM501(IHCTRCH)
   ALIAS      IHCERRM
   ALIAS      ERRMON
   NAME    IHCTRCH(R)
         INCLUDE    LM501(IHCCGOTO)
         ALIAS      CGOTO#
         NAME       IHCCGOTO(R)
         INCLUDE    LM501(IHCIBERR)
         ALIAS      IBERR#
         NAME       IHCIBERR(R)
/*
//SG97 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,OVLY'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IERRCM)
//SM023 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.SM023
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE   SM023(IERRCM)
 INCLUDE SYSPUNCH(IERAM1)
 INCLUDE   SM023(IERRCU)
 OVERLAY A01
 INCLUDE  SM023(IER8CM)
 OVERLAY A01
 INCLUDE   SM023(IERRCQ)
 OVERLAY A02
 INCLUDE   SM023(IERRCC,IERRCY)
 OVERLAY A02
 INCLUDE   SM023(IERRCD,IERRC3)
 OVERLAY A03
 INCLUDE   SM023(IERRCE,IERRCF)
 OVERLAY A03
 INCLUDE   SM023(IERRCG,IERRCW)
 OVERLAY A03
 INCLUDE   SM023(IERRCH,IERRCX)
 OVERLAY A02
 INCLUDE   SM023(IERRCP)
 OVERLAY A01
 INCLUDE   SM023(IERRCI)
 INCLUDE  SM023(IER8CI)
 OVERLAY A01
 INCLUDE   SM023(IERRC2)
 OVERLAY A01
 INCLUDE   SM023(IERRCN)
 OVERLAY A01
 INCLUDE  SM023(IERBGB)
 OVERLAY A01
 INCLUDE   SM023(IERRCK)
 OVERLAY A01
 ENTRY IERRCM
 NAME IERRCM(R)
 INCLUDE   SM023(IERRCZ)
 INCLUDE   SM023(IERRCU)
 OVERLAY B01
 INCLUDE   SM023(IERRC1)
 OVERLAY B01
 INCLUDE   SM023(IERRC4)
 OVERLAY B01
 INCLUDE   SM023(IERRCJ)
 OVERLAY B01
 INCLUDE   SM023(IERAO1)
 OVERLAY B01
 INCLUDE   SM023(IERAOL)
 OVERLAY B01
 INCLUDE   SM023(IERAOM)
 ENTRY IERRCZ
 NAME IERRCZ(R)
/*
//SG98 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IEPCBL00)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE SYSPUNCH(IEPCBL00)
/*
//SG99 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IKFCBL01)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE SYSPUNCH(IKFCBL01)
/*
//SG100 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IEX00)
//AL531  DD    DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.AL531
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE SYSPUNCH(IEXCWKA)
 INCLUDE AL531(IEX00)
 ENTRY IEX00000
 ALIAS ALGOL
/*
//SG101 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//AL531  DD    DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.AL531
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE AL531(IEX21)
 INCLUDE AL531(IEX21M)
 ENTRY IEX21000
 ALIAS IEX21000
 NAME IEX21(R)
 INCLUDE AL531(IEX31)
 INCLUDE AL531(IEX31M)
 ENTRY IEX31000
 ALIAS IEX31000
 NAME IEX31(R)
 INCLUDE AL531(IEX51)
 INCLUDE AL531(IEX51M)
 ENTRY IEX51000
 ALIAS IEX51000,IEX51002,IEX51ER1,IEX51ER2
 NAME IEX51(R)
/*
//SG102 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IHIERR)
//LM532  DD    DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.LM532
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE LM532(IHIERR)
 INCLUDE LM532(IHIERM)
 ENTRY IHIERROR
 ALIAS IHIERROR
/*
//SG103 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB(IEMAF)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE SYSPUNCH(IEMAF)
/*
//SG104 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//RG038 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.RG038
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE RG038(IESRPG)
 ENTRY IESRPG
 ALIAS RPG
 NAME IESRPG(R)
 INCLUDE RG038(IES00010,IES00910)
 ENTRY IESCEX
 NAME RPG10000(R)
 INCLUDE RG038(IES03010,IES03910)
 ENTRY IESCEX
 NAME RPG10030(R)
 INCLUDE RG038(IES04010,IES04910)
 ENTRY IESCEX
 NAME RPG10040(R)
 INCLUDE RG038(IES05010,IES05910)
 ENTRY IESCEX
 NAME RPG10050(R)
 INCLUDE RG038(IES06010,IES06910)
 ENTRY IESCEX
 NAME RPG10060(R)
 INCLUDE RG038(IES07010,IES07910)
 ENTRY IESCEX
 NAME RPG10070(R)
 INCLUDE RG038(IES08010,IES08910)
 ENTRY IESCEX
 NAME RPG10080(R)
 INCLUDE RG038(IES08A10)
 ENTRY IES08A10
 NAME RPG1008A(R)
 INCLUDE RG038(IES09010,IES09910)
 ENTRY IESCEX
 NAME RPG10090(R)
 INCLUDE RG038(IES10010,IES10910)
 ENTRY IESCEX
 NAME RPG10100(R)
 INCLUDE RG038(IES11010,IES11910)
 ENTRY IESCEX
 NAME RPG10110(R)
 INCLUDE RG038(IES12010,IES12910)
 ENTRY IESCEX
 NAME RPG10120(R)
 INCLUDE RG038(IES13010,IES13910)
 ENTRY IESCEX
 NAME RPG10130(R)
 INCLUDE RG038(IES14010,IES14910)
 ENTRY IESCEX
 NAME RPG10140(R)
 INCLUDE RG038(IES15010,IES15910)
 ENTRY IESCEX
 NAME RPG10150(R)
 INCLUDE RG038(IES16010,IES16910)
 ENTRY IESCEX
 NAME RPG10160(R)
 INCLUDE RG038(IES17010,IES17910)
 ENTRY IESCEX
 NAME RPG10170(R)
 INCLUDE RG038(IES18010,IES18910)
 ENTRY IESCEX
 NAME RPG10180(R)
 INCLUDE RG038(IES19010,IES19910)
 ENTRY IESCEX
 NAME RPG10190(R)
 INCLUDE RG038(IES20010,IES20910)
 ENTRY IESCEX
 NAME RPG10200(R)
 INCLUDE RG038(IES21010,IES21910)
 ENTRY IESCEX
 NAME RPG10210(R)
 INCLUDE RG038(IES22010,IES22910)
 ENTRY IESCEX
 NAME RPG10220(R)
 INCLUDE RG038(IES23010,IES23910)
 ENTRY IESCEX
 NAME RPG10230(R)
 INCLUDE RG038(IES24010,IES24110,IES24210)
 INCLUDE RG038(IES24310,IES24410,IES24510)
 INCLUDE RG038(IES24610,IES24710,IES24910)
 ENTRY IESCEX
 NAME RPG10240(R)
 INCLUDE RG038(IES25010)
 ENTRY IES25010
 NAME RPG10250(R)
/*
//SG105 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//AS037 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.AS037
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE  AS037(IEUASM)
 ENTRY IEUASM
 ALIAS ASMBLR
 NAME IEUASM(R)
 INCLUDE  AS037(IEUFI)
 ENTRY IEUFI
 NAME IEUFI(R)
 INCLUDE  AS037(IEUFPP)
 INCLUDE  AS037(IEUFD)
 ENTRY IEUFPP
 NAME IEUFPP(R)
 INCLUDE  AS037(IEUF1)
 ENTRY IEUF1
 NAME IEUF1(R)
 INCLUDE  AS037(IEUF2)
 INCLUDE  AS037(IEUF2A)
 ENTRY IEUF2
 NAME IEUF2(R)
 INCLUDE  AS037(IEUF3)
 ENTRY IEUF3
 NAME IEUF3(R)
 INCLUDE  AS037(IEUF3E)
 NAME IEUF3E(R)
 INCLUDE  AS037(IEUF7C)
 INCLUDE  AS037(IEUF7D)
 INCLUDE  AS037(IEUF7E)
 INCLUDE  AS037(IEUF7G)
 INCLUDE  AS037(IEUF7I)
 INCLUDE  AS037(IEUF7N)
 INCLUDE  AS037(IEUF7V)
 INCLUDE  AS037(IEUF7X)
 ENTRY IEUF7
 NAME IEUF7(R)
 INCLUDE  AS037(IEUF8A)
 INCLUDE  AS037(IEUF8C)
 INCLUDE  AS037(IEUF8D)
 INCLUDE  AS037(IEUF8I)
 INCLUDE  AS037(IEUF8L)
 INCLUDE  AS037(IEUF8M)
 INCLUDE  AS037(IEUF8N)
 INCLUDE  AS037(IEUF8P)
 INCLUDE  AS037(IEUF8S)
 INCLUDE  AS037(IEUF8V)
 ENTRY IEUF8
 NAME IEUF8(R)
 INCLUDE  AS037(IEUMAC)
 ENTRY IEUMAC
 NAME IEUMAC(R)
 INCLUDE  AS037(IEURTA)
 ENTRY IEURTA
 NAME IEURTA(R)
 INCLUDE  AS037(IEUERR)
 NAME IEUERR(R)
/*
//SG106 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,OVLY,XCAL,LET'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//ED521  DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.ED521    'F' EDITORS
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE ED521(IEWLMROU,IEWLMAPT,IEWLMINT,IEWLMOPT)
 INCLUDE ED521(IEWLMINP,IEWLMRAT,IEWLMEND,IEWLMESD)
 INCLUDE ED521(IEWLMRCG,IEWLMSYM,IEWLMINC,IEWLMSCN)
 INCLUDE ED521(IEWLMADA,IEWLMOUT,IEWLMENT,IEWLMENS)
 INCLUDE ED521(IEWLMFNL,IEWLMBTP,IEWLMMAP,IEWLMSCD)
 INCLUDE ED521(IEWLMREL,IEWLMIDR)
 INCLUDE SYSPUNCH(IEWLM128)
 ALIAS LINKEDIT
 ALIAS IEWL
 ENTRY IEWLMROU
 NAME IEWLF128(R)       * * *   IEW0201   CANCEL OVERLAY FOR F128
/*
//SG107 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//PL552 DD DISP=SHR,VOL=(,RETAIN),DSN=SYS1.PL552
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE  PL552(IKM001,IKM02,IKM03,IKM11,IKM12)
 INCLUDE  PL552(IKM131,IKM132,IKM133,IKM134)
 INCLUDE  PL552(IKM135,IKM136)
 ENTRY IKM001
 ALIAS  PLICHK20
 ALIAS PLIFSCAN
 ALIAS PLISCAN
 NAME  IKM001(R)
 INCLUDE PL552(IKM003,IKM02,IKM03,IKM11,IKM12)
 INCLUDE PL552(IKM132,IKM133,IKM134,IKM135)
 ENTRY IKM003
 ALIAS PLICHK16
 NAME  IKM003(R)
/*
//SG108 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,RENT'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//FO550 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.FO550
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
  INCLUDE FO550(IPDSN,IPDER)
  NAME IPDSNEXC(R)
/*
//SG109 EXEC PGM=IEWL,COND=(8,LT),                               XXXXXXXXXX
//             PARM='NCAL,MAP,RENT,REFR,REUS,OL'
//SYSUT1 DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.SG3
//SYSPRINT DD SPACE=(121,(850,100),RLSE),
// DCB=(RECFM=FB,LRECL=121,BLKSIZE=605),
//             SYSOUT=A,UNIT=(3330,3)
//SYSLMOD DD DISP=OLD,UNIT=3330,VOLUME=SER=MVTRES,                 XXXXXXXX
//             DSNAME=SYS1.LINKLIB
//LD547  DD DSNAME=SYS1.LD547,DISP=SHR,VOLUME=(,RETAIN)
//SYSPUNCH DD DISP=OLD,VOLUME=(,RETAIN),DSNAME=SYS1.OBJPDS
//SYSLIN  DD  *
 INCLUDE LD547(IEWLDIOC,IEWLDREL,IEWLDLIB,IEWLDIDY)
 INCLUDE SYSPUNCH(IEWLDDEF)
 ENTRY IEWLIOCA
 ALIAS IEWLOAD
 NAME IEWLOADR(R)
/*
//SG110  EXEC PGM=IEBCOPY,COND=(8,LT)
//SYSUT3 DD DISP=SHR,DSNAME=SYS1.SG3
//SYSUT4 DD DISP=SHR,DSNAME=SYS1.SG4
//SYSPRINT DD SPACE=(121,(750,100),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=3630),                  X
//             SYSOUT=A,UNIT=(3330,3)
//PARMLIBA DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.PARMLIB
//PARMLIB DD DSNAME=SYS1.PARMLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=151,DISP=OLD
//NL511 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.NL511
//LM512 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.LM512
//PL1LIBA DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.PL1LIB
//PL1LIB DD DSNAME=SYS1.PL1LIB,VOLUME=(,RETAIN,SER=MVTRES),        XXXXXXXX
//             UNIT=151,DISP=OLD
//LM501 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.LM501
//FORTLIBA DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.FORTLIB
//FORTLIB DD DSNAME=SYS1.FORTLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=151,DISP=OLD
//CO503 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CO503
//CB545  DD  DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.CB545
//COBLIBA DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.COBLIB
//LM546  DD  DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.LM546
//COBLIB DD DSNAME=SYS1.COBLIB,VOLUME=(,RETAIN,SER=MVTRES),        XXXXXXXX
//             UNIT=151,DISP=OLD
//SM023 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.SM023
//SORTLIBA DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.SORTLIB
//SORTLIB DD DSNAME=SYS1.SORTLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=151,DISP=OLD
//AL531 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.AL531
//LM532 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.LM532
//ALGLIB DD DSNAME=SYS1.ALGLIB,VOLUME=(,RETAIN,SER=MVTRES),        XXXXXXXX
//             UNIT=151,DISP=OLD
//PROCLIBA DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.PROCLIB
//PROCLIB DD DSNAME=SYS1.PROCLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=151,DISP=OLD
//LD547 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.LD547
//PL552 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.PL552
//FO550 DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.FO550
//SVCLIB DD DSNAME=SYS1.SVCLIB,VOLUME=(,RETAIN,SER=MVTRES),        XXXXXXXX
//             UNIT=151,DISP=OLD
//LINKLIB DD DSNAME=SYS1.LINKLIB,VOLUME=(,RETAIN,SER=MVTRES),      XXXXXXXX
//             UNIT=3330,DISP=OLD
//SYSIN DD *
 COPY OUTDD=LINKLIB,INDD=NL511
 COPY OUTDD=LINKLIB,INDD=LM512
 SELECT MEMBER=(IHEOPNA,IHEOPOA,IHEOPPA,IHEOPQA,IHEOPZA)
 SELECT MEMBER=(IHETOMA,IHETOMB,IHETOMC,IHETOMD,IHETOME)
 SELECT MEMBER=(IHECLSA)
 SELECT MEMBER=(IHEITBA,IHEITCA)
 SELECT MEMBER=(IHEITDA,IHEITEA)
 SELECT MEMBER=(IHEITFA,IHEITGA)
 SELECT MEMBER=(IHEITKA,IHEITLA)
 SELECT MEMBER=(IHEITJA,IHEITHA)
 SELECT MEMBER=(IHECLTA,IHECLTB,IHECTTA,IHECTTB,IHECTTC)
 SELECT MEMBER=(IHEERNA,IHEERSA,IHEESSA,IHEESSB,IHEERSB)
 SELECT MEMBER=(IHEESMA,IHEESMB)
 SELECT MEMBER=(IHEERIA,IHEERDA,IHEEREA,IHEEROA,IHEERPA)
 SELECT MEMBER=(IHEERTA,IHETEXA,IHETEXB,IHETEXC)
 SELECT MEMBER=(IHEZZAA,IHEZZBA)
 SELECT MEMBER=(IHEZZCA,IHEZZFA)
 SELECT MEMBER=(IHESUBA,IHEITPA,IHESTAA)
 SELECT MEMBER=(IHEITMA,IHEITNA,IHEITOA)
 COPY OUTDD=PL1LIB,INDD=PL1LIBA
 COPY OUTDD=PL1LIB,INDD=LM512
 SELECT MEMBER=(IHEADV0)
 SELECT MEMBER=(IHEABU0,IHEABV0,IHEABW0,IHEABZ0)
 SELECT MEMBER=(IHEATWN,IHEATWH,IHEATZN,IHEATZH)
 SELECT MEMBER=(IHEDIMA,IHEDOMA,IHEDZW0,IHEDZZ0,IHEDVU0,IHEDVV0)
 SELECT MEMBER=(IHELNW0,IHELNZ0,IHEMPU0,IHEMPV0,IHEEXW0,IHEEXZ0)
 SELECT MEMBER=(IHEMZUM,IHEMZUD,IHEMZVM,IHEMZVD)
 SELECT MEMBER=(IHEMZW0,IHEMZZ0,IHEPDW0,IHEPDX0,IHEPDZ0)
 SELECT MEMBER=(IHEPSW0,IHEPSX0,IHEPSZ0,IHESMX0)
 SELECT MEMBER=(IHESNWK,IHESNWC,IHESNWS,IHESNWZ)
 SELECT MEMBER=(IHESNZC,IHESNZS,IHESNZK,IHESNZZ)
 SELECT MEMBER=(IHESQW0,IHESQZ0,IHESSX0,IHETNWH,IHETNWN)
 SELECT MEMBER=(IHETNZH,IHETNZN)
 SELECT MEMBER=(IHEXIU0,IHEXIV0,IHEXIW0,IHEXIZ0)
 SELECT MEMBER=(IHEXXW0,IHEXXZ0)
 SELECT MEMBER=(IHEYGWV,IHEYGWS,IHEYGXV,IHEYGXS,IHEYGZV,IHEYGZS)
 SELECT MEMBER=(IHEVCSA,IHEVCSB,IHEVCS)
 SELECT MEMBER=(IHEOSTA)
 SELECT MEMBER=(IHEOSIA)
 SELECT MEMBER=(IHEOSWA)
 COPY OUTDD=FORTLIB,INDD=LM501
 SELECT MEMBER=(IHCLLOG,DLOG,DLOG10,IHCSLOG,ALOG,ALOG10)
 SELECT MEMBER=(IHCLEXP,DEXP,IHCSEXP,EXP,IHCLSQRT,DSQRT)
 SELECT MEMBER=(IHCSSQRT,SQRT,IHCFMAXD,DMAX1,DMIN1)
 SELECT MEMBER=(IHCFMAXI,AMAX0,AMIN0,MAX0,MIN0)
 SELECT MEMBER=(IHCFMAXR,AMAX1,AMIN1,MAX1,MIN1)
 SELECT MEMBER=(IHCLSCN,DSIN,DCOS,IHCSSCN,SIN,COS)
 SELECT MEMBER=(IHCLTANH,DTANH,IHCSTANH,TANH)
 SELECT MEMBER=(IHCFSLIT,SLITE,SLITET,IHCFOVER,OVERFL)
 SELECT MEMBER=(IHCFDVCH,DVCHK,IHCFEXIT,EXIT,IHCFDUMP,DUMP,PDUMP)
 SELECT MEMBER=(IHCCLLOG,CDLOG,IHCCSLOG,CLOG,IHCCLEXP,CDEXP)
 SELECT MEMBER=(IHCCSEXP,CEXP,IHCCLSQT,CDSQRT,IHCCSSQT,CSQRT)
 SELECT MEMBER=(IHCLASCN,DARSIN,DARCOS)
 SELECT MEMBER=(IHCSASCN,ARSIN,ARCOS)
 SELECT MEMBER=(IHCSGAMA,GAMMA,ALGAMA)
 SELECT MEMBER=(IHCCLSCN,CDSIN,CDCOS)
 SELECT MEMBER=(IHCCSSCN,CSIN,CCOS,IHCLTNCT,DTAN,DCOTAN)
 SELECT MEMBER=(IHCSTNCT,TAN,COTAN,IHCLSCNH,DSINH,DCOSH)
 SELECT MEMBER=(IHCSSCNH,SINH,COSH)
 SELECT MEMBER=(IHCCLABS,CDABS,IHCCSABS,CABS)
 SELECT MEMBER=(IHCLERF,DERF,DERFC,IHCSERF,ERF,ERFC)
 SELECT MEMBER=(IHCLGAMA,DGAMMA,DLGAMA)
 SELECT MEMBER=(IHCFMODI,MOD,IHCFMODR,DMOD,AMOD)
 SELECT MEMBER=(IHCFAINT,AINT,IHCFIFIX,IDINT,INT)
 COPY OUTDD=LINKLIB,INDD=LM501
 SELECT MEMBER=(IHCSTAE)
 SELECT MEMBER=(IHCADJST)
 COPY OUTDD=FORTLIB,INDD=FORTLIBA
  EXCLUDE  MEMBER=IHCUATBL
 EXCLUDE MEMBER=IHCFCOME
 EXCLUDE MEMBER=IHCIBERR
 EXCLUDE MEMBER=IHCCGOTO
 EXCLUDE MEMBER=IHCLLOG
 EXCLUDE MEMBER=DLOG
 EXCLUDE MEMBER=DLOG10
 EXCLUDE MEMBER=IHCSLOG
 EXCLUDE MEMBER=ALOG
 EXCLUDE MEMBER=ALOG10
 EXCLUDE MEMBER=IHCLEXP
 EXCLUDE MEMBER=DEXP
 EXCLUDE MEMBER=IHCSEXP
 EXCLUDE MEMBER=EXP
 EXCLUDE MEMBER=IHCLSQRT
 EXCLUDE MEMBER=DSQRT
 EXCLUDE MEMBER=IHCSSQRT
 EXCLUDE MEMBER=SQRT
 EXCLUDE MEMBER=IHCLATAN
 EXCLUDE MEMBER=DATAN
 EXCLUDE MEMBER=IHCSATAN
 EXCLUDE MEMBER=ATAN
 EXCLUDE MEMBER=IHCFMAXD
 EXCLUDE MEMBER=DMAX1
 EXCLUDE MEMBER=DMIN1
 EXCLUDE MEMBER=IHCFMAXI
 EXCLUDE MEMBER=AMAX0
 EXCLUDE MEMBER=AMIN0
 EXCLUDE MEMBER=MAX0
 EXCLUDE MEMBER=MIN0
 EXCLUDE MEMBER=IHCFMAXR
 EXCLUDE MEMBER=AMAX1
 EXCLUDE MEMBER=AMIN1
 EXCLUDE MEMBER=MAX1
 EXCLUDE MEMBER=MIN1
 EXCLUDE MEMBER=IHCFMODI
 EXCLUDE MEMBER=MOD
 EXCLUDE MEMBER=IHCFMODR
 EXCLUDE MEMBER=DMOD
 EXCLUDE MEMBER=AMOD
 EXCLUDE MEMBER=IHCFAINT
 EXCLUDE MEMBER=AINT
 EXCLUDE MEMBER=IHCFIFIX
 EXCLUDE MEMBER=IDINT
 EXCLUDE MEMBER=INT
 EXCLUDE MEMBER=IFIX
 EXCLUDE MEMBER=IHCFIXPI
 EXCLUDE MEMBER=IHCFRXPI
 EXCLUDE MEMBER=IHCLSCN
 EXCLUDE MEMBER=DSIN
 EXCLUDE MEMBER=DCOS
 EXCLUDE MEMBER=IHCSSCN
 EXCLUDE MEMBER=SIN
 EXCLUDE MEMBER=COS
 EXCLUDE MEMBER=IHCLTANH
 EXCLUDE MEMBER=DTANH
 EXCLUDE MEMBER=IHCSTANH
 EXCLUDE MEMBER=TANH
 EXCLUDE MEMBER=IHCFDXPI
 EXCLUDE MEMBER=IHCFRXPR
 EXCLUDE MEMBER=IHCFDXPD
 EXCLUDE MEMBER=IHCFSLIT
 EXCLUDE MEMBER=SLITE
 EXCLUDE MEMBER=SLITET
 EXCLUDE MEMBER=IHCFOVER
 EXCLUDE MEMBER=OVERFL
 EXCLUDE MEMBER=IHCFDVCH
 EXCLUDE MEMBER=DVCHK
 EXCLUDE MEMBER=IHCFEXIT
 EXCLUDE MEMBER=EXIT
 EXCLUDE MEMBER=IHCFDUMP
 EXCLUDE MEMBER=DUMP
 EXCLUDE MEMBER=PDUMP
 EXCLUDE MEMBER=IHCFLOAT
 EXCLUDE MEMBER=DFLOAT
 EXCLUDE MEMBER=FLOAT
 EXCLUDE MEMBER=IHCIBERH
 EXCLUDE MEMBER=IHCCLLOG
 EXCLUDE MEMBER=CDLOG
 EXCLUDE MEMBER=IHCCSLOG
 EXCLUDE MEMBER=CLOG
 EXCLUDE MEMBER=IHCCLEXP
 EXCLUDE MEMBER=CDEXP
 EXCLUDE MEMBER=IHCCSEXP
 EXCLUDE MEMBER=CEXP
 EXCLUDE MEMBER=IHCCLSQT
 EXCLUDE MEMBER=CDSQRT
 EXCLUDE MEMBER=IHCCSSQT
 EXCLUDE MEMBER=CSQRT
 EXCLUDE MEMBER=IHCLASCN
 EXCLUDE MEMBER=DARSIN
 EXCLUDE MEMBER=DARCOS
 EXCLUDE MEMBER=IHCSASCN
 EXCLUDE MEMBER=ARSIN
 EXCLUDE MEMBER=ARCOS
 EXCLUDE MEMBER=IHCSGAMA
 EXCLUDE MEMBER=GAMMA
 EXCLUDE MEMBER=ALGAMA
 EXCLUDE MEMBER=IHCCLAS
 EXCLUDE MEMBER=IHCCSAS
 EXCLUDE MEMBER=IHCFCDXI
 EXCLUDE MEMBER=IHCFCXPI
 EXCLUDE MEMBER=IHCCLSCN
 EXCLUDE MEMBER=CDSIN
 EXCLUDE MEMBER=CDCOS
 EXCLUDE MEMBER=IHCCSSCN
 EXCLUDE MEMBER=CSIN
 EXCLUDE MEMBER=CCOS
 EXCLUDE MEMBER=IHCLTNCT
 EXCLUDE MEMBER=DTAN
 EXCLUDE MEMBER=DCOTAN
 EXCLUDE MEMBER=IHCSTNCT
 EXCLUDE MEMBER=TAN
 EXCLUDE MEMBER=COTAN
 EXCLUDE MEMBER=IHCLSCNH
 EXCLUDE MEMBER=DSINH
 EXCLUDE MEMBER=DCOSH
 EXCLUDE MEMBER=IHCSSCNH
 EXCLUDE MEMBER=SINH
 EXCLUDE MEMBER=COSH
 EXCLUDE MEMBER=IHCCLABS
 EXCLUDE MEMBER=CDABS
 EXCLUDE MEMBER=IHCCSABS
 EXCLUDE MEMBER=CABS
 EXCLUDE MEMBER=IHCLERF
 EXCLUDE MEMBER=DERF
 EXCLUDE MEMBER=DERFC
 EXCLUDE MEMBER=IHCSERF
 EXCLUDE MEMBER=ERF
 EXCLUDE MEMBER=ERFC
 EXCLUDE MEMBER=IHCLGAMA
 EXCLUDE MEMBER=DGAMMA
 EXCLUDE MEMBER=DLGAMA
 EXCLUDE MEMBER=IHCFCOMH
 EXCLUDE MEMBER=IHCFCVTH
 EXCLUDE MEMBER=IHCDBUG
 EXCLUDE MEMBER=IHCFIOSH
 EXCLUDE MEMBER=IHCLATN2
 EXCLUDE MEMBER=DATN2
 EXCLUDE MEMBER=IHCSATN2
 EXCLUDE MEMBER=ATAN2
 EXCLUDE MEMBER=IHCNAMEL
 EXCLUDE MEMBER=IHCDIOSE
 EXCLUDE MEMBER=IHCTRCH
 EXCLUDE MEMBER=IHCUOPT
 EXCLUDE MEMBER=IHCFINTH
 EXCLUDE MEMBER=IHCEFNTH
 EXCLUDE MEMBER=IHCETRCH
 EXCLUDE MEMBER=IHCERRM
 EXCLUDE MEMBER=ERRMON
 EXCLUDE MEMBER=ERRTRA
 EXCLUDE MEMBER=IHCEDIOS
 EXCLUDE MEMBER=IHCEFIOS
 EXCLUDE MEMBER=FIOCSB
 EXCLUDE MEMBER=IHCECOMH
 EXCLUDE MEMBER=IHCERRE
 EXCLUDE MEMBER=IHCFOPT
 EXCLUDE MEMBER=ERRSET
 EXCLUDE MEMBER=ERRSAV
 EXCLUDE MEMBER=ERRSTR
 COPY OUTDD=LINKLIB,INDD=CO503
 COPY OUTDD=LINKLIB,INDD=CB545
 COPY OUTDD=COBLIB,INDD=COBLIBA
 SELECT MEMBER=(IHD00000)
 SELECT MEMBER=(IHD00001)
 SELECT MEMBER=(IHD00100)
 SELECT MEMBER=(IHD00101)
 SELECT MEMBER=(IHD00200)
 SELECT MEMBER=(IHD00201)
 SELECT MEMBER=(IHD00300)
 SELECT MEMBER=(IHD00301)
 SELECT MEMBER=(IHD00400)
 SELECT MEMBER=(IHD00401)
 SELECT MEMBER=(IHD00500)
 SELECT MEMBER=(IHD00501)
 SELECT MEMBER=(IHD00600)
 SELECT MEMBER=(IHD00601)
 SELECT MEMBER=(IHD00602)
 SELECT MEMBER=(IHD00700)
 SELECT MEMBER=(IHD00701)
 SELECT MEMBER=(IHD00800)
 SELECT MEMBER=(IHD00801)
 SELECT MEMBER=(IHD00802)
 SELECT MEMBER=(IHD00900)
 SELECT MEMBER=(IHD00901)
 SELECT MEMBER=(IHD01000)
 SELECT MEMBER=(IHD01001)
 SELECT MEMBER=(IHD01002)
 SELECT MEMBER=(IHD01100)
 SELECT MEMBER=(IHD01101)
 SELECT MEMBER=(IHD01102)
 SELECT MEMBER=(IHD01200)
 SELECT MEMBER=(IHD01201)
 SELECT MEMBER=(IHD01300)
 SELECT MEMBER=(IHD01301)
 SELECT MEMBER=(IHD01400)
 SELECT MEMBER=(IHD01401)
 SELECT MEMBER=(IHD01500)
 SELECT MEMBER=(IHD01501)
 SELECT MEMBER=(IHD01502)
 SELECT MEMBER=(IHD01504)
 SELECT MEMBER=(IHD01600)
 SELECT MEMBER=(IHD01601)
 SELECT MEMBER=(IHD01602)
 SELECT MEMBER=(IHD01700)
 SELECT MEMBER=(IHD01701)
 SELECT MEMBER=(IHD01800)
 SELECT MEMBER=(IHD01801)
 SELECT MEMBER=(IHD01802)
 SELECT MEMBER=(IHD01900)
 SELECT MEMBER=(IHD01901)
 SELECT MEMBER=(IHD01902)
 SELECT MEMBER=(IHD01904)
 SELECT MEMBER=(IHD01908)
 SELECT MEMBER=(IHD02000)
 SELECT MEMBER=(IHD02001)
 SELECT MEMBER=(IHD02002)
 SELECT MEMBER=(IHD02100)
 SELECT MEMBER=(IHD02101)
 SELECT MEMBER=(IHD02200)
 SELECT MEMBER=(IHD02201)
 SELECT MEMBER=(IHD02300)
 SELECT MEMBER=(IHD02301)
 SELECT MEMBER=(IHD02302)
 SELECT MEMBER=(IHD02304)
 SELECT MEMBER=(IHD02400)
 SELECT MEMBER=(IHD02401)
 SELECT MEMBER=(IHD02500)
 SELECT MEMBER=(IHD02501)
 SELECT MEMBER=(IHD02600)
 SELECT MEMBER=(IHD02601)
 SELECT MEMBER=(IHD02700)
 SELECT MEMBER=(IHD02701)
 SELECT MEMBER=(IHD02800)
 SELECT MEMBER=(IHD02801)
 SELECT MEMBER=(IHD02802)
 SELECT MEMBER=(IHD02900)
 SELECT MEMBER=(IHD02901)
 SELECT MEMBER=(IHD03001)
 SELECT MEMBER=(IHD03002)
 SELECT MEMBER=(IHD03004)
 SELECT MEMBER=(IHD03008)
 SELECT MEMBER=(IHD03101)
 SELECT MEMBER=(IHD03102)
 SELECT MEMBER=(IHD03104)
 SELECT MEMBER=(IHD03108)
 SELECT MEMBER=(IHD03300)
 SELECT MEMBER=(IHD03301)
 SELECT MEMBER=(IHD03402)
 SELECT MEMBER=(IHD03801)
 SELECT MEMBER=(IHD03900)
 SELECT MEMBER=(IHD03901)
 SELECT MEMBER=(IHD04000)
 SELECT MEMBER=(IHD04001)
 SELECT MEMBER=(IHD04100)
 SELECT MEMBER=(IHD04101)
 COPY OUTDD=COBLIB,INDD=LM546
 COPY OUTDD=LINKLIB,INDD=SM023
           SELECT MEMBER=(IERRCO00,SORT,IERRCB)
 COPY OUTDD=SORTLIB,INDD=SORTLIBA
 SELECT MEMBER=(IERABQ,IERABR,IERADL,IERADM,IERAGH)
 SELECT MEMBER=(IERAMA,IERAMB,IERAMC,IERDM4,IERAPI)
 SELECT MEMBER=(IERRMB,IERRMC,IERRPG,IERAPJ,IERAP1)
 SELECT MEMBER=(IERAP2,IERRCT,IERRC6,IERRC7,IERRC8,IERRC9)
 SELECT MEMBER=(IERAP3,IERRCV,IERRDL,IERRGA,IERRMA)
 SELECT MEMBER=(IERAOV,IERROV,IERAOQ,IERROQ,IERAPC)
 SELECT MEMBER=(IERCHK,IERRPF,IERAPH,IERAPG,IERRPC)
 COPY OUTDD=SORTLIB,INDD=SM023
           SELECT MEMBER=(IERAGK)
 SELECT MEMBER=(IERRGC,IERRGE,IERROK,IERROT,IERRPE)
 SELECT MEMBER=(IERRPB,IERAGC,IERAGE,IERAOK,IERAOT)
 SELECT MEMBER=(IERAPE,IERAPB,IERAGI,IERAGJ)
           SELECT MEMBER=(IERAPL)
           SELECT MEMBER=(IER8GB,IER9GB,IER8GC,IER9GC)
           SELECT MEMBER=(IER8PA,IER9PA,IER8ON,IER9ON)
           SELECT MEMBER=(IER9GN,IER8PM)
           SELECT MEMBER=(IERRBL,IERABL,IERRDH,IERADH)
           SELECT MEMBER=(IERAOB,IERROB,IERABS)
 SELECT MEMBER=(IERRBB,IERRBG,IERRDB,IERABB,IERABG)
 SELECT MEMBER=(IERADB)
           SELECT MEMBER=(IERRBP,IERABP)
 SELECT MEMBER=(IERRBC,IERRBH,IERRDC,IERABC,IERABH)
 SELECT MEMBER=(IERADC)
           SELECT MEMBER=(IERRDI,IERADI,IERRBN,IERABN)
           SELECT MEMBER=(IERAOD,IERROD)
 SELECT MEMBER=(IERRBE,IERRBF,IERRBI,IERRDG,IERABE)
 SELECT MEMBER=(IERABF,IERABI,IERADG)
 SELECT MEMBER=(IER8BN,IER9BN)
           SELECT MEMBER=(IERAOX,IERROX,IERADP,IERRDP)
           SELECT MEMBER=(IERABT,IERRBT,IERABY,IERRBY)
           SELECT MEMBER=(IERABA,IERRBA,IERABV,IERRBV)
           SELECT MEMBER=(IERAOZ,IERROZ,IERADT,IERRDT)
           SELECT MEMBER=(IERABU,IERRBU,IERABZ,IERRBZ)
           SELECT MEMBER=(IERADQ,IERRDQ)
           SELECT MEMBER=(IERAOU,IERROU)
           SELECT MEMBER=(IERROP,IERAOP)
           SELECT MEMBER=(IERROA,IERAOA)
           SELECT MEMBER=(IERROW,IERAOW)
           SELECT MEMBER=(IERAOC,IERROC)
           SELECT MEMBER=(IERAOY,IERROY)
 COPY OUTDD=LINKLIB,INDD=AL531
 SELECT MEMBER=(IEX10,IEX11,IEX20,IEX30,IEX40,IEX50)
 SELECT MEMBER=(IEX10000,IEX11000,IEX20000,IEX30000)
 SELECT MEMBER=(IEX40000,IEX50000)
 COPY OUTDD=ALGLIB,INDD=LM532
 SELECT MEMBER=(IHIFDD,IHIFDI,IHIFII,IHIFRI,IHIFRR)
 SELECT MEMBER=(IHIFSA,IHIGPR,IHIIAR,IHIIBA,IHIIBO)
 SELECT MEMBER=(IHIIDE,IHIIOR,IHIISY,IHILAT,IHILEX)
 SELECT MEMBER=(IHILLO,IHILOR,IHILSC,IHILSQ,IHIOAR)
 SELECT MEMBER=(IHIOBA,IHIOBO,IHIOIN,IHIOST,IHIOSY)
 SELECT MEMBER=(IHIOTA,IHIPTT,IHISAT,IHISEX,IHISLO)
 SELECT MEMBER=(IHISOR,IHISSC,IHISSQ,IHISYS)
 SELECT MEMBER=(IHIFSAIN,IHIGPRCL,IHIGPRGT,IHIGPRPT)
 SELECT MEMBER=(IHIIARRT,IHIIARRY,IHIIBARR,IHIIBOAR)
 SELECT MEMBER=(IHIIBOOL,IHIIDEAI,IHIIDEII,IHIIDEIR)
 SELECT MEMBER=(IHIIOREN,IHIIOREV,IHIIORNX,IHIIOROP)
 SELECT MEMBER=(IHIOBOOL,IHIOINAR,IHIOINTG,IHIOSTRG)
 SELECT MEMBER=(IHIOSYMB,IHIOTARR,IHIPTTAB,IHISORAR)
 SELECT MEMBER=(IHIISYMB,IHILORAR,IHILOREL,IHILSCC)
 SELECT MEMBER=(IHIOARRY,IHIOBARR,IHIOBOAR,IHILSCS)
 SELECT MEMBER=(IHISOREL,IHISYSCT,IHISSCC,IHISSCS)
 COPY OUTDD=LINKLIB,INDD=LD547
 SELECT MEMBER=(IEWLDRGO,LOADER)    LOADER IS ALIAS
 COPY OUTDD=LINKLIB,INDD=PL552
 SELECT MEMBER=(IKM21,IKM22,IKM23)
 COPY OUTDD=LINKLIB,INDD=FO550
  SELECT MEMBER=(IPDAGH)
 COPY OUTDD=PARMLIB,INDD=PARMLIBA
  COPY OUTDD=PROCLIB,INDD=PROCLIBA
/*
//SG111 EXEC PGM=IEHIOSUP,PARM=TSO,COND=(8,LT)
//SYSPRINT DD SYSOUT=A,UNIT=(3330,3)
//SYSUT1 DD DSNAME=SYS1.SVCLIB,DISP=(OLD,PASS),                    XXXXXXXX
//             VOLUME=(,RETAIN,SER=MVTRES),UNIT=151
/*
//SG112 EXEC PGM=IFCDIP00,COND=(8,LT)
//STEPLIB DD   DSN=SYS1.CI505,DISP=SHR
//SERERDS DD   DSN=SYS1.LOGREC,DISP=(NEW,KEEP),                    XXXXXXXXX
//             VOLUME=(,RETAIN,SER=MVTRES),                          XXXXXXXXX
//             SPACE=(TRK,(11),,CONTIG),UNIT=151
//SG113 EXEC PGM=IEHPROGM,COND=(8,LT)
//TARG DD VOLUME=SER=MVTRES,DISP=OLD,UNIT=151
//SYSPRINT DD SYSOUT=A,UNIT=(3330,3)
//SYSIN DD *
 CATLG CVOL=151=MVTRES,VOL=151=MVTRES,DSNAME=SYS1.LOGREC
/*
//SG114 EXEC PGM=IEHLIST,COND=(8,LT)
//SYSPRINT DD SPACE=(121,(1500,300),RLSE),
//             DCB=(RECFM=FB,LRECL=121,BLKSIZE=121),                   X
//             SYSOUT=A,UNIT=(3330,3)
//LINK DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//SYSRES DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=151
//PRC DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=151
//MAC DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=3330
//COB DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=151
//FOR DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=151
//SOR DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=151
//PL1 DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=151
//TEL DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=151
//ALG DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=151
//PARM DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=151
//UAD DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=151
//HLP DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=151
//CMD DD DISP=OLD,VOLUME=(,RETAIN,SER=MVTRES),UNIT=151
//IMG DD DISP=SHR,VOL=(,RETAIN,SER=MVTRES),UNIT=151
//SYSIN DD *
  LISTCTLG VOL=151=MVTRES
 LISTVTOC DUMP,VOL=151=MVTRES
 LISTPDS VOL=3330=MVTRES,DSNAME=SYS1.LINKLIB
 LISTPDS VOL=151=MVTRES,DSNAME=SYS1.SVCLIB
 LISTPDS VOL=151=MVTRES,DSNAME=SYS1.TELCMLIB
 LISTPDS VOL=151=MVTRES,DSNAME=SYS1.ALGLIB
 LISTPDS VOL=151=MVTRES,DSNAME=SYS1.PROCLIB
 LISTPDS VOL=3330=MVTRES,DSNAME=SYS1.MACLIB
 LISTPDS VOL=151=MVTRES,DSNAME=SYS1.COBLIB
 LISTPDS VOL=151=MVTRES,DSNAME=SYS1.FORTLIB
 LISTPDS VOL=151=MVTRES,DSNAME=SYS1.SORTLIB
 LISTPDS VOL=151=MVTRES,DSNAME=SYS1.PL1LIB
 LISTPDS VOL=151=MVTRES,DSNAME=SYS1.PARMLIB
 LISTPDS VOL=151=MVTRES,DSNAME=SYS1.CMDLIB
 LISTPDS VOL=151=MVTRES,DSNAME=SYS1.UADS
 LISTPDS VOL=151=MVTRES,DSNAME=SYS1.HELP
 LISTPDS VOL=151=MVTRES,DSNAME=SYS1.IMAGELIB
/*
 
 
