// VARY  150,OFFLINE
// VARY  151,OFFLINE
// VARY  152,OFFLINE
//INIT      JOB  MSGLEVEL=1
//SYSFMT1  EXEC  PGM=IEHDASDR
//SYSPRINT  DD   SYSOUT=A
//IPL       DD   DISP=SHR,DSN=SYS1.SAMPLIB(IEAIPL00)
//SYSIN     DD   *
     ANALYZE  TODD=150,VTOC=10,EXTENT=10,FLAGTEST=NO,NEWVOLID=WORK01
     ANALYZE  TODD=151,VTOC=10,EXTENT=10,IPLDD=IPL,NEWVOLID=MVTRES,    X
               FLAGTEST=NO
     ANALYZE  TODD=152,VTOC=10,EXTENT=10,FLAGTEST=NO,NEWVOLID=WORK02
/*
//
