// VARY  191,OFFLINE
// VARY  192,OFFLINE
//INIT      JOB  MSGLEVEL=1
//SYSFMT1  EXEC  PGM=IEHDASDR
//SYSPRINT  DD   SYSOUT=A
//SYSIN     DD   *
     ANALYZE  TODD=191,VTOC=10,EXTENT=10,FLAGTEST=NO,NEWVOLID=DLIB05
     ANALYZE  TODD=192,VTOC=10,EXTENT=10,FLAGTEST=NO,NEWVOLID=DLIB06
/*
//
