// VARY  152,OFFLINE
//INIT      JOB  MSGLEVEL=1
//SYSFMT1  EXEC  PGM=IEHDASDR
//SYSPRINT  DD   SYSOUT=A
//SYSIN     DD   *
     ANALYZE  TODD=152,VTOC=10,EXTENT=10,FLAGTEST=NO,NEWVOLID=SCRTCH
/*
//
