//G01INTDL JOB MSGLEVEL=1
//INIT      EXEC PGM=IEHDASDR,PARM='N=1'
//SYSPRINT  DD SYSOUT=A
//SYSIN     DD *
  ANALYZE   TODD=14A,VTOC=1,EXTENT=29,NEWVOLID=FDLB60
/*
//
